99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
#include "esp32_mquickjs_ble.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_BLE

#include "esp32_mquickjs_ble_runtime_resources.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_nvs_flash_boot.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_wireless_core.h"
#include "utils/esp32_mquickjs_byte_source.h"

#include <stdatomic.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "host/ble_att.h"
#include "host/ble_gap.h"
#include "host/ble_gatt.h"
#include "host/ble_hs.h"
#include "host/ble_hs_adv.h"
#include "host/ble_hs_id.h"
#include "host/ble_hs_mbuf.h"
#include "host/ble_sm.h"
#include "host/ble_store.h"
#include "host/ble_uuid.h"
#include "host/util/util.h"
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "os/os_mbuf.h"
#include "services/gap/ble_svc_gap.h"

#define BLE_DEFAULT_TIMEOUT_MS 10000U
#define BLE_PAIRING_TIMEOUT_MS 30000U
#define BLE_REOPEN_QUIESCE_MS 50U
#define BLE_CONNECT_CANCEL_QUIESCE_MS 2000U
#define BLE_DEFAULT_MTU 256U
#define BLE_MAX_DEVICE_NAME 64U
#define BLE_INVALID_CONN_HANDLE UINT16_MAX
#define BLE_MAX_SUBSCRIPTIONS CONFIG_ESP32_MQUICKJS_BLE_MAX_CHARACTERISTICS
#define BLE_UUID_TEXT_MAX 37U

typedef enum {
    BLE_LIFECYCLE_CLOSED = 0,
    BLE_LIFECYCLE_OPENING,
    BLE_LIFECYCLE_ACTIVE,
    BLE_LIFECYCLE_CLOSING,
    BLE_LIFECYCLE_FAILED,
} ble_lifecycle_t;

typedef enum {
    BLE_STOP_RUNNING = 0,
    BLE_STOP_COMPLETED,
    BLE_STOP_CONNECTED,
    BLE_STOP_CLOSED,
    BLE_STOP_ERROR,
} ble_stop_reason_t;

typedef enum {
    BLE_OWN_ADDRESS_AUTO = 0,
    BLE_OWN_ADDRESS_PUBLIC,
    BLE_OWN_ADDRESS_RANDOM_STATIC,
    BLE_OWN_ADDRESS_RPA,
} ble_own_address_request_t;

typedef enum {
    BLE_CONTROL_DISCONNECTED = 0,
    BLE_CONTROL_MTU,
    BLE_CONTROL_SECURITY,
    BLE_CONTROL_PAIRING,
} ble_control_event_kind_t;

typedef struct {
    uint32_t generation;
    uint32_t sequence;
    int64_t timestamp_us;
    ble_addr_t peer;
    uint8_t event_type;
    int8_t rssi;
    uint8_t length;
    uint16_t pool_index;
} ble_scan_event_t;

typedef struct {
    uint32_t generation;
    uint32_t sequence;
    int64_t timestamp_us;
    uint16_t connection_index;
    uint32_t connection_generation;
} ble_advertiser_event_t;

typedef struct {
    uint32_t adapter_generation;
    uint32_t connection_generation;
    uint32_t sequence;
    int64_t timestamp_us;
    ble_control_event_kind_t kind;
    int status;
    uint16_t mtu;
    uint32_t request_id;
    uint8_t pairing_action;
    uint32_t passkey;
    int64_t expires_at_us;
} ble_connection_event_t;

typedef struct {
    uint32_t adapter_generation;
    uint32_t connection_generation;
    uint32_t subscription_generation;
    uint32_t sequence;
    int64_t timestamp_us;
    bool indication;
    uint16_t length;
    uint16_t pool_index;
} ble_notification_event_t;

typedef enum {
    BLE_SERVER_EVENT_WRITE = 0,
    BLE_SERVER_EVENT_SUBSCRIPTION,
} ble_server_event_kind_t;

typedef struct {
    uint32_t adapter_generation;
    uint32_t sequence;
    int64_t timestamp_us;
    ble_server_event_kind_t kind;
    uint16_t conn_handle;
    uint16_t characteristic_index;
    uint16_t offset;
    uint16_t length;
    uint16_t pool_index;
    bool notify;
    bool indicate;
} ble_server_event_t;

typedef struct {
    uint32_t generation;
} ble_adapter_ref_t;

typedef struct {
    uint32_t adapter_generation;
    uint32_t generation;
} ble_scanner_ref_t;

typedef struct {
    uint32_t adapter_generation;
    uint32_t generation;
} ble_advertiser_ref_t;

typedef struct {
    uint32_t adapter_generation;
    uint16_t index;
    uint32_t generation;
} ble_connection_ref_t;

typedef struct {
    uint32_t adapter_generation;
    uint16_t connection_index;
    uint32_t connection_generation;
    uint16_t subscription_index;
    uint32_t subscription_generation;
} ble_subscription_ref_t;

typedef struct {
    uint32_t adapter_generation;
} ble_server_ref_t;

typedef struct {
    uint32_t adapter_generation;
    uint16_t index;
} ble_local_characteristic_ref_t;

typedef struct {
    ble_uuid_any_t uuid;
    uint16_t start_handle;
    uint16_t end_handle;
    uint16_t first_characteristic;
    uint16_t characteristic_count;
} ble_remote_service_t;

typedef struct {
    ble_uuid_any_t uuid;
    uint16_t declaration_handle;
    uint16_t value_handle;
    uint8_t properties;
    uint16_t first_descriptor;
    uint16_t descriptor_count;
} ble_remote_characteristic_t;

typedef struct {
    ble_uuid_any_t uuid;
    uint16_t handle;
} ble_remote_descriptor_t;

typedef struct {
    _Atomic bool allocated;
    _Atomic bool open;
    _Atomic uint32_t generation;
    uint16_t value_handle;
    uint16_t cccd_handle;
    bool indication;
    esp32_mquickjs_event_queue_t *queue;
    JSGCRef queue_ref;
    bool queue_rooted;
    esp32_mquickjs_native_pool_t free_slots;
    uint8_t *payloads;
    uint16_t *lengths;
    uint32_t capacity;
    _Atomic uint32_t sequence;
    _Atomic uint32_t received;
    _Atomic uint32_t dropped;
} ble_subscription_t;

typedef struct {
    _Atomic bool allocated;
    _Atomic bool reserved;
    _Atomic bool open;
    _Atomic bool release_on_disconnect;
    _Atomic bool incoming_pending;
    _Atomic uint32_t incoming_advertiser_generation;
    _Atomic bool central;
    _Atomic uint16_t conn_handle;
    _Atomic uint32_t generation;
    ble_addr_t peer;
    _Atomic uint16_t mtu;
    _Atomic int8_t rssi;
    _Atomic bool rssi_valid;
    struct ble_gap_sec_state security;
    esp32_mquickjs_event_queue_t *queue;
    JSGCRef queue_ref;
    bool queue_rooted;
    const uint8_t gatt_lane_key;
    _Atomic uint32_t sequence;
    _Atomic bool terminal_pending;
    _Atomic uint32_t gatt_pending;
    esp32_mquickjs_wireless_native_operation_t connect_operation;
    uint32_t pairing_request_id;
    int64_t pairing_expires_at_us;
    uint8_t pairing_action;
    uint32_t pairing_passkey;
    uint32_t discovery_generation;
    ble_remote_service_t *services;
    ble_remote_characteristic_t *characteristics;
    ble_remote_descriptor_t *descriptors;
    uint16_t service_count;
    uint16_t characteristic_count;
    uint16_t descriptor_count;
    ble_subscription_t subscriptions[BLE_MAX_SUBSCRIPTIONS];
    _Atomic(struct esp32_mquickjs_future_driver_state *) active_gap_state;
    _Atomic(struct esp32_mquickjs_future_driver_state *) active_gatt_state;
} ble_connection_slot_t;

