99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
typedef struct {
    bool open;
    bool central;
    uint16_t mtu;
    int8_t rssi;
    bool rssi_valid;
    ble_addr_t peer;
    struct ble_gap_sec_state security;
} ble_connection_snapshot_t;

typedef struct {
    _Atomic bool allocated;
    _Atomic bool open;
    _Atomic bool active;
    _Atomic uint32_t generation;
    esp32_mquickjs_event_queue_t *queue;
    JSGCRef queue_ref;
    bool queue_rooted;
    esp32_mquickjs_native_pool_t free_slots;
    uint8_t *payloads;
    uint32_t capacity;
    int64_t started_at_us;
    _Atomic ble_stop_reason_t stop_reason;
    _Atomic uint32_t sequence;
    _Atomic uint32_t reports;
    _Atomic uint32_t dropped;
    _Atomic uint32_t malformed;
} ble_scanner_t;

typedef struct {
    _Atomic bool allocated;
    _Atomic bool open;
    _Atomic bool active;
    bool connectable;
    bool scannable;
    _Atomic uint32_t generation;
    esp32_mquickjs_event_queue_t *queue;
    JSGCRef queue_ref;
    bool queue_rooted;
    _Atomic ble_stop_reason_t stop_reason;
    _Atomic uint32_t sequence;
    _Atomic uint32_t incoming;
    _Atomic uint32_t dropped;
} ble_advertiser_t;

typedef struct {
    char *id;
    ble_uuid_any_t uuid;
    uint16_t value_handle;
    uint16_t max_length;
    uint32_t properties;
    bool store_writes;
    uint8_t *value;
    uint16_t length;
    portMUX_TYPE lock;
} ble_local_characteristic_t;

typedef struct {
    bool configured;
    bool open;
    struct ble_gatt_svc_def *services;
    struct ble_gatt_chr_def **characteristic_defs;
    ble_uuid_any_t *service_uuids;
    ble_local_characteristic_t *characteristics;
    uint16_t service_count;
    uint16_t characteristic_count;
    esp32_mquickjs_event_queue_t *event_queue;
    JSGCRef event_queue_ref;
    bool event_queue_rooted;
    esp32_mquickjs_native_pool_t free_slots;
    uint8_t *event_payloads;
    uint32_t event_capacity;
    _Atomic uint32_t sequence;
    _Atomic uint32_t writes;
    _Atomic uint32_t notifications;
    _Atomic uint32_t indications;
    _Atomic uint32_t dropped;
} ble_gatt_server_t;

typedef struct {
    portMUX_TYPE lock;
    _Atomic ble_lifecycle_t lifecycle;
    JSContext *ctx;
    esp32_mquickjs_runtime_t *runtime;
    _Atomic uint32_t generation;
    _Atomic bool synchronized;
    bool port_initialized;
    bool host_started;
    ble_own_address_request_t own_address_request;
    uint8_t own_addr_type;
    uint8_t address[6];
    char device_name[BLE_MAX_DEVICE_NAME + 1];
    bool role_central;
    bool role_peripheral;
    uint16_t preferred_mtu;
    uint16_t max_connections;
    uint32_t pairing_timeout_ms;
    bool bonding;
    bool secure_connections;
    bool mitm;
    uint8_t io_capability;
    _Atomic uint32_t reset_count;
    _Atomic uint32_t dropped_connection_events;
    _Atomic int rejected_connection_error;
    _Atomic uint32_t next_pairing_request;
    ble_scanner_t scanner;
    ble_advertiser_t advertiser;
    ble_connection_slot_t connections[CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS];
    ble_gatt_server_t server;
} ble_adapter_t;

typedef enum {
    BLE_OP_OPEN = 0,
    BLE_OP_SCAN,
    BLE_OP_SCANNER_CLOSE,
    BLE_OP_ADVERTISE,
    BLE_OP_ADVERTISER_CLOSE,
    BLE_OP_CONNECT,
    BLE_OP_CONNECTION_CLOSE,
    BLE_OP_PAIR,
    BLE_OP_EXCHANGE_MTU,
    BLE_OP_READ_RSSI,
    BLE_OP_DISCOVER,
    BLE_OP_GATT_READ,
    BLE_OP_GATT_WRITE,
    BLE_OP_SUBSCRIBE,
    BLE_OP_SUBSCRIPTION_CLOSE,
    BLE_OP_SERVER_NOTIFY,
    BLE_OP_REMOVE_BOND,
    BLE_OP_CLEAR_BONDS,
    BLE_OP_ADAPTER_CLOSE,
} ble_operation_t;

struct esp32_mquickjs_future_driver_state {
    JSContext *ctx;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    ble_operation_t operation;
    uint32_t adapter_generation;
    uint16_t connection_index;
    uint32_t connection_generation;
    uint16_t attribute_index;
    uint16_t subscription_index;
    uint32_t subscription_generation;
    uint32_t timeout_ms;
    int64_t open_not_before_us;
    JSGCRef owner_ref;
    bool owner_rooted;
    JSGCRef queue_ref;
    bool queue_rooted;
    uint8_t *payload;
    size_t payload_length;
    uint16_t attribute_handle;
    uint16_t cccd_handle;
    uint16_t mtu;
    uint16_t max_bytes;
    uint16_t max_services;
    uint16_t max_characteristics;
    uint16_t max_descriptors;
    uint16_t discover_service_index;
    bool include_descriptors;
    bool response;
    bool indication;
    bool gatt_accounted;
    bool gatt_started;
    bool started;
    bool open_initialization_started;
    bool cancelled;
    bool transferred;
    _Atomic bool detached;
    uint32_t native_identity;
    uint16_t callback_refs;
    bool notify_submitting;
    uint16_t notify_handles[CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS];
    bool notify_pending[CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS];
    bool result_bool;
    int result_count;
    uint16_t attempted_connections;
    uint16_t submitted_connections;
    _Atomic uint16_t pending_confirmations;
    int host_code;
    int att_code;
    const char *error_code;
    ble_addr_t peer;
    struct ble_gap_disc_params scan_params;
    int32_t duration_ms;
    struct ble_gap_adv_params adv_params;
    uint8_t adv_data[BLE_HS_ADV_MAX_SZ];
    uint8_t adv_data_length;
    uint8_t scan_response[BLE_HS_ADV_MAX_SZ];
    uint8_t scan_response_length;
    _Atomic bool completed;
};

static ble_adapter_t s_ble = {
    .lock = portMUX_INITIALIZER_UNLOCKED,
    .lifecycle = BLE_LIFECYCLE_CLOSED,
};
static _Atomic uint32_t s_ble_next_generation = 1;
static _Atomic uint32_t s_ble_next_scanner_generation = 1;
static _Atomic uint32_t s_ble_next_advertiser_generation = 1;
static _Atomic uint32_t s_ble_next_connection_generation = 1;
static _Atomic uint32_t s_ble_next_subscription_generation = 1;
static int64_t s_ble_reopen_not_before_us;
static ble_adapter_ref_t s_ble_closed_adapter_ref;
static ble_scanner_ref_t s_ble_closed_scanner_ref;
static ble_advertiser_ref_t s_ble_closed_advertiser_ref;
static ble_connection_ref_t s_ble_closed_connection_ref;
static ble_subscription_ref_t s_ble_closed_subscription_ref;
static const uint8_t s_ble_gap_lane_key;
static const uint8_t s_ble_adapter_lane_key;
static const uint8_t s_ble_server_lane_key;
static _Atomic(esp32_mquickjs_future_driver_state_t *) s_ble_open_state;
static _Atomic(esp32_mquickjs_future_driver_state_t *) s_ble_server_notify_state;

