99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
typedef struct {
    _Atomic bool requested;
    _Atomic bool worker_submitted;
    _Atomic bool worker_completed;
    _Atomic int worker_result;
    uint32_t generation;
    int64_t retry_not_before_us;
} ble_orphan_close_state_t;

static ble_orphan_close_state_t s_ble_orphan_close;

static const char *TAG = "esp32qjs_ble";
/* Boot-lifetime lock: GAP callbacks are outside the NimBLE Host lock. Keep
 * their slot transitions ordered with identity validation + native termination.
 * Recursive because a GAP callback can reject an unclaimed connection. */
static StaticSemaphore_t s_ble_connection_mutex_storage;
static SemaphoreHandle_t s_ble_connection_mutex;
/* Survives adapter/runtime generations. Never reset identity allocation. */
static esp32_mquickjs_wireless_operation_registry_t s_ble_operations;
/* Scanner callback cookies and admission survive adapter/runtime teardown.
 * A copied NimBLE callback may enter after successful disc_cancel(). */
static uintptr_t s_ble_scan_next_identity = 1;
static uintptr_t s_ble_scan_callback_identity;
static uint32_t s_ble_scan_callback_refs;
static uintptr_t s_ble_advertise_next_identity = 1;
static uintptr_t s_ble_advertise_callback_identity;
static uint32_t s_ble_advertise_callback_refs;

static int ble_gap_event_callback(struct ble_gap_event *event, void *arg);
static void ble_terminate_unclaimed_connection(ble_connection_slot_t *slot,
                                                uint32_t generation);
static int ble_gatt_server_access(uint16_t conn_handle, uint16_t attr_handle,
                                  struct ble_gatt_access_ctxt *ctxt, void *arg);
static void ble_gatt_server_register(void);
static void ble_publish_server_subscription(const struct ble_gap_event *event);
static void ble_free_pools(ble_adapter_t *adapter);
static bool ble_parse_gatt_server(JSContext *ctx, JSValue definition,
                                  ble_adapter_t *adapter);
static int ble_server_event_pool_acquire(ble_gatt_server_t *server,
                                         uint16_t *out_index);
static void ble_server_event_pool_release(ble_gatt_server_t *server,
                                          uint16_t index);
static void ble_native_state_complete(esp32_mquickjs_future_driver_state_t *state);
static void ble_native_states_quiesced(void);
static void ble_future_state_storage_free(
    esp32_mquickjs_future_driver_state_t *state);
static JSValue ble_bool_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state);
static JSValue ble_properties_to_js(JSContext *ctx, uint32_t properties);
static esp32_mquickjs_resource_key_t ble_gap_resource_key(
    const esp32_mquickjs_future_driver_state_t *state);
static esp32_mquickjs_resource_key_t ble_gatt_resource_key(
    const esp32_mquickjs_future_driver_state_t *state);
static esp32_mquickjs_resource_key_t ble_adapter_resource_key(
    const esp32_mquickjs_future_driver_state_t *state);
static void ble_reset_orphan_close(void);
static void ble_request_orphan_close(uint32_t generation);
static bool ble_orphan_close_poller(JSContext *ctx,
                                    esp32_mquickjs_runtime_t *runtime,
                                    void *opaque);

static void ble_note_native_deinit(void)
{
    s_ble_reopen_not_before_us =
        esp_timer_get_time() + (int64_t)BLE_REOPEN_QUIESCE_MS * 1000;
}

static int ble_runtime_stop_host(void *opaque)
{
    (void)opaque;
    return nimble_port_stop();
}

static int ble_runtime_deinit_port(void *opaque)
{
    esp_err_t err;

    (void)opaque;
    err = nimble_port_deinit();
    if (err == ESP_OK) {
        ble_native_states_quiesced();
        ble_note_native_deinit();
    }
    return err;
}

static int ble_cleanup_native(ble_adapter_t *adapter)
{
    esp32_mquickjs_ble_runtime_resources_t resources;
    esp32_mquickjs_ble_runtime_resource_ops_t ops = {
        .stop_host = ble_runtime_stop_host,
        .deinit_port = ble_runtime_deinit_port,
    };
    int result;

    if (adapter == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    resources = (esp32_mquickjs_ble_runtime_resources_t){
        .port_initialized = adapter->port_initialized,
        .host_started = adapter->host_started,
    };
    result = esp32_mquickjs_ble_runtime_resources_deinit(&resources, &ops);
    adapter->port_initialized = resources.port_initialized;
    adapter->host_started = resources.host_started;
    if (!adapter->host_started) {
        adapter->synchronized = false;
    }
    return result;
}

static bool ble_has_pending_connects(void)
{
    uint16_t index;
    for (index = 0; index < s_ble.max_connections; ++index) {
        if (!esp32_mquickjs_wireless_native_operation_is_quiescent(
                &s_ble.connections[index].connect_operation)) {
            return true;
        }
    }
    return false;
}

static bool ble_wait_for_pending_connects(uint32_t timeout_ms)
{
    int64_t deadline_us = esp_timer_get_time() +
                          (int64_t)timeout_ms * 1000;
    while (!esp32_mquickjs_wireless_close_can_release(
        0, !ble_has_pending_connects())) {
        if (esp_timer_get_time() >= deadline_us) return false;
        vTaskDelay(1);
    }
    return true;
}

static uint32_t ble_next_generation(_Atomic uint32_t *counter)
{
    uint32_t generation = atomic_fetch_add_explicit(
        counter, 1, memory_order_relaxed);
    if (generation == 0) {
        generation = atomic_fetch_add_explicit(counter, 1,
                                               memory_order_relaxed);
    }
    return generation;
}

static bool ble_is_object(JSContext *ctx, JSValue value)
{
    return JS_GetClassID(ctx, value) >= 0 && !JS_IsArray(ctx, value);
}

static bool ble_to_u32(JSContext *ctx, JSValue value, uint32_t *out)
{
    double raw;
    if (out == NULL || JS_ToNumber(ctx, &raw, value) != 0 || raw < 0 ||
        raw > UINT32_MAX || (double)(uint32_t)raw != raw) {
        return false;
    }
    *out = (uint32_t)raw;
    return true;
}

static bool ble_string_equals(JSContext *ctx, JSValue value,
                              const char *expected)
{
    JSCStringBuf buffer;
    const char *text;
    return JS_IsString(ctx, value) &&
           (text = JS_ToCString(ctx, value, &buffer)) != NULL &&
           strcmp(text, expected) == 0;
}

static bool ble_validate_option_keys(JSContext *ctx, JSValue options,
                                     const char *api_name,
                                     const char *const *allowed,
                                     size_t allowed_count)
{
    return esp32_mquickjs_validate_plain_options(
        ctx, options, api_name, allowed, allowed_count);
}

static const char *ble_address_type_name(uint8_t type)
{
    switch (type) {
    case BLE_ADDR_PUBLIC:
        return "public";
    case BLE_ADDR_RANDOM:
        return "random-static";
    case BLE_ADDR_PUBLIC_ID:
        return "random-private-resolvable";
    case BLE_ADDR_RANDOM_ID:
        return "random-private-resolvable";
    default:
        return "random-private-nonresolvable";
    }
}

