99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static void ble_format_address(const uint8_t address[6], char output[18])
{
    uint8_t network_order[6];
    size_t index;
    for (index = 0; index < 6U; ++index)
        network_order[index] = address[5U - index];
    esp32_mquickjs_wireless_format_address(network_order, output);
}

static bool ble_parse_address_text(JSContext *ctx, JSValue value,
                                   uint8_t output[6])
{
    JSCStringBuf buffer;
    const char *text;
    size_t index;
    uint8_t network_order[6];
    if (!JS_IsString(ctx, value) ||
        (text = JS_ToCString(ctx, value, &buffer)) == NULL ||
        !esp32_mquickjs_wireless_parse_address(text, network_order)) {
        JS_ThrowTypeError(ctx, "BLE address must be xx:xx:xx:xx:xx:xx");
        return false;
    }
    for (index = 0; index < 6U; ++index)
        output[5U - index] = network_order[index];
    return true;
}

static bool ble_parse_address(JSContext *ctx, JSValue value, ble_addr_t *out)
{
    static const char *const allowed[] = {"address", "type"};
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool result = false;

    if (out == NULL || !ble_is_object(ctx, value) ||
        !ble_validate_option_keys(ctx, value, "BLEAddress", allowed, 2)) {
        if (!JS_HasException(ctx)) {
            JS_ThrowTypeError(ctx, "BLE address must be an object");
        }
        goto done;
    }
    memset(out, 0, sizeof(*out));
    *property = JS_GetPropertyStr(ctx, value, "address");
    if (JS_IsException(*property) ||
        !ble_parse_address_text(ctx, *property, out->val)) {
        goto done;
    }
    *property = JS_GetPropertyStr(ctx, value, "type");
    if (JS_IsException(*property)) goto done;
    if (ble_string_equals(ctx, *property, "public")) out->type = BLE_ADDR_PUBLIC;
    else if (ble_string_equals(ctx, *property, "random-static")) out->type = BLE_ADDR_RANDOM;
    else if (ble_string_equals(ctx, *property, "random-private-resolvable")) out->type = BLE_ADDR_RANDOM_ID;
    else if (ble_string_equals(ctx, *property, "random-private-nonresolvable")) out->type = BLE_ADDR_RANDOM;
    else {
        JS_ThrowTypeError(ctx, "invalid BLE address type");
        goto done;
    }
    result = true;
done:
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

static int ble_gatt_server_access(uint16_t conn_handle, uint16_t attr_handle,
                                  struct ble_gatt_access_ctxt *ctxt, void *arg)
{
    ble_local_characteristic_t *local = arg;
    ble_gatt_server_t *server = &s_ble.server;
    size_t characteristic_index;
    uint16_t length;
    int rc;
    if (ctxt == NULL || local == NULL || !server->open) {
        return BLE_ATT_ERR_UNLIKELY;
    }
    characteristic_index = (size_t)(local - server->characteristics);
    if (characteristic_index >= server->characteristic_count ||
        attr_handle != local->value_handle) return BLE_ATT_ERR_INVALID_HANDLE;
    if (ctxt->op == BLE_GATT_ACCESS_OP_READ_CHR) {
        taskENTER_CRITICAL(&local->lock);
        if (ctxt->offset > local->length) {
            taskEXIT_CRITICAL(&local->lock);
            return BLE_ATT_ERR_INVALID_OFFSET;
        }
        length = local->length - ctxt->offset;
        rc = os_mbuf_append(ctxt->om, local->value + ctxt->offset, length);
        taskEXIT_CRITICAL(&local->lock);
        return rc == 0 ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
    }
    if (ctxt->op == BLE_GATT_ACCESS_OP_WRITE_CHR) {
        ble_server_event_t server_event = {0};
        uint16_t pool_index;
        length = OS_MBUF_PKTLEN(ctxt->om);
        if ((uint32_t)ctxt->offset + length > local->max_length)
            return BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN;
        if (!ble_server_event_pool_acquire(server, &pool_index)) {
            atomic_fetch_add_explicit(&server->dropped, 1,
                                      memory_order_relaxed);
            return BLE_ATT_ERR_INSUFFICIENT_RES;
        }
        rc = os_mbuf_copydata(
            ctxt->om, 0, length,
            server->event_payloads + pool_index *
                                         CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES);
        if (rc != 0) {
            ble_server_event_pool_release(server, pool_index);
            return BLE_ATT_ERR_UNLIKELY;
        }
        if (local->store_writes) {
            taskENTER_CRITICAL(&local->lock);
            (void)esp32_mquickjs_wireless_local_value_write(
                local->value, local->max_length, &local->length, ctxt->offset,
                server->event_payloads + pool_index *
                    CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES,
                length);
            taskEXIT_CRITICAL(&local->lock);
        }
        server_event.adapter_generation = s_ble.generation;
        server_event.sequence = atomic_fetch_add_explicit(
            &server->sequence, 1, memory_order_relaxed) + 1U;
        server_event.timestamp_us = esp_timer_get_time();
        server_event.kind = BLE_SERVER_EVENT_WRITE;
        server_event.conn_handle = conn_handle;
        server_event.characteristic_index = characteristic_index;
        server_event.offset = ctxt->offset;
        server_event.length = length;
        server_event.pool_index = pool_index;
        if (!esp32_mquickjs_event_queue_try_send_from_callback(
                server->event_queue, &server_event)) {
            ble_server_event_pool_release(server, pool_index);
            atomic_fetch_add_explicit(&server->dropped, 1,
                                      memory_order_relaxed);
            return BLE_ATT_ERR_INSUFFICIENT_RES;
        }
        atomic_fetch_add_explicit(&server->writes, 1, memory_order_relaxed);
        return 0;
    }
    return BLE_ATT_ERR_REQ_NOT_SUPPORTED;
}

static void ble_gatt_server_register(void)
{
    ble_gatt_server_t *server = &s_ble.server;
    esp32_mquickjs_future_driver_state_t *open_state =
        atomic_load_explicit(&s_ble_open_state, memory_order_acquire);
    int rc;
    if (!server->configured) return;
    rc = ble_gatts_count_cfg(server->services);
    if (rc == 0) rc = ble_gatts_add_svcs(server->services);
    server->open = rc == 0;
    if (rc != 0 && open_state != NULL) open_state->host_code = rc;
}

static void ble_publish_server_subscription(const struct ble_gap_event *event)
{
    ble_gatt_server_t *server = &s_ble.server;
    ble_server_event_t server_event = {0};
    uint16_t index;
    if (event == NULL || !server->open || server->event_queue == NULL) return;
    for (index = 0; index < server->characteristic_count; ++index) {
        if (server->characteristics[index].value_handle ==
            event->subscribe.attr_handle) {
            server_event.adapter_generation = s_ble.generation;
            server_event.sequence = atomic_fetch_add_explicit(
                &server->sequence, 1, memory_order_relaxed) + 1U;
            server_event.timestamp_us = esp_timer_get_time();
            server_event.kind = BLE_SERVER_EVENT_SUBSCRIPTION;
            server_event.conn_handle = event->subscribe.conn_handle;
            server_event.characteristic_index = index;
            server_event.notify = event->subscribe.cur_notify;
            server_event.indicate = event->subscribe.cur_indicate;
            if (!esp32_mquickjs_event_queue_try_send_from_callback(
                    server->event_queue, &server_event))
                atomic_fetch_add_explicit(&server->dropped, 1,
                                          memory_order_relaxed);
            return;
        }
    }
}

static JSValue ble_address_to_js(JSContext *ctx, const ble_addr_t *address)
{
    char text[18];
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    ble_format_address(address->val, text);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "address",
                                         JS_NewString(ctx, text)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "type",
            JS_NewString(ctx, ble_address_type_name(address->type)))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

static JSValue ble_throw_error(JSContext *ctx, const char *code, int host_code,
                               int att_code, int connection_id,
                               int attribute_handle)
{
    JSGCRef details_ref;
    JSValue *details = JS_PushGCRef(ctx, &details_ref);
    JSValue result;

    *details = JS_NewObject(ctx);
    if (JS_IsException(*details) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "hostCode", JS_NewInt32(ctx, host_code)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "attCode",
            att_code >= 0 ? JS_NewInt32(ctx, att_code) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "connectionId",
            connection_id >= 0 ? JS_NewInt32(ctx, connection_id) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(
            ctx, details, "attributeHandle",
            attribute_handle >= 0 ? JS_NewInt32(ctx, attribute_handle)
                                  : JS_NULL)) {
        JS_PopGCRef(ctx, &details_ref);
        return JS_EXCEPTION;
    }
    result = esp32_mquickjs_throw_native_error(
        ctx, code, "ble", "Bluetooth LE operation failed", *details);
    JS_PopGCRef(ctx, &details_ref);
    return result;
}

