99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static JSValue ble_future_call_and_wait(JSContext *ctx, JSValue receiver,
                                        const char *method_name, int argc,
                                        JSValue *argv)
{
    JSGCRef receiver_ref, method_ref;
    JSValue *rooted_receiver = JS_PushGCRef(ctx, &receiver_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;
    *rooted_receiver = receiver;
    *method = JS_GetPropertyStr(ctx, *rooted_receiver, method_name);
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *rooted_receiver, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    return result;
}

static void ble_retain_owner(JSContext *ctx, JSValue owner,
                             esp32_mquickjs_future_driver_state_t *state)
{
    *JS_AddGCRef(ctx, &state->owner_ref) = owner;
    state->owner_rooted = true;
}

static uint16_t ble_ms_to_625us(double value)
{
    double units = value / 0.625;
    if (units < 1.0) units = 1.0;
    if (units > 65535.0) units = 65535.0;
    return (uint16_t)(units + 0.5);
}

static bool ble_get_number(JSContext *ctx, JSValue object, const char *name,
                           double *value, bool *present)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool result = false;
    *property = JS_GetPropertyStr(ctx, object, name);
    if (JS_IsException(*property)) goto done;
    *present = !JS_IsUndefined(*property);
    if (!*present || JS_ToNumber(ctx, value, *property) == 0) result = true;
done:
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

static bool ble_get_bool(JSContext *ctx, JSValue object, const char *name,
                         bool default_value, bool *out)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    int raw;
    bool result = false;
    *out = default_value;
    *property = JS_GetPropertyStr(ctx, object, name);
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!JS_IsBool(*property)) {
            JS_ThrowTypeError(ctx, "%s must be a boolean", name);
            goto done;
        }
        raw = JS_VALUE_GET_SPECIAL_VALUE(*property);
        *out = raw != 0;
    }
    result = true;
done:
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

static ble_adapter_t *ble_adapter_from_value(JSContext *ctx, JSValue value,
                                             bool throw_if_stale)
{
    ble_adapter_ref_t *ref;
    if (JS_GetClassID(ctx, value) != JS_CLASS_BLE_ADAPTER ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "expected a BLEAdapter instance");
        return NULL;
    }
    if (s_ble.lifecycle != BLE_LIFECYCLE_ACTIVE ||
        ref->generation != s_ble.generation) {
        if (throw_if_stale) {
            JS_ThrowReferenceError(ctx,
                "BLE_STALE_ADAPTER: BLE adapter is closed");
        }
        return NULL;
    }
    return &s_ble;
}

static ble_connection_slot_t *ble_connection_from_value(
    JSContext *ctx, JSValue value, ble_connection_ref_t **out_ref,
    bool throw_if_stale)
{
    ble_connection_ref_t *ref;
    ble_connection_slot_t *slot = NULL;
    if (JS_GetClassID(ctx, value) != JS_CLASS_BLE_CONNECTION ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "expected a BLEConnection instance");
        return NULL;
    }
    if (s_ble.lifecycle == BLE_LIFECYCLE_ACTIVE &&
        ref->adapter_generation == s_ble.generation &&
        ref->index < s_ble.max_connections) {
        slot = &s_ble.connections[ref->index];
        if (!slot->allocated || slot->generation != ref->generation) slot = NULL;
    }
    if (slot == NULL && throw_if_stale) {
        JS_ThrowReferenceError(ctx,
            "BLE_STALE_CONNECTION: BLE connection is closed");
    }
    if (out_ref != NULL) *out_ref = ref;
    return slot;
}

static ble_connection_slot_t *ble_find_connection(uint16_t conn_handle,
                                                   uint16_t *out_index)
{
    uint16_t index;
    for (index = 0; index < s_ble.max_connections; ++index) {
        ble_connection_slot_t *slot = &s_ble.connections[index];
        if (slot->allocated && slot->conn_handle == conn_handle) {
            if (out_index != NULL) *out_index = index;
            return slot;
        }
    }
    return NULL;
}

static ble_connection_slot_t *ble_reserve_connection(bool central,
                                                       uint16_t *out_index)
{
    uint16_t index;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    for (index = 0; index < s_ble.max_connections; ++index) {
        ble_connection_slot_t *slot = &s_ble.connections[index];
        if (!slot->allocated && !slot->reserved &&
            atomic_load(&slot->active_gatt_state) == NULL &&
            esp32_mquickjs_wireless_native_operation_is_quiescent(&slot->connect_operation)) {
            if (slot->queue != NULL)
                (void)esp32_mquickjs_event_queue_discard_all(slot->queue);
            slot->reserved = true;
            slot->release_on_disconnect = false;
            slot->incoming_pending = false;
            slot->central = central;
            slot->generation = ble_next_generation(
                &s_ble_next_connection_generation);
            slot->conn_handle = BLE_INVALID_CONN_HANDLE;
            slot->mtu = 23;
            slot->rssi = 0;
            slot->rssi_valid = false;
            taskENTER_CRITICAL(&s_ble.lock);
            memset(&slot->peer, 0, sizeof(slot->peer));
            memset(&slot->security, 0, sizeof(slot->security));
            taskEXIT_CRITICAL(&s_ble.lock);
            slot->pairing_request_id = 0;
            slot->pairing_expires_at_us = 0;
            slot->pairing_action = 0;
            slot->pairing_passkey = 0;
            slot->discovery_generation = 1;
            atomic_store_explicit(&slot->sequence, 0, memory_order_relaxed);
            atomic_store_explicit(&slot->terminal_pending, false,
                                  memory_order_relaxed);
            atomic_store_explicit(&slot->gatt_pending, 0,
                                  memory_order_relaxed);
            if (out_index != NULL) *out_index = index;
            xSemaphoreGiveRecursive(s_ble_connection_mutex);
            return slot;
        }
    }
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return NULL;
}

