99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static void ble_release_event_queue(
    JSContext *ctx, esp32_mquickjs_event_queue_t **queue,
    JSGCRef *queue_ref, bool *queue_rooted)
{
    if (queue == NULL || queue_ref == NULL || queue_rooted == NULL) return;
    if (*queue_rooted) {
        (void)esp32_mquickjs_event_queue_dispose(ctx, queue_ref->val);
        JS_DeleteGCRef(ctx, queue_ref);
        *queue_rooted = false;
    } else if (*queue != NULL) {
        (void)esp32_mquickjs_event_queue_close(*queue);
        (void)esp32_mquickjs_event_queue_discard_all(*queue);
    }
    *queue = NULL;
}

static void ble_retire_handle(JSContext *ctx, JSValue value,
                              int class_id, void *closed_ref)
{
    void *ref;

    if (ctx == NULL || closed_ref == NULL ||
        JS_GetClassID(ctx, value) != class_id ||
        (ref = JS_GetOpaque(ctx, value)) == NULL || ref == closed_ref) {
        return;
    }
    JS_SetOpaque(ctx, value, closed_ref);
    heap_caps_free(ref);
}

static void ble_close_subscription(ble_subscription_t *subscription)
{
    if (subscription == NULL || !subscription->allocated) return;
    subscription->open = false;
    ble_release_event_queue(s_ble.ctx, &subscription->queue,
                            &subscription->queue_ref,
                            &subscription->queue_rooted);
    heap_caps_free(subscription->payloads);
    heap_caps_free(subscription->lengths);
    memset(subscription, 0, sizeof(*subscription));
}

static void ble_clear_remote_discovery(ble_connection_slot_t *slot)
{
    if (slot == NULL) return;
    heap_caps_free(slot->services);
    heap_caps_free(slot->characteristics);
    heap_caps_free(slot->descriptors);
    slot->services = NULL;
    slot->characteristics = NULL;
    slot->descriptors = NULL;
    slot->service_count = 0;
    slot->characteristic_count = 0;
    slot->descriptor_count = 0;
    slot->discovery_generation++;
    if (slot->discovery_generation == 0) slot->discovery_generation = 1;
}

static void ble_release_connection(ble_connection_slot_t *slot)
{
    uint16_t index;
    if (slot == NULL) return;
    slot->open = false;
    slot->reserved = false;
    if (slot->queue != NULL) {
        (void)esp32_mquickjs_event_queue_close(slot->queue);
        (void)esp32_mquickjs_event_queue_discard_all(slot->queue);
    }
    for (index = 0; index < BLE_MAX_SUBSCRIPTIONS; ++index) {
        ble_close_subscription(&slot->subscriptions[index]);
    }
    ble_clear_remote_discovery(slot);
    slot->allocated = false;
    slot->conn_handle = BLE_INVALID_CONN_HANDLE;
}

static void ble_recycle_connection(ble_connection_slot_t *slot)
{
    uint16_t index;
    if (slot == NULL) return;
    slot->open = false;
    slot->reserved = false;
    if (slot->queue != NULL)
        (void)esp32_mquickjs_event_queue_discard_all(slot->queue);
    for (index = 0; index < BLE_MAX_SUBSCRIPTIONS; ++index)
        ble_close_subscription(&slot->subscriptions[index]);
    ble_clear_remote_discovery(slot);
    atomic_store_explicit(&slot->active_gap_state, NULL,
                          memory_order_release);
    atomic_store_explicit(&slot->active_gatt_state, NULL,
                          memory_order_release);
    slot->allocated = false;
    slot->conn_handle = BLE_INVALID_CONN_HANDLE;
}

static JSValue ble_new_connection_handle(JSContext *ctx, uint16_t index,
                                         ble_connection_slot_t *slot)
{
    ble_connection_ref_t *ref;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_BLE_CONNECTION);
    if (JS_IsException(*object)) goto fail;
    ref = heap_caps_calloc(1, sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    ref->adapter_generation = s_ble.generation;
    ref->index = index;
    ref->generation = slot->generation;
    JS_SetOpaque(ctx, *object, ref);
    if (!esp32_mquickjs_set_property_ref(ctx, object, "_eventQueue",
                                         slot->queue_ref.val)) {
        JS_SetOpaque(ctx, *object, NULL);
        heap_caps_free(ref);
        goto fail;
    }
    return JS_PopGCRef(ctx, &object_ref);
fail:
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static int ble_scan_pool_acquire(ble_scanner_t *scanner, uint16_t *slot)
{
    return scanner != NULL &&
           esp32_mquickjs_native_pool_acquire(&scanner->free_slots, slot);
}

static bool ble_event_queue_try_send_from_callback(void *destination,
                                                   const void *event)
{
    return esp32_mquickjs_event_queue_try_send_from_callback(destination,
                                                              event);
}

static void ble_scan_pool_release(ble_scanner_t *scanner, uint16_t slot)
{
    if (scanner != NULL && slot < scanner->capacity)
        (void)esp32_mquickjs_native_pool_release(&scanner->free_slots, slot);
}

static void ble_scan_event_drop(void *event, void *opaque)
{
    ble_scan_event_t *scan_event = event;
    ble_scanner_t *scanner = opaque;
    if (scan_event != NULL && scanner != NULL &&
        scan_event->generation == scanner->generation) {
        ble_scan_pool_release(scanner, scan_event->pool_index);
    }
}

static JSValue ble_scan_event_to_js(JSContext *ctx, const void *event,
                                    void *opaque)
{
    const ble_scan_event_t *scan_event = event;
    ble_scanner_t *scanner = opaque;
    uint8_t *payload = NULL;
    JSGCRef object_ref, peer_ref, data_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *peer = JS_PushGCRef(ctx, &peer_ref);
    JSValue *data = JS_PushGCRef(ctx, &data_ref);
    *object = JS_UNDEFINED;
    *peer = JS_UNDEFINED;
    *data = JS_UNDEFINED;
    if (scan_event == NULL || scanner == NULL ||
        scan_event->generation != scanner->generation ||
        scan_event->pool_index >= scanner->capacity) {
        JS_ThrowReferenceError(ctx, "BLE_STALE_ADAPTER: stale scan report");
        goto fail;
    }
    if (scan_event->length > 0) {
        payload = heap_caps_malloc(scan_event->length, MALLOC_CAP_8BIT);
        if (payload == NULL) {
            ble_scan_pool_release(scanner, scan_event->pool_index);
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }
        memcpy(payload,
               scanner->payloads + scan_event->pool_index * BLE_HS_ADV_MAX_SZ,
               scan_event->length);
    }
    ble_scan_pool_release(scanner, scan_event->pool_index);
    *data = esp32_mquickjs_new_owned_byte_view(ctx, payload,
                                               scan_event->length);
    payload = NULL;
    *peer = ble_address_to_js(ctx, &scan_event->peer);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*data) || JS_IsException(*peer) ||
        JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "type",
                                         JS_NewString(ctx, "report")) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "sequence",
                                         JS_NewUint32(ctx, scan_event->sequence)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "timestampUs",
                                         JS_NewInt64(ctx, scan_event->timestamp_us)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "peer", *peer) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "eventType",
            JS_NewString(ctx,
                scan_event->event_type == BLE_HCI_ADV_RPT_EVTYPE_SCAN_RSP
                    ? "scan-response"
                    : scan_event->event_type == BLE_HCI_ADV_RPT_EVTYPE_DIR_IND
                          ? "directed-advertisement"
                          : "advertisement")) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "rssi",
                                         JS_NewInt32(ctx, scan_event->rssi)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "connectable",
            JS_NewBool(scan_event->event_type == BLE_HCI_ADV_RPT_EVTYPE_ADV_IND ||
                       scan_event->event_type == BLE_HCI_ADV_RPT_EVTYPE_DIR_IND)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "scannable",
            JS_NewBool(scan_event->event_type == BLE_HCI_ADV_RPT_EVTYPE_ADV_IND ||
                       scan_event->event_type == BLE_HCI_ADV_RPT_EVTYPE_SCAN_IND)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "directed",
            JS_NewBool(scan_event->event_type == BLE_HCI_ADV_RPT_EVTYPE_DIR_IND)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "data", *data)) {
        goto fail;
    }
    JS_PopGCRef(ctx, &data_ref);
    JS_PopGCRef(ctx, &peer_ref);
    return JS_PopGCRef(ctx, &object_ref);
fail:
    heap_caps_free(payload);
    JS_PopGCRef(ctx, &data_ref);
    JS_PopGCRef(ctx, &peer_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static void ble_advertiser_event_drop(void *event, void *opaque)
{
    const ble_advertiser_event_t *incoming = event;
    ble_connection_slot_t *slot;
    bool claimed = false;
    (void)opaque;
    if (incoming == NULL || incoming->connection_index >= s_ble.max_connections) return;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    slot = &s_ble.connections[incoming->connection_index];
    taskENTER_CRITICAL(&s_ble.lock);
    if (slot->generation == incoming->connection_generation &&
        slot->incoming_advertiser_generation == incoming->generation &&
        slot->incoming_pending) {
        slot->incoming_pending = false;
        claimed = true;
    }
    taskEXIT_CRITICAL(&s_ble.lock);
    if (!claimed) {
        xSemaphoreGiveRecursive(s_ble_connection_mutex);
        return;
    }
    if (slot->open && s_ble.host_started) {
        ble_terminate_unclaimed_connection(slot, incoming->connection_generation);
    } else {
        slot->allocated = false;
        slot->reserved = false;
    }
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
}

static void ble_publish_incoming_connection(ble_connection_slot_t *slot,
                                             uint16_t connection_index)
{
    ble_advertiser_event_t incoming = {
        .generation = s_ble.advertiser.generation,
        .sequence = atomic_fetch_add_explicit(
            &s_ble.advertiser.sequence, 1, memory_order_relaxed) + 1U,
        .timestamp_us = esp_timer_get_time(),
        .connection_index = connection_index,
        .connection_generation = slot->generation,
    };
    s_ble.advertiser.active = false;
    slot->incoming_advertiser_generation = s_ble.advertiser.generation;
    slot->incoming_pending = true;
    s_ble.advertiser.stop_reason = BLE_STOP_CONNECTED;
    atomic_fetch_add_explicit(&s_ble.advertiser.incoming, 1,
                              memory_order_relaxed);
    if (!esp32_mquickjs_event_queue_try_send_from_callback(
            s_ble.advertiser.queue, &incoming)) {
        atomic_fetch_add_explicit(&s_ble.advertiser.dropped, 1,
                                  memory_order_relaxed);
        ble_advertiser_event_drop(&incoming, &s_ble.advertiser);
    }
}

static void ble_discard_advertiser_connections(ble_advertiser_t *advertiser)
{
    /* Also claim events already popped by an unfinished receive Future; they
     * no longer appear in queue.discard_all(), but still belong to this source. */
    for (uint16_t i = 0; i < s_ble.max_connections; ++i) {
        ble_connection_slot_t *slot = &s_ble.connections[i];
        ble_advertiser_event_t incoming = {
            .generation = advertiser->generation,
            .connection_index = i,
            .connection_generation = slot->generation,
        };
        ble_advertiser_event_drop(&incoming, advertiser);
    }
}

static JSValue ble_advertiser_event_to_js(JSContext *ctx, const void *event,
                                          void *opaque)
{
    const ble_advertiser_event_t *incoming = event;
    ble_advertiser_t *advertiser = opaque;
    ble_connection_slot_t *slot;
    JSGCRef object_ref, connection_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *connection = JS_PushGCRef(ctx, &connection_ref);
    *object = JS_UNDEFINED;
    *connection = JS_UNDEFINED;
    if (incoming == NULL || advertiser == NULL ||
        incoming->generation != advertiser->generation ||
        incoming->connection_index >= s_ble.max_connections) {
        JS_ThrowReferenceError(ctx, "BLE_STALE_CONNECTION: incoming connection is stale");
        goto fail;
    }
    slot = &s_ble.connections[incoming->connection_index];
    if (!slot->open || slot->generation != incoming->connection_generation ||
        !slot->incoming_pending) {
        JS_ThrowReferenceError(ctx, "BLE_STALE_CONNECTION: incoming connection is closed");
        goto fail;
    }
    *connection = ble_new_connection_handle(ctx, incoming->connection_index, slot);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*connection) || JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "type",
                                         JS_NewString(ctx, "connection")) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "sequence",
                                         JS_NewUint32(ctx, incoming->sequence)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "timestampUs",
                                         JS_NewInt64(ctx, incoming->timestamp_us)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "connection", *connection)) {
        goto fail;
    }
    slot->incoming_pending = false;
    JS_PopGCRef(ctx, &connection_ref);
    return JS_PopGCRef(ctx, &object_ref);
fail:
    /* A partially constructed connection handle must not later finalize into
     * adapter-wide orphan cleanup. The queue still owns this native connection. */
    if (!JS_IsUndefined(*connection) && !JS_IsException(*connection))
        ble_retire_handle(ctx, *connection, JS_CLASS_BLE_CONNECTION,
                          &s_ble_closed_connection_ref);
    ble_advertiser_event_drop((void *)event, opaque);
    JS_PopGCRef(ctx, &connection_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static JSValue ble_security_to_js(JSContext *ctx,
                                  const struct ble_gap_sec_state *security,
                                  const ble_addr_t *peer)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    bool secure_connections = false;
    if (security->bonded && peer != NULL) {
        struct ble_store_key_sec key = {.peer_addr = *peer};
        struct ble_store_value_sec value = {0};
        if (ble_store_read_peer_sec(&key, &value) == 0)
            secure_connections = value.sc != 0;
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "encrypted",
                                         JS_NewBool(security->encrypted)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "authenticated",
                                         JS_NewBool(security->authenticated)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "bonded",
                                         JS_NewBool(security->bonded)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "secureConnections",
                                         JS_NewBool(secure_connections))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

