99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static void ble_connection_snapshot(
    const ble_connection_slot_t *slot, ble_connection_snapshot_t *snapshot)
{
    if (snapshot == NULL) return;
    memset(snapshot, 0, sizeof(*snapshot));
    if (slot == NULL) return;
    taskENTER_CRITICAL(&s_ble.lock);
    snapshot->open = slot->open;
    snapshot->central = slot->central;
    snapshot->mtu = slot->mtu;
    snapshot->rssi = slot->rssi;
    snapshot->rssi_valid = slot->rssi_valid;
    snapshot->peer = slot->peer;
    snapshot->security = slot->security;
    taskEXIT_CRITICAL(&s_ble.lock);
}

static JSValue ble_connection_event_to_js(JSContext *ctx, const void *event,
                                          void *opaque)
{
    const ble_connection_event_t *control = event;
    ble_connection_slot_t *slot = opaque;
    ble_connection_snapshot_t snapshot;
    JSGCRef object_ref, status_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *status = JS_PushGCRef(ctx, &status_ref);
    const char *type;
    *object = JS_UNDEFINED;
    *status = JS_UNDEFINED;
    if (control == NULL || slot == NULL ||
        control->adapter_generation != s_ble.generation ||
        control->connection_generation != slot->generation) {
        JS_ThrowReferenceError(ctx, "BLE_STALE_CONNECTION: stale connection event");
        goto fail;
    }
    type = control->kind == BLE_CONTROL_DISCONNECTED ? "disconnected" :
           control->kind == BLE_CONTROL_MTU ? "mtu" :
           control->kind == BLE_CONTROL_SECURITY ? "security" :
                                                  "pairing-request";
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "type",
                                         JS_NewString(ctx, type)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "sequence",
                                         JS_NewUint32(ctx, control->sequence)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "timestampUs",
                                         JS_NewInt64(ctx, control->timestamp_us))) {
        goto fail;
    }
    if (control->kind == BLE_CONTROL_DISCONNECTED) {
        if (!esp32_mquickjs_set_property_ref(ctx, object, "reasonCode",
                                             JS_NewInt32(ctx, control->status)) ||
            !esp32_mquickjs_set_property_ref(ctx, object, "reasonName",
                                             JS_NewString(ctx, "host"))) goto fail;
        atomic_store_explicit(&slot->terminal_pending, false, memory_order_release);
    } else if (control->kind == BLE_CONTROL_MTU) {
        if (!esp32_mquickjs_set_property_ref(ctx, object, "mtu",
                                             JS_NewUint32(ctx, control->mtu))) goto fail;
    } else if (control->kind == BLE_CONTROL_SECURITY) {
        ble_connection_snapshot(slot, &snapshot);
        *status = ble_security_to_js(ctx, &snapshot.security, &snapshot.peer);
        if (JS_IsException(*status) ||
            !esp32_mquickjs_set_property_ref(ctx, object, "status", *status)) goto fail;
    } else {
        const char *action = control->pairing_action == BLE_SM_IOACT_DISP
                                 ? "display-passkey"
                                 : control->pairing_action == BLE_SM_IOACT_INPUT
                                       ? "input-passkey"
                                       : "numeric-comparison";
        if (!esp32_mquickjs_set_property_ref(ctx, object, "requestId",
                                             JS_NewUint32(ctx, control->request_id)) ||
            !esp32_mquickjs_set_property_ref(ctx, object, "action",
                                             JS_NewString(ctx, action)) ||
            !esp32_mquickjs_set_property_ref(ctx, object, "expiresAtUs",
                                             JS_NewInt64(ctx, control->expires_at_us)) ||
            ((control->pairing_action == BLE_SM_IOACT_DISP ||
              control->pairing_action == BLE_SM_IOACT_NUMCMP) &&
             !esp32_mquickjs_set_property_ref(ctx, object, "passkey",
                                              JS_NewUint32(ctx, control->passkey)))) goto fail;
    }
    JS_PopGCRef(ctx, &status_ref);
    return JS_PopGCRef(ctx, &object_ref);
fail:
    JS_PopGCRef(ctx, &status_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static void ble_notification_pool_release(ble_subscription_t *subscription,
                                          uint16_t index)
{
    if (subscription != NULL && index < subscription->capacity)
        (void)esp32_mquickjs_native_pool_release(
            &subscription->free_slots, index);
}

static void ble_notification_event_drop(void *event, void *opaque)
{
    ble_notification_event_t *value_event = event;
    ble_subscription_t *subscription = opaque;
    if (value_event != NULL && subscription != NULL &&
        value_event->subscription_generation == subscription->generation) {
        ble_notification_pool_release(subscription, value_event->pool_index);
    }
}

static JSValue ble_notification_event_to_js(JSContext *ctx, const void *event,
                                            void *opaque)
{
    const ble_notification_event_t *value_event = event;
    ble_subscription_t *subscription = opaque;
    uint8_t *payload = NULL;
    JSGCRef object_ref, data_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *data = JS_PushGCRef(ctx, &data_ref);
    *object = JS_UNDEFINED;
    *data = JS_UNDEFINED;
    if (value_event == NULL || subscription == NULL ||
        value_event->subscription_generation != subscription->generation ||
        value_event->pool_index >= subscription->capacity) {
        JS_ThrowReferenceError(ctx, "BLE_STALE_SUBSCRIPTION: stale value event");
        goto fail;
    }
    if (value_event->length > 0) {
        payload = heap_caps_malloc(value_event->length, MALLOC_CAP_8BIT);
        if (payload == NULL) {
            ble_notification_pool_release(subscription, value_event->pool_index);
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }
        memcpy(payload,
               subscription->payloads + value_event->pool_index *
                                            CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES,
               value_event->length);
    }
    ble_notification_pool_release(subscription, value_event->pool_index);
    *data = esp32_mquickjs_new_owned_byte_view(ctx, payload, value_event->length);
    payload = NULL;
    *object = JS_NewObject(ctx);
    if (JS_IsException(*data) || JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "type",
                                         JS_NewString(ctx, "value")) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "sequence",
                                         JS_NewUint32(ctx, value_event->sequence)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "timestampUs",
                                         JS_NewInt64(ctx, value_event->timestamp_us)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "indication",
                                         JS_NewBool(value_event->indication)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "data", *data)) goto fail;
    JS_PopGCRef(ctx, &data_ref);
    return JS_PopGCRef(ctx, &object_ref);
fail:
    heap_caps_free(payload);
    JS_PopGCRef(ctx, &data_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

