99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
/*
 * NimBLE callbacks run on the host task, independently of the JS runtime.
 * GAP callbacks refer to boot-lived connection slots. GATT callback cookies
 * identify one native operation through the protected boot-scoped registry.
 * Native ownership outlives public Future detach; callback references also
 * protect an entered callback, without touching JS from the host task.
 */
static void ble_active_state_bind(
    _Atomic(esp32_mquickjs_future_driver_state_t *) *location,
    esp32_mquickjs_future_driver_state_t *state)
{
    taskENTER_CRITICAL(&s_ble.lock);
    atomic_store_explicit(location, state, memory_order_release);
    taskEXIT_CRITICAL(&s_ble.lock);
}

static bool ble_gatt_state_bind(
    ble_connection_slot_t *slot,
    esp32_mquickjs_future_driver_state_t *state)
{
    if (slot == NULL || state == NULL) return false;
    taskENTER_CRITICAL(&s_ble.lock);
    if (slot->generation != state->connection_generation ||
        atomic_load_explicit(&slot->active_gatt_state, memory_order_relaxed) != NULL) {
        taskEXIT_CRITICAL(&s_ble.lock);
        ble_throw_error(state->ctx, "BLE_BUSY", BLE_HS_EBUSY, -1,
                        state->connection_index, -1);
        return false;
    }
    state->native_identity = esp32_mquickjs_wireless_operation_register(
        &s_ble_operations, state);
    if (state->native_identity == 0U) {
        taskEXIT_CRITICAL(&s_ble.lock);
        ble_throw_error(state->ctx, "BLE_BUSY", BLE_HS_ENOMEM, -1,
                        state->connection_index, -1);
        return false;
    }
    state->callback_refs++; /* Native ownership, independent of JS Future. */
    atomic_store_explicit(&slot->active_gatt_state, state, memory_order_release);
    taskEXIT_CRITICAL(&s_ble.lock);
    if (state->gatt_accounted && !state->gatt_started) {
        (void)atomic_fetch_sub_explicit(&slot->gatt_pending, 1, memory_order_acq_rel);
        state->gatt_started = true;
    }
    return true;
}

static esp32_mquickjs_future_driver_state_t *ble_active_state_acquire(
    _Atomic(esp32_mquickjs_future_driver_state_t *) *location)
{
    esp32_mquickjs_future_driver_state_t *state;
    taskENTER_CRITICAL(&s_ble.lock);
    state = atomic_load_explicit(location, memory_order_acquire);
    if (state != NULL && (!state->detached || state->native_identity != 0U)) state->callback_refs++;
    else state = NULL;
    taskEXIT_CRITICAL(&s_ble.lock);
    return state;
}

static void ble_future_state_hold(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) return;
    taskENTER_CRITICAL(&s_ble.lock);
    state->callback_refs++;
    taskEXIT_CRITICAL(&s_ble.lock);
}

static void ble_future_state_drop(
    esp32_mquickjs_future_driver_state_t *state)
{
    bool release = false;
    if (state == NULL) return;
    taskENTER_CRITICAL(&s_ble.lock);
    if (state->callback_refs > 0) state->callback_refs--;
    if (state->callback_refs == 0 && state->detached) release = true;
    taskEXIT_CRITICAL(&s_ble.lock);
    if (release) ble_future_state_storage_free(state);
}

/* Cookie lookup and retain share the same lock as detach/removal. */
static esp32_mquickjs_future_driver_state_t *ble_operation_acquire(void *arg)
{
    esp32_mquickjs_future_driver_state_t *state;
    taskENTER_CRITICAL(&s_ble.lock);
    state = esp32_mquickjs_wireless_operation_lookup(
        &s_ble_operations, (uint32_t)(uintptr_t)arg);
    if (state != NULL) state->callback_refs++;
    taskEXIT_CRITICAL(&s_ble.lock);
    return state;
}

static void ble_native_state_complete(esp32_mquickjs_future_driver_state_t *state)
{
    bool drop = false;
    if (state == NULL) return;
    taskENTER_CRITICAL(&s_ble.lock);
    if (state->native_identity != 0U) {
        (void)esp32_mquickjs_wireless_operation_remove(
            &s_ble_operations, state->native_identity);
        state->native_identity = 0U;
        for (size_t i = 0; i < CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS; ++i) {
            ble_connection_slot_t *slot = &s_ble.connections[i];
            if (atomic_load(&slot->active_gatt_state) == state)
                atomic_store(&slot->active_gatt_state, NULL);
            if (atomic_load(&slot->active_gap_state) == state)
                atomic_store(&slot->active_gap_state, NULL);
        }
        if (atomic_load(&s_ble_server_notify_state) == state)
            atomic_store(&s_ble_server_notify_state, NULL);
        drop = true;
    }
    taskEXIT_CRITICAL(&s_ble.lock);
    if (drop) ble_future_state_drop(state);
}

static void ble_native_states_quiesced(void)
{
    /* Only after successful Host stop/deinit: no future SDK callback. */
    for (size_t i = 0; i < ESP32_MQUICKJS_WIRELESS_OPERATION_CAPACITY; ++i) {
        esp32_mquickjs_future_driver_state_t *state;
        taskENTER_CRITICAL(&s_ble.lock);
        state = s_ble_operations.entries[i].owner;
        if (state != NULL) state->callback_refs++;
        taskEXIT_CRITICAL(&s_ble.lock);
        if (state != NULL) {
            ble_native_state_complete(state);
            ble_future_state_drop(state);
        }
    }
}

static void ble_gatt_callback_drop(esp32_mquickjs_future_driver_state_t *state)
{
    if (atomic_load_explicit(&state->completed, memory_order_acquire))
        ble_native_state_complete(state);
    ble_future_state_drop(state);
}

static void ble_future_wake_state(esp32_mquickjs_future_driver_state_t *state)
{
    /* Runtime destruction must stop/deinit Host before freeing Future queues.
     * Detached operations never wake either the old or a replacement runtime. */
    if (!atomic_load_explicit(&state->detached, memory_order_acquire))
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
}

static void *ble_scan_callback_bind(void)
{
    uintptr_t identity = 0;
    taskENTER_CRITICAL(&s_ble.lock);
    if (s_ble_scan_callback_identity == 0 && s_ble_scan_callback_refs == 0 &&
        s_ble_scan_next_identity != 0) {
        identity = s_ble_scan_next_identity;
        s_ble_scan_next_identity = identity == UINTPTR_MAX ? 0 : identity + 1;
        s_ble_scan_callback_identity = identity;
    }
    taskEXIT_CRITICAL(&s_ble.lock);
    return (void *)identity;
}

