99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static int ble_scan_event_callback(struct ble_gap_event *event, void *arg)
{
    bool admitted = false;
    if (event == NULL || (event->type != BLE_GAP_EVENT_DISC &&
                          event->type != BLE_GAP_EVENT_DISC_COMPLETE)) return 0;
    taskENTER_CRITICAL(&s_ble.lock);
    if ((uintptr_t)arg != 0 && (uintptr_t)arg == s_ble_scan_callback_identity &&
        s_ble_scan_callback_refs != UINT32_MAX) {
        s_ble_scan_callback_refs++;
        admitted = true;
    }
    taskEXIT_CRITICAL(&s_ble.lock);
    if (!admitted) return 0;
    int result = ble_gap_event_callback(event, NULL);
    taskENTER_CRITICAL(&s_ble.lock);
    s_ble_scan_callback_refs--;
    taskEXIT_CRITICAL(&s_ble.lock);
    return result;
}

static void ble_scan_callbacks_quiesce(void)
{
    /* Runtime task only, after successful native stop/natural completion.
     * Close admission before freeing storage; entered callbacks are bounded,
     * do not run JS, and must finish outside this short state lock. */
    uint32_t refs;
    do {
        taskENTER_CRITICAL(&s_ble.lock);
        s_ble_scan_callback_identity = 0;
        refs = s_ble_scan_callback_refs;
        taskEXIT_CRITICAL(&s_ble.lock);
        if (refs != 0) vTaskDelay(1);
    } while (refs != 0);
}

static void ble_terminate_unclaimed_connection(ble_connection_slot_t *slot,
                                                uint32_t generation)
{
    int rc;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    if (slot->generation != generation || !slot->open) {
        xSemaphoreGiveRecursive(s_ble_connection_mutex);
        return;
    }
    slot->release_on_disconnect = true;
    rc = ble_gap_terminate(slot->conn_handle, BLE_ERR_REM_USER_CONN_TERM);
    if (rc == BLE_HS_ENOTCONN) {
        (void)esp32_mquickjs_wireless_native_operation_complete(&slot->connect_operation);
        slot->open = false;
        slot->reserved = false;
        slot->allocated = false;
        slot->release_on_disconnect = false;
        slot->conn_handle = BLE_INVALID_CONN_HANDLE;
    } else if (rc != 0) {
        /* Keep the exact slot/native operation until DISCONNECT or a successful
         * cleanup retry. Failed termination does not prove disconnection. */
        atomic_store_explicit(&s_ble.rejected_connection_error, rc, memory_order_relaxed);
    }
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
}

static void ble_reject_incoming_connection(uint16_t conn_handle)
{
    ble_connection_slot_t *slot;
    int rc;
    /* Never terminate a connection already handed to a JS owner, including a
     * duplicate CONNECT callback for the same live handle. */
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    slot = ble_find_connection(conn_handle, NULL);
    if (slot != NULL && slot->open) {
        xSemaphoreGiveRecursive(s_ble_connection_mutex);
        return;
    }
    slot = ble_reserve_connection(false, NULL);
    if (slot != NULL) {
        slot->conn_handle = conn_handle;
        slot->release_on_disconnect = true;
        slot->reserved = false;
        slot->allocated = true;
        slot->open = true;
    }
    rc = ble_gap_terminate(conn_handle, BLE_ERR_REM_USER_CONN_TERM);
    if (rc == BLE_HS_ENOTCONN) {
        if (slot != NULL) {
            slot->open = false;
            slot->allocated = false;
            slot->release_on_disconnect = false;
            slot->conn_handle = BLE_INVALID_CONN_HANDLE;
        }
    } else if (rc != 0) {
        /* The adapter still owns the native connection, even if all framework
         * slots are occupied by closed JS handles. Explicit adapter close is
         * the cleanup barrier; do not close unrelated connections here. */
        atomic_store_explicit(&s_ble.rejected_connection_error, rc,
                              memory_order_relaxed);
    }
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
}

static void *ble_advertise_callback_bind(void)
{
    uintptr_t identity = 0;
    taskENTER_CRITICAL(&s_ble.lock);
    if (s_ble_advertise_callback_identity == 0 &&
        s_ble_advertise_callback_refs == 0 && s_ble_advertise_next_identity != 0) {
        identity = s_ble_advertise_next_identity;
        s_ble_advertise_next_identity = identity == UINTPTR_MAX ? 0 : identity + 1;
        s_ble_advertise_callback_identity = identity;
    }
    taskEXIT_CRITICAL(&s_ble.lock);
    return (void *)identity;
}

static int ble_advertise_event_callback(struct ble_gap_event *event, void *arg)
{
    bool admitted = false;
    int result;
    if (event == NULL) return 0;
    /* NimBLE inherits this callback for the lifetime of incoming connections.
     * Their handle-based events must survive advertiser close. Host stop/deinit
     * is the adapter-level barrier, as for other connection GAP callbacks. */
    if (event->type != BLE_GAP_EVENT_ADV_COMPLETE &&
        event->type != BLE_GAP_EVENT_CONNECT)
        return ble_gap_event_callback(event, NULL);
    taskENTER_CRITICAL(&s_ble.lock);
    if ((uintptr_t)arg != 0 &&
        (uintptr_t)arg == s_ble_advertise_callback_identity &&
        s_ble_advertise_callback_refs != UINT32_MAX) {
        s_ble_advertise_callback_refs++;
        admitted = true;
    }
    taskEXIT_CRITICAL(&s_ble.lock);
    if (!admitted) {
        if (event->type == BLE_GAP_EVENT_CONNECT && event->connect.status == 0)
            ble_reject_incoming_connection(event->connect.conn_handle);
        return 0;
    }
    result = ble_gap_event_callback(event, NULL);
    taskENTER_CRITICAL(&s_ble.lock);
    s_ble_advertise_callback_refs--;
    taskEXIT_CRITICAL(&s_ble.lock);
    return result;
}

static void ble_advertise_callbacks_quiesce(void)
{
    uint32_t refs;
    do {
        taskENTER_CRITICAL(&s_ble.lock);
        s_ble_advertise_callback_identity = 0;
        refs = s_ble_advertise_callback_refs;
        taskEXIT_CRITICAL(&s_ble.lock);
        if (refs != 0) vTaskDelay(1);
    } while (refs != 0);
}

static int ble_gap_event_callback_locked(struct ble_gap_event *event, void *arg)
{
    ble_connection_slot_t *callback_slot = arg;
    esp32_mquickjs_future_driver_state_t *state = NULL;
    ble_connection_slot_t *slot;
    uint16_t connection_index;

    if (event == NULL || (s_ble.lifecycle != BLE_LIFECYCLE_ACTIVE &&
                          s_ble.lifecycle != BLE_LIFECYCLE_OPENING &&
                          s_ble.lifecycle != BLE_LIFECYCLE_CLOSING &&
                          s_ble.lifecycle != BLE_LIFECYCLE_FAILED)) return 0;
    if (s_ble.lifecycle == BLE_LIFECYCLE_FAILED &&
        event->type == BLE_GAP_EVENT_CONNECT && callback_slot == NULL) {
        if (event->connect.status == 0)
            ble_reject_incoming_connection(event->connect.conn_handle);
        return 0;
    }
    if (callback_slot != NULL)
        state = ble_active_state_acquire(&callback_slot->active_gap_state);
    switch (event->type) {
    case BLE_GAP_EVENT_DISC:
        if (s_ble.scanner.active && s_ble.scanner.queue != NULL) {
            ble_scan_event_t scan_event = {0};
            uint16_t pool_index;
            scan_event.generation = s_ble.scanner.generation;
            scan_event.sequence = atomic_fetch_add_explicit(
                &s_ble.scanner.sequence, 1, memory_order_relaxed) + 1U;
            if (event->disc.length_data > BLE_HS_ADV_MAX_SZ) {
                atomic_fetch_add_explicit(&s_ble.scanner.malformed, 1,
                                          memory_order_relaxed);
            } else if (!ble_scan_pool_acquire(&s_ble.scanner, &pool_index)) {
                atomic_fetch_add_explicit(&s_ble.scanner.dropped, 1,
                                          memory_order_relaxed);
            } else {
                scan_event.timestamp_us = esp_timer_get_time();
                scan_event.peer = event->disc.addr;
                scan_event.event_type = event->disc.event_type;
                scan_event.rssi = event->disc.rssi;
                scan_event.length = event->disc.length_data;
                scan_event.pool_index = pool_index;
                memcpy(s_ble.scanner.payloads + pool_index * BLE_HS_ADV_MAX_SZ,
                       event->disc.data, event->disc.length_data);
                if (!esp32_mquickjs_wireless_pooled_event_publish_from_callback(
                        &s_ble.scanner.free_slots, pool_index,
                        s_ble.scanner.queue, &scan_event,
                        ble_event_queue_try_send_from_callback)) {
                    atomic_fetch_add_explicit(&s_ble.scanner.dropped, 1,
                                              memory_order_relaxed);
                } else {
                    atomic_fetch_add_explicit(&s_ble.scanner.reports, 1,
                                              memory_order_relaxed);
                }
            }
        }
        break;
    case BLE_GAP_EVENT_DISC_COMPLETE:
        s_ble.scanner.active = false;
        s_ble.scanner.stop_reason =
            event->disc_complete.reason == 0 ||
            event->disc_complete.reason == BLE_HS_ETIMEOUT
                ? BLE_STOP_COMPLETED : BLE_STOP_ERROR;
        break;
    case BLE_GAP_EVENT_ADV_COMPLETE:
        s_ble.advertiser.active = false;
        if (s_ble.advertiser.stop_reason == BLE_STOP_RUNNING) {
            s_ble.advertiser.stop_reason =
                event->adv_complete.reason == 0 ? BLE_STOP_CONNECTED :
                event->adv_complete.reason == BLE_HS_ETIMEOUT
                    ? BLE_STOP_COMPLETED : BLE_STOP_ERROR;
        }
        break;
    case BLE_GAP_EVENT_CONNECT:
        if (callback_slot != NULL) {
            slot = callback_slot;
            connection_index = (uint16_t)(slot - s_ble.connections);
        } else {
            slot = ble_reserve_connection(false, &connection_index);
            if (slot != NULL) state = NULL;
        }
        if (callback_slot != NULL && state == NULL) {
            if (event->connect.status == 0) {
                slot->allocated = true;
                slot->reserved = false;
                slot->open = true;
                slot->release_on_disconnect = true;
                slot->conn_handle = event->connect.conn_handle;
                ble_terminate_unclaimed_connection(slot, slot->generation);
                break;
            }
            (void)esp32_mquickjs_wireless_native_operation_complete(
                &slot->connect_operation);
            slot->open = false;
            slot->release_on_disconnect = false;
            slot->reserved = false;
            slot->allocated = false;
            slot->conn_handle = BLE_INVALID_CONN_HANDLE;
            break;
        }
        if (slot == NULL) {
            if (event->connect.status == 0)
                (void)ble_gap_terminate(event->connect.conn_handle,
                                        BLE_ERR_REM_USER_CONN_TERM);
            break;
        }
        if (event->connect.status == 0) {
            struct ble_gap_conn_desc descriptor;
            slot->allocated = true;
            slot->reserved = false;
            slot->open = true;
            slot->conn_handle = event->connect.conn_handle;
            if (ble_gap_conn_find(slot->conn_handle, &descriptor) == 0) {
                taskENTER_CRITICAL(&s_ble.lock);
                slot->peer = descriptor.peer_id_addr;
                slot->central = descriptor.role == BLE_GAP_ROLE_MASTER;
                slot->security = descriptor.sec_state;
                taskEXIT_CRITICAL(&s_ble.lock);
            }
            if (state == NULL && s_ble.advertiser.queue != NULL) {
                ble_publish_incoming_connection(slot, connection_index);
            }
        } else {
            slot->reserved = false;
            slot->allocated = false;
        }
        if (state != NULL && state->operation == BLE_OP_CONNECT) {
            if (event->connect.status != 0) state->host_code = event->connect.status;
            atomic_store_explicit(&state->completed, true,
                                  memory_order_release);
            ble_future_wake_state(state);
        }
        if (callback_slot != NULL) {
            (void)esp32_mquickjs_wireless_native_operation_complete(
                &callback_slot->connect_operation);
        }
        break;
    case BLE_GAP_EVENT_DISCONNECT:
        slot = ble_find_connection(event->disconnect.conn.conn_handle,
                                   &connection_index);
        if (slot != NULL) {
            ble_connection_event_t control = {0};
            bool publish = !slot->release_on_disconnect;
            esp32_mquickjs_future_driver_state_t *gatt_state =
                ble_active_state_acquire(&slot->active_gatt_state);
            slot->open = false;
            if (slot->release_on_disconnect) {
                (void)esp32_mquickjs_wireless_native_operation_complete(
                    &slot->connect_operation);
                slot->release_on_disconnect = false;
                slot->allocated = false;
                slot->reserved = false;
                slot->conn_handle = BLE_INVALID_CONN_HANDLE;
            } else {
                control = (ble_connection_event_t){
                    .adapter_generation = s_ble.generation,
                    .connection_generation = slot->generation,
                    .sequence = atomic_fetch_add_explicit(
                        &slot->sequence, 1, memory_order_relaxed) + 1U,
                    .timestamp_us = esp_timer_get_time(),
                    .kind = BLE_CONTROL_DISCONNECTED,
                    .status = event->disconnect.reason,
                };
                atomic_store_explicit(&slot->terminal_pending, true,
                                      memory_order_release);

