99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
            }
            if (state != NULL) {
                state->host_code =
                    state->operation == BLE_OP_CONNECTION_CLOSE
                        ? 0 : BLE_HS_ENOTCONN;
                atomic_store_explicit(&state->completed, true,
                                      memory_order_release);
                ble_future_wake_state(state);
            }
            if (gatt_state != NULL && gatt_state != state) {
                gatt_state->host_code = BLE_HS_ENOTCONN;
                atomic_store_explicit(&gatt_state->completed, true,
                                      memory_order_release);
                ble_future_wake_state(gatt_state);
            }
            if (gatt_state != NULL &&
                (gatt_state->operation == BLE_OP_PAIR ||
                 gatt_state->operation == BLE_OP_CONNECTION_CLOSE))
                ble_native_state_complete(gatt_state);
            ble_future_state_drop(gatt_state);
            if (publish) {
                if (!esp32_mquickjs_event_queue_try_send_from_callback(
                        slot->queue, &control)) {
                    atomic_fetch_add_explicit(
                        &s_ble.dropped_connection_events, 1,
                        memory_order_relaxed);
                }
            }
        }
        break;
    case BLE_GAP_EVENT_MTU:
        slot = ble_find_connection(event->mtu.conn_handle, NULL);
        if (slot != NULL) {
            ble_connection_event_t control = {
                .adapter_generation = s_ble.generation,
                .connection_generation = slot->generation,
                .sequence = atomic_fetch_add_explicit(&slot->sequence, 1,
                                                       memory_order_relaxed) + 1U,
                .timestamp_us = esp_timer_get_time(),
                .kind = BLE_CONTROL_MTU,
                .mtu = event->mtu.value,
            };
            slot->mtu = event->mtu.value;
            if (!esp32_mquickjs_event_queue_try_send_from_callback(
                    slot->queue, &control)) {
                atomic_fetch_add_explicit(&s_ble.dropped_connection_events, 1,
                                          memory_order_relaxed);
            }
        }
        break;
    case BLE_GAP_EVENT_ENC_CHANGE: {
        ble_connection_event_t control = {0};
        slot = ble_find_connection(event->enc_change.conn_handle, NULL);
        if (slot != NULL) {
            struct ble_gap_conn_desc descriptor;
            control = (ble_connection_event_t){
                .adapter_generation = s_ble.generation,
                .connection_generation = slot->generation,
                .sequence = atomic_fetch_add_explicit(&slot->sequence, 1,
                                                       memory_order_relaxed) + 1U,
                .timestamp_us = esp_timer_get_time(),
                .kind = BLE_CONTROL_SECURITY,
                .status = event->enc_change.status,
            };
            if (ble_gap_conn_find(slot->conn_handle, &descriptor) == 0) {
                taskENTER_CRITICAL(&s_ble.lock);
                slot->security = descriptor.sec_state;
                taskEXIT_CRITICAL(&s_ble.lock);
            }
        }
        if (state != NULL && state->operation == BLE_OP_PAIR) {
            state->host_code = event->enc_change.status;
            atomic_store_explicit(&state->completed, true, memory_order_release);
            ble_future_wake_state(state);
            ble_native_state_complete(state);
        }
        if (slot != NULL && !esp32_mquickjs_event_queue_try_send_from_callback(
                slot->queue, &control)) {
            atomic_fetch_add_explicit(&s_ble.dropped_connection_events, 1,
                                      memory_order_relaxed);
        }
        break;
    }
    case BLE_GAP_EVENT_PASSKEY_ACTION:
        slot = ble_find_connection(event->passkey.conn_handle, NULL);
        if (slot != NULL) {
            ble_connection_event_t control = {
                .adapter_generation = s_ble.generation,
                .connection_generation = slot->generation,
                .sequence = atomic_fetch_add_explicit(&slot->sequence, 1,
                                                       memory_order_relaxed) + 1U,
                .timestamp_us = esp_timer_get_time(),
                .kind = BLE_CONTROL_PAIRING,
                .request_id = atomic_fetch_add_explicit(
                    &s_ble.next_pairing_request, 1, memory_order_relaxed) + 1U,
                .pairing_action = event->passkey.params.action,
                .passkey = event->passkey.params.numcmp,
                .expires_at_us = esp_timer_get_time() +
                                 (int64_t)s_ble.pairing_timeout_ms * 1000,
            };
            slot->pairing_request_id = control.request_id;
            slot->pairing_action = control.pairing_action;
            slot->pairing_passkey = control.passkey;
            slot->pairing_expires_at_us = control.expires_at_us;
            if (!esp32_mquickjs_event_queue_try_send_from_callback(
                    slot->queue, &control)) {
                struct ble_sm_io reject = {.action = event->passkey.params.action};
                if (reject.action == BLE_SM_IOACT_NUMCMP) reject.numcmp_accept = 0;
                (void)ble_sm_inject_io(slot->conn_handle, &reject);
                atomic_fetch_add_explicit(&s_ble.dropped_connection_events, 1,
                                          memory_order_relaxed);
            }
        }
        break;
    case BLE_GAP_EVENT_NOTIFY_RX:
        slot = ble_find_connection(event->notify_rx.conn_handle, NULL);
        if (slot != NULL) {
            uint16_t index;
            uint16_t length = OS_MBUF_PKTLEN(event->notify_rx.om);
            for (index = 0; index < BLE_MAX_SUBSCRIPTIONS; ++index) {
                ble_subscription_t *subscription = &slot->subscriptions[index];
                uint16_t pool_index;
                ble_notification_event_t value_event;
                if (!subscription->open ||
                    subscription->value_handle != event->notify_rx.attr_handle)
                    continue;
                if (length > CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES ||
                    !esp32_mquickjs_native_pool_acquire(
                        &subscription->free_slots, &pool_index)) {
                    atomic_fetch_add_explicit(&subscription->dropped, 1,
                                              memory_order_relaxed);
                    break;
                }
                if (os_mbuf_copydata(event->notify_rx.om, 0, length,
                        subscription->payloads + pool_index *
                            CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES) != 0) {
                    ble_notification_pool_release(subscription, pool_index);
                    atomic_fetch_add_explicit(&subscription->dropped, 1,
                                              memory_order_relaxed);
                    break;
                }
                value_event = (ble_notification_event_t){
                    .adapter_generation = s_ble.generation,
                    .connection_generation = slot->generation,
                    .subscription_generation = subscription->generation,
                    .sequence = atomic_fetch_add_explicit(
                        &subscription->sequence, 1, memory_order_relaxed) + 1U,
                    .timestamp_us = esp_timer_get_time(),
                    .indication = event->notify_rx.indication != 0,
                    .length = length,
                    .pool_index = pool_index,
                };
                if (!esp32_mquickjs_wireless_pooled_event_publish_from_callback(
                        &subscription->free_slots, pool_index,
                        subscription->queue, &value_event,
                        ble_event_queue_try_send_from_callback)) {
                    atomic_fetch_add_explicit(&subscription->dropped, 1,
                                              memory_order_relaxed);
                } else {
                    atomic_fetch_add_explicit(&subscription->received, 1,
                                              memory_order_relaxed);
                }
                break;
            }
        }
        break;
    case BLE_GAP_EVENT_NOTIFY_TX: {
        esp32_mquickjs_future_driver_state_t *notify_state =
            ble_active_state_acquire(&s_ble_server_notify_state);
        bool complete = false;
        if (notify_state != NULL && notify_state->indication &&
            notify_state->attribute_handle == event->notify_tx.attr_handle &&
            event->notify_tx.indication && event->notify_tx.status != 0) {
            taskENTER_CRITICAL(&s_ble.lock);
            for (size_t i = 0; i < CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS; ++i) {
                if (!notify_state->notify_pending[i] ||
                    notify_state->notify_handles[i] != event->notify_tx.conn_handle)
                    continue;
                notify_state->notify_pending[i] = false;
                if (event->notify_tx.status != BLE_HS_EDONE &&
                    notify_state->host_code == 0)
                    notify_state->host_code = event->notify_tx.status;
                uint16_t pending = atomic_fetch_sub_explicit(
                    &notify_state->pending_confirmations, 1, memory_order_acq_rel);
                complete = pending == 1U && !notify_state->notify_submitting;
                break;
            }
            taskEXIT_CRITICAL(&s_ble.lock);
            if (complete) {
                atomic_store_explicit(&notify_state->completed, true, memory_order_release);
                ble_future_wake_state(notify_state);
                ble_native_state_complete(notify_state);
            }
        }
        ble_future_state_drop(notify_state);
        break;
    }
    case BLE_GAP_EVENT_SUBSCRIBE:
        ble_publish_server_subscription(event);
        break;
    default:
        break;
    }
    ble_future_state_drop(state);
    return 0;
}

static int ble_gap_event_callback(struct ble_gap_event *event, void *arg)
{
    int result;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    result = ble_gap_event_callback_locked(event, arg);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return result;
}

static void ble_on_reset(int reason)
{
    (void)reason;
    s_ble.synchronized = false;
    atomic_fetch_add_explicit(&s_ble.reset_count, 1, memory_order_relaxed);
}

