99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static void ble_on_sync(void)
{
    esp32_mquickjs_future_driver_state_t *state =
        ble_active_state_acquire(&s_ble_open_state);
    ble_addr_t random_address;
    uint8_t identity_type = BLE_ADDR_PUBLIC;
    int rc = ble_hs_util_ensure_addr(0);
    if (rc == 0) {
        switch (s_ble.own_address_request) {
        case BLE_OWN_ADDRESS_PUBLIC:
            s_ble.own_addr_type = BLE_OWN_ADDR_PUBLIC;
            rc = ble_hs_id_copy_addr(BLE_ADDR_PUBLIC, s_ble.address, NULL);
            break;
        case BLE_OWN_ADDRESS_RANDOM_STATIC:
            rc = ble_hs_id_gen_rnd(0, &random_address);
            if (rc == 0) rc = ble_hs_id_set_rnd(random_address.val);
            if (rc == 0) {
                s_ble.own_addr_type = BLE_OWN_ADDR_RANDOM;
                memcpy(s_ble.address, random_address.val,
                       sizeof(s_ble.address));
            }
            break;
        case BLE_OWN_ADDRESS_RPA:
            rc = ble_hs_id_infer_auto(1, &s_ble.own_addr_type);
            if (rc == 0) {
                identity_type =
                    s_ble.own_addr_type == BLE_OWN_ADDR_RPA_RANDOM_DEFAULT
                        ? BLE_ADDR_RANDOM : BLE_ADDR_PUBLIC;
                rc = ble_hs_id_copy_addr(identity_type, s_ble.address, NULL);
            }
            break;
        default:
            rc = ble_hs_id_infer_auto(0, &s_ble.own_addr_type);
            if (rc == 0) {
                identity_type = s_ble.own_addr_type == BLE_OWN_ADDR_RANDOM
                                    ? BLE_ADDR_RANDOM : BLE_ADDR_PUBLIC;
                rc = ble_hs_id_copy_addr(identity_type, s_ble.address, NULL);
            }
            break;
        }
    }
    if (state != NULL) {
        state->host_code = rc;
        s_ble.synchronized = rc == 0;
        atomic_store_explicit(&state->completed, true, memory_order_release);
        ble_future_wake_state(state);
    }
    ble_future_state_drop(state);
}

static void ble_host_task(void *opaque)
{
    (void)opaque;
    nimble_port_run();
    nimble_port_freertos_deinit();
}

static void ble_future_state_storage_free(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) return;
    heap_caps_free(state->payload);
    heap_caps_free(state);
}

static void ble_future_state_release(esp32_mquickjs_future_driver_state_t *state)
{
    bool release = false;
    uint16_t index;
    if (state == NULL) return;
    if (state->owner_rooted) {
        JS_DeleteGCRef(state->ctx, &state->owner_ref);
        state->owner_rooted = false;
    }
    if (state->queue_rooted) {
        JS_DeleteGCRef(state->ctx, &state->queue_ref);
        state->queue_rooted = false;
    }
    if (state->gatt_accounted && !state->gatt_started &&
        state->connection_index < s_ble.max_connections) {
        ble_connection_slot_t *slot =
            &s_ble.connections[state->connection_index];
        if (slot->generation == state->connection_generation)
            (void)atomic_fetch_sub_explicit(&slot->gatt_pending, 1,
                                            memory_order_acq_rel);
        state->gatt_started = true;
    }
    taskENTER_CRITICAL(&s_ble.lock);
    if (atomic_load_explicit(&s_ble_open_state, memory_order_relaxed) == state)
        atomic_store_explicit(&s_ble_open_state, NULL, memory_order_release);
    if (state->native_identity == 0U &&
        atomic_load_explicit(&s_ble_server_notify_state,
                             memory_order_relaxed) == state)
        atomic_store_explicit(&s_ble_server_notify_state, NULL,
                              memory_order_release);
    for (index = 0; index < CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS;
         ++index) {
        ble_connection_slot_t *slot = &s_ble.connections[index];
        if (state->native_identity == 0U &&
            atomic_load_explicit(&slot->active_gap_state,
                                 memory_order_relaxed) == state)
            atomic_store_explicit(&slot->active_gap_state, NULL,
                                  memory_order_release);
        if (state->native_identity == 0U &&
            atomic_load_explicit(&slot->active_gatt_state,
                                 memory_order_relaxed) == state)
            atomic_store_explicit(&slot->active_gatt_state, NULL,
                                  memory_order_release);
    }
    state->detached = true;
    if (state->callback_refs == 0) release = true;
    taskEXIT_CRITICAL(&s_ble.lock);
    if (release) ble_future_state_storage_free(state);
}

static esp32_mquickjs_future_poll_t ble_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL && atomic_load_explicit(&state->completed,
                                                  memory_order_acquire)
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

static esp32_mquickjs_cancel_result_t ble_future_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->started) return ESP32_MQUICKJS_CANCEL_REJECTED;
    state->cancelled = true;
    atomic_store_explicit(&state->completed, true, memory_order_release);
    return ESP32_MQUICKJS_CANCELLED;
}

static uint32_t ble_future_timeout_ms(
    const esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL ? state->timeout_ms : 0;
}

static JSValue ble_future_on_timeout(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state,
    uint32_t timeout_ms)
{
    (void)timeout_ms;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    if (state != NULL && state->started) {
        switch (state->operation) {
        case BLE_OP_SCAN:
        case BLE_OP_SCANNER_CLOSE: {
            int rc = ble_gap_disc_cancel();
            /* A timeout settles the public Future, not the native procedure.
             * Preserve callback-visible storage when cancellation fails. */
            if (rc == 0 || rc == BLE_HS_EALREADY) s_ble.scanner.active = false;
            s_ble.scanner.stop_reason = BLE_STOP_ERROR;
            break;
        }
        case BLE_OP_ADVERTISE:
        case BLE_OP_ADVERTISER_CLOSE: {
            int rc = ble_gap_adv_stop();
            if (rc == 0 || rc == BLE_HS_EALREADY) s_ble.advertiser.active = false;
            s_ble.advertiser.stop_reason = BLE_STOP_ERROR;
            break;
        }
        case BLE_OP_CONNECT:
            if (state->connection_index < s_ble.max_connections) {
                (void)esp32_mquickjs_wireless_native_operation_request_cancel(
                    &s_ble.connections[state->connection_index]
                         .connect_operation);
            }
            (void)ble_gap_conn_cancel();
            break;
        case BLE_OP_CONNECTION_CLOSE:
            if (state->connection_index < s_ble.max_connections) {
                ble_connection_slot_t *slot =
                    &s_ble.connections[state->connection_index];
                if (slot->open && slot->generation == state->connection_generation) {
                    (void)ble_gap_terminate(slot->conn_handle,
                                            BLE_ERR_REM_USER_CONN_TERM);
                }
            }
            break;
        case BLE_OP_DISCOVER:
        case BLE_OP_GATT_READ:
        case BLE_OP_GATT_WRITE:
        case BLE_OP_SUBSCRIBE:
        case BLE_OP_SUBSCRIPTION_CLOSE:
        case BLE_OP_PAIR:
        case BLE_OP_EXCHANGE_MTU:
        case BLE_OP_READ_RSSI:
            if (state->connection_index < s_ble.max_connections) {
                ble_connection_slot_t *slot =
                    &s_ble.connections[state->connection_index];
                if (slot->open && slot->generation == state->connection_generation)
                    (void)ble_gap_terminate(slot->conn_handle,
                                            BLE_ERR_REM_USER_CONN_TERM);
            }
            break;
        case BLE_OP_SERVER_NOTIFY: {
            uint16_t index;
            for (index = 0; index < s_ble.max_connections; ++index) {
                ble_connection_slot_t *slot = &s_ble.connections[index];
                bool pending;
                uint16_t handle;
                taskENTER_CRITICAL(&s_ble.lock);
                pending = state->notify_pending[index];
                handle = state->notify_handles[index];
                taskEXIT_CRITICAL(&s_ble.lock);
                if (pending && slot->open && handle == slot->conn_handle) {
                    (void)ble_gap_terminate(handle, BLE_ERR_REM_USER_CONN_TERM);
                }
            }
            break;
        }
        default:
            break;
        }
    }
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return ble_throw_error(ctx, "BLE_TIMEOUT", BLE_HS_ETIMEOUT,
                           -1,
                           state != NULL ? state->connection_index : -1,
                           state != NULL ? state->attribute_handle : -1);
}

static bool ble_allocate_connection_queues(JSContext *ctx,
                                           ble_adapter_t *adapter)
{
    uint16_t index;
    for (index = 0; index < adapter->max_connections; ++index) {
        ble_connection_slot_t *slot = &adapter->connections[index];
        atomic_init(&slot->active_gap_state, NULL);
        atomic_init(&slot->active_gatt_state, NULL);
        atomic_init(&slot->gatt_pending, 0);
        esp32_mquickjs_wireless_native_operation_init(
            &slot->connect_operation);
        JSValue queue = esp32_mquickjs_event_queue_new(
            ctx, adapter->runtime, sizeof(ble_connection_event_t),
            CONFIG_ESP32_MQUICKJS_BLE_CONNECTION_QUEUE_LEN,
            ESP32_MQUICKJS_EVENT_QUEUE_DROP_OLDEST,
            ble_connection_event_to_js, NULL, NULL, slot);
        if (JS_IsException(queue)) return false;
        *JS_AddGCRef(ctx, &slot->queue_ref) = queue;
        slot->queue_rooted = true;
        slot->queue = esp32_mquickjs_event_queue_from_value(ctx, queue);
        if (slot->queue == NULL) return false;
    }
    return true;
}

static void ble_free_server(ble_gatt_server_t *server)
{
    uint16_t index;
    if (server == NULL) return;
    ble_release_event_queue(s_ble.ctx, &server->event_queue,
                            &server->event_queue_ref,
                            &server->event_queue_rooted);
    heap_caps_free(server->event_payloads);
    for (index = 0; index < server->characteristic_count; ++index) {
        heap_caps_free(server->characteristics[index].id);
        heap_caps_free(server->characteristics[index].value);
    }
    if (server->characteristic_defs != NULL) {
        for (index = 0; index < server->service_count; ++index) {
            heap_caps_free(server->characteristic_defs[index]);
        }
    }
    heap_caps_free(server->characteristic_defs);
    heap_caps_free(server->characteristics);
    heap_caps_free(server->service_uuids);
    heap_caps_free(server->services);
    memset(server, 0, sizeof(*server));
}

static void ble_release_scanner(ble_adapter_t *adapter)
{
    ble_scanner_t *scanner;
    if (adapter == NULL) return;
    scanner = &adapter->scanner;
    ble_scan_callbacks_quiesce();
    ble_release_event_queue(adapter->ctx, &scanner->queue,
                            &scanner->queue_ref, &scanner->queue_rooted);
    heap_caps_free(scanner->payloads);
    memset(scanner, 0, sizeof(*scanner));
}

static void ble_release_advertiser(ble_adapter_t *adapter)
{
    ble_advertiser_t *advertiser;
    if (adapter == NULL) return;
    advertiser = &adapter->advertiser;
    ble_advertise_callbacks_quiesce();
    ble_discard_advertiser_connections(advertiser);
    ble_release_event_queue(adapter->ctx, &advertiser->queue,
                            &advertiser->queue_ref,
                            &advertiser->queue_rooted);
    memset(advertiser, 0, sizeof(*advertiser));
}

