99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static void ble_free_pools(ble_adapter_t *adapter)
{
    uint16_t index;
    if (adapter == NULL) return;
    ble_release_scanner(adapter);
    ble_release_advertiser(adapter);
    for (index = 0; index < adapter->max_connections; ++index) {
        ble_connection_slot_t *slot = &adapter->connections[index];
        ble_release_connection(slot);
        ble_release_event_queue(adapter->ctx, &slot->queue,
                                &slot->queue_ref, &slot->queue_rooted);
        memset(slot, 0, sizeof(*slot));
    }
    ble_free_server(&adapter->server);
}

static bool ble_parse_roles(JSContext *ctx, JSValue value,
                            bool *central, bool *peripheral)
{
    JSGCRef length_ref, item_ref;
    JSValue *length_value = JS_PushGCRef(ctx, &length_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    uint32_t length = 0;
    uint32_t index;
    bool result = false;
    *central = true;
    *peripheral = true;
    if (JS_IsUndefined(value)) {
        result = true;
        goto done;
    }
    if (!JS_IsArray(ctx, value)) {
        JS_ThrowTypeError(ctx, "roles must be an array");
        goto done;
    }
    *central = false;
    *peripheral = false;
    *length_value = JS_GetPropertyStr(ctx, value, "length");
    if (JS_IsException(*length_value) ||
        !ble_to_u32(ctx, *length_value, &length) || length == 0 || length > 2) {
        JS_ThrowRangeError(ctx, "roles must contain central and/or peripheral");
        goto done;
    }
    for (index = 0; index < length; ++index) {
        *item = JS_GetPropertyUint32(ctx, value, index);
        if (ble_string_equals(ctx, *item, "central")) {
            if (*central) {
                JS_ThrowTypeError(ctx, "roles must not contain duplicates");
                goto done;
            }
            *central = true;
        } else if (ble_string_equals(ctx, *item, "peripheral")) {
            if (*peripheral) {
                JS_ThrowTypeError(ctx, "roles must not contain duplicates");
                goto done;
            }
            *peripheral = true;
        } else {
            JS_ThrowTypeError(ctx, "unknown BLE role");
            goto done;
        }
    }
    result = true;
done:
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &length_ref);
    return result;
}

static bool ble_array_length(JSContext *ctx, JSValue value,
                             const char *name, uint32_t *out)
{
    JSGCRef length_ref;
    JSValue *length = JS_PushGCRef(ctx, &length_ref);
    bool result = false;
    if (!JS_IsArray(ctx, value)) {
        JS_ThrowTypeError(ctx, "%s must be an array", name);
        goto done;
    }
    *length = JS_GetPropertyStr(ctx, value, "length");
    if (JS_IsException(*length) || !ble_to_u32(ctx, *length, out)) goto done;
    result = true;
done:
    JS_PopGCRef(ctx, &length_ref);
    return result;
}

static char *ble_copy_string(JSContext *ctx, JSValue value,
                             const char *name, size_t max_length)
{
    JSCStringBuf buffer;
    const char *text = JS_IsString(ctx, value)
                           ? JS_ToCString(ctx, value, &buffer) : NULL;
    size_t length;
    char *copy;
    if (text == NULL || (length = strlen(text)) == 0 || length > max_length) {
        JS_ThrowRangeError(ctx, "%s must contain 1..%u bytes", name,
                           (unsigned)max_length);
        return NULL;
    }
    copy = heap_caps_malloc(length + 1U, MALLOC_CAP_8BIT);
    if (copy == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return NULL;
    }
    memcpy(copy, text, length + 1U);
    return copy;
}

static bool ble_parse_uuid(JSContext *ctx, JSValue value,
                           const char *name, ble_uuid_any_t *out)
{
    JSCStringBuf buffer;
    const char *text = JS_IsString(ctx, value)
                           ? JS_ToCString(ctx, value, &buffer) : NULL;
    if (text == NULL || !esp32_mquickjs_wireless_uuid_valid(text) ||
        ble_uuid_from_str(out, text) != 0) {
        JS_ThrowTypeError(ctx, "%s must be a 16, 32, or 128-bit UUID", name);
        return false;
    }
    return true;
}

static bool ble_parse_properties(JSContext *ctx, JSValue value,
                                 uint32_t *out_flags)
{
    JSGCRef item_ref;
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    uint32_t length, index;
    uint32_t flags = 0;
    bool result = false;
    if (!ble_array_length(ctx, value, "characteristic properties", &length) ||
        length == 0 || length > 7) goto done;
    for (index = 0; index < length; ++index) {
        uint32_t flag;
        *item = JS_GetPropertyUint32(ctx, value, index);
        if (ble_string_equals(ctx, *item, "broadcast")) flag = BLE_GATT_CHR_F_BROADCAST;
        else if (ble_string_equals(ctx, *item, "read")) flag = BLE_GATT_CHR_F_READ;
        else if (ble_string_equals(ctx, *item, "write")) flag = BLE_GATT_CHR_F_WRITE;
        else if (ble_string_equals(ctx, *item, "write-without-response")) flag = BLE_GATT_CHR_F_WRITE_NO_RSP;
        else if (ble_string_equals(ctx, *item, "notify")) flag = BLE_GATT_CHR_F_NOTIFY;
        else if (ble_string_equals(ctx, *item, "indicate")) flag = BLE_GATT_CHR_F_INDICATE;
        else if (ble_string_equals(ctx, *item, "authenticated-signed-write")) flag = BLE_GATT_CHR_F_AUTH_SIGN_WRITE;
        else {
            JS_ThrowTypeError(ctx, "unknown GATT characteristic property");
            goto done;
        }
        if ((flags & flag) != 0) {
            JS_ThrowTypeError(ctx, "duplicate GATT characteristic property");
            goto done;
        }
        flags |= flag;
    }
    *out_flags = flags;
    result = true;
done:
    JS_PopGCRef(ctx, &item_ref);
    return result;
}

static bool ble_parse_permissions(JSContext *ctx, JSValue value,
                                  uint32_t *flags)
{
    JSGCRef item_ref;
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    uint32_t length, index;
    bool result = false;
    if (JS_IsUndefined(value)) {
        result = true;
        goto done;
    }
    if (!ble_array_length(ctx, value, "characteristic permissions", &length) ||
        length > 4) goto done;
    for (index = 0; index < length; ++index) {
        uint32_t flag;
        *item = JS_GetPropertyUint32(ctx, value, index);
        if (ble_string_equals(ctx, *item, "encrypted-read")) flag = BLE_GATT_CHR_F_READ_ENC;
        else if (ble_string_equals(ctx, *item, "encrypted-write")) flag = BLE_GATT_CHR_F_WRITE_ENC;
        else if (ble_string_equals(ctx, *item, "authenticated-read")) flag = BLE_GATT_CHR_F_READ_AUTHEN;
        else if (ble_string_equals(ctx, *item, "authenticated-write")) flag = BLE_GATT_CHR_F_WRITE_AUTHEN;
        else {
            JS_ThrowTypeError(ctx, "unknown GATT characteristic permission");
            goto done;
        }
        if ((*flags & flag) != 0) {
            JS_ThrowTypeError(ctx, "duplicate GATT characteristic permission");
            goto done;
        }
        *flags |= flag;
    }
    result = true;
done:
    JS_PopGCRef(ctx, &item_ref);
    return result;
}

static int ble_server_event_pool_acquire(ble_gatt_server_t *server,
                                         uint16_t *index)
{
    return server != NULL &&
           esp32_mquickjs_native_pool_acquire(&server->free_slots, index);
}

