99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static void ble_server_event_pool_release(ble_gatt_server_t *server,
                                          uint16_t index)
{
    if (server != NULL && index < server->event_capacity)
        (void)esp32_mquickjs_native_pool_release(&server->free_slots, index);
}

static void ble_server_event_drop(void *event, void *opaque)
{
    ble_server_event_t *server_event = event;
    ble_gatt_server_t *server = opaque;
    if (server_event != NULL && server_event->kind == BLE_SERVER_EVENT_WRITE)
        ble_server_event_pool_release(server, server_event->pool_index);
}

static JSValue ble_server_event_to_js(JSContext *ctx, const void *event,
                                      void *opaque)
{
    const ble_server_event_t *server_event = event;
    ble_gatt_server_t *server = opaque;
    ble_connection_slot_t *slot;
    uint16_t connection_index;
    uint8_t *payload = NULL;
    bool pool_released = false;
    JSGCRef object_ref, connection_ref, data_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *connection = JS_PushGCRef(ctx, &connection_ref);
    JSValue *data = JS_PushGCRef(ctx, &data_ref);
    *object = JS_UNDEFINED;
    *connection = JS_UNDEFINED;
    *data = JS_UNDEFINED;
    if (server_event == NULL || server == NULL ||
        server_event->adapter_generation != s_ble.generation ||
        server_event->characteristic_index >= server->characteristic_count ||
        (slot = ble_find_connection(server_event->conn_handle,
                                    &connection_index)) == NULL) {
        JS_ThrowReferenceError(ctx, "BLE_STALE_CONNECTION: server event is stale");
        goto fail;
    }
    *connection = ble_new_connection_handle(ctx, connection_index, slot);
    *object = JS_NewObject(ctx);
    if (server_event->kind == BLE_SERVER_EVENT_WRITE) {
        if (server_event->length > 0) {
            payload = heap_caps_malloc(server_event->length, MALLOC_CAP_8BIT);
            if (payload == NULL) {
                ble_server_event_pool_release(server, server_event->pool_index);
                pool_released = true;
                JS_ThrowOutOfMemory(ctx);
                goto fail;
            }
            memcpy(payload,
                   server->event_payloads + server_event->pool_index *
                                                CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES,
                   server_event->length);
        }
        ble_server_event_pool_release(server, server_event->pool_index);
        pool_released = true;
        *data = esp32_mquickjs_new_owned_byte_view(ctx, payload,
                                                   server_event->length);
        payload = NULL;
    }
    if (JS_IsException(*object) || JS_IsException(*connection) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "type", JS_NewString(ctx,
                server_event->kind == BLE_SERVER_EVENT_WRITE
                    ? "write" : "subscription")) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "sequence",
                                         JS_NewUint32(ctx, server_event->sequence)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "timestampUs",
                                         JS_NewInt64(ctx, server_event->timestamp_us)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "connection", *connection) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "characteristicId",
            JS_NewString(ctx, server->characteristics[
                                  server_event->characteristic_index].id))) goto fail;
    if (server_event->kind == BLE_SERVER_EVENT_WRITE) {
        if (JS_IsException(*data) ||
            !esp32_mquickjs_set_property_ref(ctx, object, "offset",
                                             JS_NewUint32(ctx, server_event->offset)) ||
            !esp32_mquickjs_set_property_ref(ctx, object, "data", *data)) goto fail;
    } else if (!esp32_mquickjs_set_property_ref(ctx, object, "notify",
                                                JS_NewBool(server_event->notify)) ||
               !esp32_mquickjs_set_property_ref(ctx, object, "indicate",
                                                JS_NewBool(server_event->indicate))) goto fail;
    JS_PopGCRef(ctx, &data_ref);
    JS_PopGCRef(ctx, &connection_ref);
    return JS_PopGCRef(ctx, &object_ref);
fail:
    /* Conversion owns a dequeued event, including stale-connection failures.
     * An older adapter event must never return a slot to the current pool. */
    if (!pool_released && server_event != NULL && server != NULL &&
        server_event->adapter_generation == s_ble.generation &&
        server_event->kind == BLE_SERVER_EVENT_WRITE)
        ble_server_event_pool_release(server, server_event->pool_index);
    /* This temporary handle has not been delivered to JavaScript. */
    if (!JS_IsUndefined(*connection) && !JS_IsException(*connection))
        ble_retire_handle(ctx, *connection, JS_CLASS_BLE_CONNECTION,
                          &s_ble_closed_connection_ref);
    heap_caps_free(payload);
    JS_PopGCRef(ctx, &data_ref);
    JS_PopGCRef(ctx, &connection_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static bool ble_parse_gatt_server(JSContext *ctx, JSValue definition,
                                  ble_adapter_t *adapter)
{
    static const char *const server_allowed[] = {"services"};
    static const char *const service_allowed[] = {
        "id", "uuid", "primary", "characteristics",
    };
    static const char *const characteristic_allowed[] = {
        "id", "uuid", "properties", "permissions", "maxLength",
        "initialValue", "storeWrites",
    };
    ble_gatt_server_t *server = &adapter->server;
    JSGCRef services_ref, service_ref, characteristics_ref, characteristic_ref,
        property_ref;
    JSValue *services = JS_PushGCRef(ctx, &services_ref);
    JSValue *service = JS_PushGCRef(ctx, &service_ref);
    JSValue *characteristics = JS_PushGCRef(ctx, &characteristics_ref);
    JSValue *characteristic = JS_PushGCRef(ctx, &characteristic_ref);
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    uint32_t service_count, total_characteristics = 0;
    uint32_t service_index, characteristic_index, global_index = 0;
    char *service_ids[CONFIG_ESP32_MQUICKJS_BLE_MAX_SERVICES] = {0};
    bool result = false;
    JSValue queue;

    if (!ble_is_object(ctx, definition) ||
        !ble_validate_option_keys(ctx, definition, "BLE GATT server",
                                  server_allowed, 1)) goto done;
    *services = JS_GetPropertyStr(ctx, definition, "services");
    if (JS_IsException(*services) ||
        !ble_array_length(ctx, *services, "server services", &service_count) ||
        service_count == 0 ||
        service_count > CONFIG_ESP32_MQUICKJS_BLE_MAX_SERVICES) {
        if (!JS_HasException(ctx))
            ble_throw_error(ctx, "BLE_SERVER_LIMIT", BLE_HS_ENOMEM,
                            -1, -1, -1);
        goto done;
    }
    for (service_index = 0; service_index < service_count; ++service_index) {
        uint32_t count;
        *service = JS_GetPropertyUint32(ctx, *services, service_index);
        if (!ble_is_object(ctx, *service) ||
            !ble_validate_option_keys(ctx, *service, "BLE local service",
                                      service_allowed, 4)) goto done;
        *characteristics = JS_GetPropertyStr(ctx, *service, "characteristics");
        if (JS_IsException(*characteristics) ||
            !ble_array_length(ctx, *characteristics,
                              "service characteristics", &count) || count == 0)
            goto done;
        total_characteristics += count;
        if (total_characteristics > CONFIG_ESP32_MQUICKJS_BLE_MAX_CHARACTERISTICS) {
            ble_throw_error(ctx, "BLE_SERVER_LIMIT", BLE_HS_ENOMEM,
                            -1, -1, -1);
            goto done;
        }
    }
    server->services = heap_caps_calloc(service_count + 1U,
                                         sizeof(*server->services), MALLOC_CAP_8BIT);
    server->service_uuids = heap_caps_calloc(service_count,
                                              sizeof(*server->service_uuids), MALLOC_CAP_8BIT);
    server->characteristic_defs = heap_caps_calloc(
        service_count, sizeof(*server->characteristic_defs), MALLOC_CAP_8BIT);
    server->characteristics = heap_caps_calloc(
        total_characteristics, sizeof(*server->characteristics), MALLOC_CAP_8BIT);
    if (server->services == NULL || server->service_uuids == NULL ||
        server->characteristic_defs == NULL || server->characteristics == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto done;
    }
    server->service_count = service_count;
    server->characteristic_count = total_characteristics;
    for (service_index = 0; service_index < service_count; ++service_index) {
        uint32_t count;
        uint32_t prior_service;
        bool primary = true;
        *service = JS_GetPropertyUint32(ctx, *services, service_index);
        *property = JS_GetPropertyStr(ctx, *service, "id");
        service_ids[service_index] = JS_IsException(*property) ? NULL
            : ble_copy_string(ctx, *property, "service id", 64);
        if (service_ids[service_index] == NULL) goto done;
        for (prior_service = 0; prior_service < service_index;
             ++prior_service) {
            if (strcmp(service_ids[service_index],
                       service_ids[prior_service]) == 0) {
                JS_ThrowTypeError(ctx, "GATT service ids must be unique");
                goto done;
            }
        }
        *property = JS_GetPropertyStr(ctx, *service, "uuid");
        if (JS_IsException(*property) ||
            !ble_parse_uuid(ctx, *property, "service uuid",
                            &server->service_uuids[service_index])) goto done;
        *property = JS_GetPropertyStr(ctx, *service, "primary");
        if (JS_IsException(*property)) goto done;
        if (!JS_IsUndefined(*property)) {
            if (!JS_IsBool(*property)) {
                JS_ThrowTypeError(ctx, "service primary must be a boolean");
                goto done;
            }
            primary = JS_VALUE_GET_SPECIAL_VALUE(*property) != 0;
        }
        *characteristics = JS_GetPropertyStr(ctx, *service, "characteristics");
        if (!ble_array_length(ctx, *characteristics, "service characteristics",
                              &count)) goto done;
        server->characteristic_defs[service_index] = heap_caps_calloc(
            count + 1U, sizeof(struct ble_gatt_chr_def), MALLOC_CAP_8BIT);
        if (server->characteristic_defs[service_index] == NULL) {
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }
        server->services[service_index].type =
            primary ? BLE_GATT_SVC_TYPE_PRIMARY : BLE_GATT_SVC_TYPE_SECONDARY;
        server->services[service_index].uuid =
            &server->service_uuids[service_index].u;
        server->services[service_index].characteristics =
            server->characteristic_defs[service_index];
        for (characteristic_index = 0; characteristic_index < count;
             ++characteristic_index, ++global_index) {
            ble_local_characteristic_t *local =
                &server->characteristics[global_index];
            struct ble_gatt_chr_def *native =
                &server->characteristic_defs[service_index][characteristic_index];
            uint32_t max_length;
            esp32_mquickjs_byte_source_t source;
            uint8_t *owned = NULL;
            JSValue error = JS_UNDEFINED;
            bool store_writes = true;
            uint32_t prior;
            *characteristic = JS_GetPropertyUint32(
                ctx, *characteristics, characteristic_index);
            if (!ble_is_object(ctx, *characteristic) ||
                !ble_validate_option_keys(ctx, *characteristic,
                                          "BLE local characteristic",
                                          characteristic_allowed, 7)) goto done;
            *property = JS_GetPropertyStr(ctx, *characteristic, "id");
            local->id = JS_IsException(*property) ? NULL
                : ble_copy_string(ctx, *property, "characteristic id", 64);
            if (local->id == NULL) goto done;
            for (prior = 0; prior < global_index; ++prior) {
                if (strcmp(local->id, server->characteristics[prior].id) == 0) {
                    JS_ThrowTypeError(ctx,
                                      "GATT characteristic ids must be unique");
                    goto done;
                }
            }
            *property = JS_GetPropertyStr(ctx, *characteristic, "uuid");
            if (JS_IsException(*property) ||
                !ble_parse_uuid(ctx, *property, "characteristic uuid",
                                &local->uuid)) goto done;
            *property = JS_GetPropertyStr(ctx, *characteristic, "properties");
            if (JS_IsException(*property) ||
                !ble_parse_properties(ctx, *property, &local->properties)) goto done;
            *property = JS_GetPropertyStr(ctx, *characteristic, "permissions");
            if (JS_IsException(*property) ||
                !ble_parse_permissions(ctx, *property, &local->properties)) goto done;
            *property = JS_GetPropertyStr(ctx, *characteristic, "maxLength");
            if (JS_IsException(*property) ||
                !ble_to_u32(ctx, *property, &max_length) || max_length == 0 ||
                max_length > CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES) {
                JS_ThrowRangeError(ctx, "maxLength exceeds the compiled limit");
                goto done;
            }
            local->max_length = max_length;
            local->store_writes = true;
            local->lock = (portMUX_TYPE)portMUX_INITIALIZER_UNLOCKED;
            local->value = heap_caps_calloc(max_length, 1,
                                             MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
            if (local->value == NULL) {
                JS_ThrowOutOfMemory(ctx);
                goto done;
            }
            if (!ble_get_bool(ctx, *characteristic, "storeWrites", true,
                              &store_writes)) goto done;
            local->store_writes = store_writes;
            *property = JS_GetPropertyStr(ctx, *characteristic, "initialValue");
            if (JS_IsException(*property)) goto done;
            if (!JS_IsUndefined(*property)) {
                if (!esp32_mquickjs_get_byte_source(
                        ctx, *property, "GATT initialValue", &source,
                        &owned, &error)) goto done;
                if (source.length > max_length) {
                    esp32_mquickjs_release_byte_source(owned);
                    ble_throw_error(ctx, "BLE_PAYLOAD_TOO_LARGE",
                                    BLE_HS_EMSGSIZE, -1, -1, -1);
                    goto done;
                }
                memcpy(local->value, source.data, source.length);
                local->length = source.length;
                esp32_mquickjs_release_byte_source(owned);
            }
            native->uuid = &local->uuid.u;
            native->access_cb = ble_gatt_server_access;
            native->arg = local;
            native->flags = local->properties;
            native->val_handle = &local->value_handle;
        }
    }
    server->event_capacity = CONFIG_ESP32_MQUICKJS_BLE_SERVER_QUEUE_LEN;
    server->event_payloads = heap_caps_calloc(
        server->event_capacity, CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES,
        MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    if (!esp32_mquickjs_native_pool_init(&server->free_slots,
                                            server->event_capacity) ||
        server->event_payloads == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto done;
    }
    queue = esp32_mquickjs_event_queue_new(
        ctx, adapter->runtime, sizeof(ble_server_event_t),
        server->event_capacity, ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST,
        ble_server_event_to_js, ble_server_event_drop, NULL, server);
    if (JS_IsException(queue)) goto done;
    *JS_AddGCRef(ctx, &server->event_queue_ref) = queue;
    server->event_queue_rooted = true;
    server->event_queue = esp32_mquickjs_event_queue_from_value(ctx, queue);
    if (server->event_queue == NULL) goto done;
    server->configured = true;
    atomic_init(&server->sequence, 0);
    atomic_init(&server->writes, 0);
    atomic_init(&server->notifications, 0);
    atomic_init(&server->indications, 0);
    atomic_init(&server->dropped, 0);
    result = true;
done:
    for (service_index = 0;
         service_index < CONFIG_ESP32_MQUICKJS_BLE_MAX_SERVICES;
         ++service_index)
        heap_caps_free(service_ids[service_index]);
    if (!result) ble_free_server(server);
    JS_PopGCRef(ctx, &property_ref);
    JS_PopGCRef(ctx, &characteristic_ref);
    JS_PopGCRef(ctx, &characteristics_ref);
    JS_PopGCRef(ctx, &service_ref);
    JS_PopGCRef(ctx, &services_ref);
    return result;
}

static bool ble_parse_open_options(JSContext *ctx, int argc, JSGCRef *argv,
                                   ble_adapter_t *adapter)
{
    static const char *const allowed[] = {
        "roles", "deviceName", "ownAddressType", "preferredMtu",
        "maxConnections", "security", "server",
    };
    static const char *const security_allowed[] = {
        "bonding", "secureConnections", "mitm", "ioCapability",
        "pairingTimeoutMs",
    };
    JSGCRef property_ref, nested_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    JSValue *nested = JS_PushGCRef(ctx, &nested_ref);
    uint32_t raw;
    JSCStringBuf text_buffer;
    const char *text;
    bool result = false;
    JSValue options = argc == 1 ? argv[0].val : JS_UNDEFINED;

    adapter->role_central = true;
    adapter->role_peripheral = true;
    adapter->own_address_request = BLE_OWN_ADDRESS_AUTO;
    adapter->preferred_mtu = BLE_DEFAULT_MTU;
    adapter->max_connections = CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS;
    adapter->pairing_timeout_ms = BLE_PAIRING_TIMEOUT_MS;
    adapter->bonding = CONFIG_ESP32_MQUICKJS_BLE_BONDING;
    adapter->secure_connections = true;
    adapter->mitm = false;
    adapter->io_capability = BLE_HS_IO_NO_INPUT_OUTPUT;
    memcpy(adapter->device_name, "ESP32QJS", sizeof("ESP32QJS"));
    if (argc > 1) {
        JS_ThrowTypeError(ctx, "ble.open(options?) expects at most one argument");
        goto done;
    }
    if (JS_IsUndefined(options)) {
        result = true;
        goto done;
    }
    if (!ble_is_object(ctx, options) ||
        !ble_validate_option_keys(ctx, options, "ble.open()", allowed, 7)) {
        if (!JS_HasException(ctx))
            JS_ThrowTypeError(ctx, "ble.open options must be an object");
        goto done;
    }
    *property = JS_GetPropertyStr(ctx, options, "roles");
    if (JS_IsException(*property) ||
        !ble_parse_roles(ctx, *property, &adapter->role_central,
                         &adapter->role_peripheral)) goto done;
    *property = JS_GetPropertyStr(ctx, options, "deviceName");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        text = JS_IsString(ctx, *property)
                   ? JS_ToCString(ctx, *property, &text_buffer) : NULL;
        if (text == NULL || strlen(text) == 0 || strlen(text) > BLE_MAX_DEVICE_NAME) {
            JS_ThrowRangeError(ctx, "deviceName must contain 1..64 bytes");
            goto done;
        }
        memcpy(adapter->device_name, text, strlen(text) + 1U);
    }
    *property = JS_GetPropertyStr(ctx, options, "preferredMtu");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!ble_to_u32(ctx, *property, &raw) || raw < 23 ||
            raw > CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU) {
            JS_ThrowRangeError(ctx, "preferredMtu is outside the compiled range");
            goto done;
        }
        adapter->preferred_mtu = raw;
    }
    *property = JS_GetPropertyStr(ctx, options, "maxConnections");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!ble_to_u32(ctx, *property, &raw) || raw == 0 ||
            raw > CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS) {
            JS_ThrowRangeError(ctx, "maxConnections exceeds the compiled limit");
            goto done;
        }
        adapter->max_connections = raw;
    }
    *property = JS_GetPropertyStr(ctx, options, "ownAddressType");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (ble_string_equals(ctx, *property, "public"))
            adapter->own_address_request = BLE_OWN_ADDRESS_PUBLIC;
        else if (ble_string_equals(ctx, *property, "random-static"))
            adapter->own_address_request = BLE_OWN_ADDRESS_RANDOM_STATIC;
        else if (ble_string_equals(ctx, *property, "rpa"))
            adapter->own_address_request = BLE_OWN_ADDRESS_RPA;
        else {
            JS_ThrowTypeError(ctx, "invalid ownAddressType");
            goto done;
        }
    }
    *nested = JS_GetPropertyStr(ctx, options, "security");
    if (JS_IsException(*nested)) goto done;
    if (!JS_IsUndefined(*nested)) {
        if (!ble_is_object(ctx, *nested) ||
            !ble_validate_option_keys(ctx, *nested, "BLE security",
                                      security_allowed, 5)) {
            if (!JS_HasException(ctx))
                JS_ThrowTypeError(ctx, "security must be an object");
            goto done;
        }
        if (!ble_get_bool(ctx, *nested, "bonding", adapter->bonding,
                          &adapter->bonding) ||
            !ble_get_bool(ctx, *nested, "secureConnections", true,
                          &adapter->secure_connections) ||
            !ble_get_bool(ctx, *nested, "mitm", false, &adapter->mitm)) goto done;
        *property = JS_GetPropertyStr(ctx, *nested, "pairingTimeoutMs");
        if (JS_IsException(*property)) goto done;
        if (!JS_IsUndefined(*property)) {
            if (!ble_to_u32(ctx, *property, &raw) || raw < 1000 || raw > 60000) {
                JS_ThrowRangeError(ctx, "pairingTimeoutMs must be in 1000..60000");
                goto done;
            }
            adapter->pairing_timeout_ms = raw;
        }
        *property = JS_GetPropertyStr(ctx, *nested, "ioCapability");
        if (JS_IsException(*property)) goto done;
        if (!JS_IsUndefined(*property)) {
            if (ble_string_equals(ctx, *property, "none"))
                adapter->io_capability = BLE_HS_IO_NO_INPUT_OUTPUT;
            else if (ble_string_equals(ctx, *property, "display-only"))
                adapter->io_capability = BLE_HS_IO_DISPLAY_ONLY;
            else if (ble_string_equals(ctx, *property, "keyboard-only"))
                adapter->io_capability = BLE_HS_IO_KEYBOARD_ONLY;
            else if (ble_string_equals(ctx, *property, "display-keyboard"))
                adapter->io_capability = BLE_HS_IO_KEYBOARD_DISPLAY;
            else if (ble_string_equals(ctx, *property, "display-yes-no"))
                adapter->io_capability = BLE_HS_IO_DISPLAY_YESNO;
            else {
                JS_ThrowTypeError(ctx, "invalid BLE ioCapability");
                goto done;
            }
        }
    }
    *property = JS_GetPropertyStr(ctx, options, "server");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property) &&
        !ble_parse_gatt_server(ctx, *property, adapter)) goto done;
    result = true;
done:
    JS_PopGCRef(ctx, &nested_ref);
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

