99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static bool ble_open_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    uint32_t generation;
    (void)this_ref;
    if (out_state == NULL) return false;
    *out_state = NULL;
    if (s_ble.lifecycle != BLE_LIFECYCLE_CLOSED) {
        ble_throw_error(ctx, "BLE_ALREADY_OPEN", BLE_HS_EALREADY, -1, -1, -1);
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_OPEN;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    atomic_init(&state->completed, false);
    generation = ble_next_generation(&s_ble_next_generation);
    ble_reset_orphan_close();
    /* Host is quiescent here; preserve the permanent callback lock. */
    memset((uint8_t *)&s_ble + sizeof(s_ble.lock), 0,
           sizeof(s_ble) - sizeof(s_ble.lock));
    s_ble.lifecycle = BLE_LIFECYCLE_OPENING;
    s_ble.ctx = ctx;
    s_ble.runtime = esp32_mquickjs_get_active_runtime();
    s_ble.generation = generation;
    atomic_init(&s_ble.reset_count, 0);
    atomic_init(&s_ble.dropped_connection_events, 0);
    atomic_init(&s_ble.rejected_connection_error, 0);
    atomic_init(&s_ble.next_pairing_request, 0);
    state->adapter_generation = generation;
    if (!ble_parse_open_options(ctx, argc, argv, &s_ble) ||
        !ble_allocate_connection_queues(ctx, &s_ble)) {
        ble_free_pools(&s_ble);
        s_ble.lifecycle = BLE_LIFECYCLE_CLOSED;
        heap_caps_free(state);
        return false;
    }
    *out_state = state;
    return true;
}

static void ble_open_initialize(
    esp32_mquickjs_future_driver_state_t *state)
{
    esp_err_t err;
    int cleanup_result;
    if (state == NULL || state->open_initialization_started) return;
    state->open_initialization_started = true;
    if (state->adapter_generation != s_ble.generation ||
        s_ble.lifecycle != BLE_LIFECYCLE_OPENING) {
        state->host_code = BLE_HS_EINVAL;
        state->error_code = "BLE_STALE_ADAPTER";
        goto fail;
    }
    ble_active_state_bind(&s_ble_open_state, state);
    err = esp32_mquickjs_nvs_flash_ensure_initialized();
    if (err == ESP_OK) {
        err = nimble_port_init();
        if (err == ESP_OK) {
            s_ble.port_initialized = true;
        }
    }
    if (err != ESP_OK) {
        state->host_code = err;
        state->error_code = "BLE_NOT_OPEN";
        goto fail;
    }
    ble_hs_cfg.reset_cb = ble_on_reset;
    ble_hs_cfg.sync_cb = ble_on_sync;
    ble_hs_cfg.sm_io_cap = s_ble.io_capability;
    ble_hs_cfg.sm_bonding = s_ble.bonding;
    ble_hs_cfg.sm_sc = s_ble.secure_connections;
    ble_hs_cfg.sm_mitm = s_ble.mitm;
    ble_hs_cfg.sm_our_key_dist = BLE_SM_PAIR_KEY_DIST_ENC |
                                 BLE_SM_PAIR_KEY_DIST_ID;
    ble_hs_cfg.sm_their_key_dist = BLE_SM_PAIR_KEY_DIST_ENC |
                                   BLE_SM_PAIR_KEY_DIST_ID;
    if (ble_svc_gap_device_name_set(s_ble.device_name) != 0 ||
        ble_att_set_preferred_mtu(s_ble.preferred_mtu) != 0) {
        cleanup_result = ble_cleanup_native(&s_ble);
        state->host_code = cleanup_result != 0
                               ? cleanup_result : BLE_HS_EINVAL;
        state->error_code = "BLE_NOT_OPEN";
        goto fail;
    }
    ble_gatt_server_register();
    if (s_ble.server.configured && !s_ble.server.open) {
        int host_code = state->host_code != 0 ? state->host_code : BLE_HS_EUNKNOWN;
        cleanup_result = ble_cleanup_native(&s_ble);
        state->host_code = cleanup_result != 0 ? cleanup_result : host_code;
        state->error_code = "BLE_GATT_ERROR";
        goto fail;
    }
    nimble_port_freertos_init(ble_host_task);
    s_ble.host_started = true;
    return;

fail:
    s_ble.lifecycle = BLE_LIFECYCLE_FAILED;
    ble_active_state_bind(&s_ble_open_state, NULL);
    atomic_store_explicit(&state->completed, true, memory_order_release);
    ble_future_wake_state(state);
}

static bool ble_open_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->adapter_generation != s_ble.generation ||
        s_ble.lifecycle != BLE_LIFECYCLE_OPENING) {
        ble_throw_error(ctx, "BLE_STALE_ADAPTER", BLE_HS_EINVAL, -1, -1, -1);
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    state->open_not_before_us = s_ble_reopen_not_before_us;
    if (esp_timer_get_time() >= state->open_not_before_us)
        ble_open_initialize(state);
    return true;
}

static esp32_mquickjs_future_poll_t ble_open_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && state->started &&
        !state->open_initialization_started &&
        esp_timer_get_time() >= state->open_not_before_us)
        ble_open_initialize(state);
    return ble_future_poll(state);
}

static JSValue ble_open_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    ble_adapter_ref_t *ref;
    JSValue object;
    if (state == NULL || state->host_code != 0 || !s_ble.synchronized) {
        return ble_throw_error(ctx,
                               state != NULL && state->error_code != NULL
                                   ? state->error_code : "BLE_NOT_OPEN",
                               state != NULL ? state->host_code : BLE_HS_EINVAL,
                               -1, -1, -1);
    }
    object = JS_NewObjectClassUser(ctx, JS_CLASS_BLE_ADAPTER);
    if (JS_IsException(object)) return object;
    ref = heap_caps_calloc(1, sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) return JS_ThrowOutOfMemory(ctx);
    ref->generation = s_ble.generation;
    JS_SetOpaque(ctx, object, ref);
    s_ble.lifecycle = BLE_LIFECYCLE_ACTIVE;
    ble_active_state_bind(&s_ble_open_state, NULL);
    state->transferred = true;
    return object;
}

static void ble_open_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && !state->transferred &&
        state->adapter_generation == s_ble.generation) {
        int cleanup_result = ble_cleanup_native(&s_ble);

        if (cleanup_result == 0) {
            ble_free_pools(&s_ble);
            s_ble.lifecycle = BLE_LIFECYCLE_CLOSED;
            s_ble.runtime = NULL;
        } else {
            s_ble.lifecycle = BLE_LIFECYCLE_FAILED;
        }
    }
    ble_future_state_release(state);
}

static const esp32_mquickjs_future_driver_t s_ble_open_driver = {
    .capture = ble_open_capture,
    .start = ble_open_start,
    .poll = ble_open_poll,
    .finish = ble_open_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_open_destroy,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_adapter_resource_key,
};

