99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static ble_scanner_t *ble_scanner_from_value(JSContext *ctx, JSValue value,
                                             bool throw_if_stale)
{
    ble_scanner_ref_t *ref;
    if (JS_GetClassID(ctx, value) != JS_CLASS_BLE_SCANNER ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "expected a BLEScanner instance");
        return NULL;
    }
    if (ref->adapter_generation != s_ble.generation ||
        ref->generation != s_ble.scanner.generation ||
        !s_ble.scanner.allocated) {
        if (throw_if_stale)
            JS_ThrowReferenceError(ctx, "BLE_STALE_ADAPTER: scanner is closed");
        return NULL;
    }
    return &s_ble.scanner;
}

static bool ble_scan_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    static const char *const allowed[] = {
        "active", "intervalMs", "windowMs", "durationMs",
        "filterDuplicates", "limited", "capacity",
    };
    esp32_mquickjs_future_driver_state_t *state;
    ble_adapter_t *adapter;
    ble_scanner_t *scanner = &s_ble.scanner;
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    JSValue options = argc == 1 ? argv[0].val : JS_UNDEFINED;
    uint32_t capacity = CONFIG_ESP32_MQUICKJS_BLE_SCAN_QUEUE_LEN;
    uint32_t raw;
    double number;
    bool present;
    bool active = true, filter_duplicates = true, limited = false;
    JSValue queue;

    if (out_state == NULL || argc > 1 ||
        (adapter = ble_adapter_from_value(ctx, this_ref->val, true)) == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    *out_state = NULL;
    if (scanner->allocated || adapter->advertiser.active ||
        ble_has_pending_connects()) {
        JS_PopGCRef(ctx, &property_ref);
        ble_throw_error(ctx, "BLE_GAP_CONFLICT", BLE_HS_EBUSY, -1, -1, -1);
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_SCAN;
    state->adapter_generation = adapter->generation;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    state->duration_ms = BLE_HS_FOREVER;
    atomic_init(&state->completed, false);
    if (!JS_IsUndefined(options)) {
        if (!ble_is_object(ctx, options) ||
            !ble_validate_option_keys(ctx, options, "BLEAdapter.scan()",
                                      allowed, 7) ||
            !ble_get_bool(ctx, options, "active", true, &active) ||
            !ble_get_bool(ctx, options, "filterDuplicates", true,
                          &filter_duplicates) ||
            !ble_get_bool(ctx, options, "limited", false, &limited)) goto fail;
        *property = JS_GetPropertyStr(ctx, options, "capacity");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!ble_to_u32(ctx, *property, &raw) || raw == 0 ||
                raw > CONFIG_ESP32_MQUICKJS_BLE_SCAN_QUEUE_MAX_LEN) {
                JS_ThrowRangeError(ctx, "scan capacity exceeds the compiled limit");
                goto fail;
            }
            capacity = raw;
        }
        if (!ble_get_number(ctx, options, "intervalMs", &number, &present)) goto fail;
        if (present) {
            if (number < 2.5 || number > 10240.0) {
                JS_ThrowRangeError(ctx, "intervalMs must be in 2.5..10240");
                goto fail;
            }
            state->scan_params.itvl = ble_ms_to_625us(number);
        }
        if (!ble_get_number(ctx, options, "windowMs", &number, &present)) goto fail;
        if (present) {
            if (number < 2.5 || number > 10240.0) {
                JS_ThrowRangeError(ctx, "windowMs must be in 2.5..10240");
                goto fail;
            }
            state->scan_params.window = ble_ms_to_625us(number);
        }
        if (state->scan_params.itvl != 0 && state->scan_params.window != 0 &&
            state->scan_params.window > state->scan_params.itvl) {
            JS_ThrowRangeError(ctx, "windowMs must not exceed intervalMs");
            goto fail;
        }
        *property = JS_GetPropertyStr(ctx, options, "durationMs");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!ble_to_u32(ctx, *property, &raw) || raw == 0 || raw > INT32_MAX) {
                JS_ThrowRangeError(ctx, "durationMs must be in 1..2147483647");
                goto fail;
            }
            state->duration_ms = raw;
            state->timeout_ms = raw + 1000U;
        }
    }
    state->scan_params.passive = !active;
    state->scan_params.filter_duplicates = filter_duplicates;
    state->scan_params.limited = limited;
    memset(scanner, 0, sizeof(*scanner));
    scanner->allocated = true;
    scanner->open = true;
    scanner->generation = ble_next_generation(&s_ble_next_scanner_generation);
    scanner->capacity = capacity;
    scanner->stop_reason = BLE_STOP_RUNNING;
    atomic_init(&scanner->sequence, 0);
    atomic_init(&scanner->reports, 0);
    atomic_init(&scanner->dropped, 0);
    atomic_init(&scanner->malformed, 0);
    scanner->payloads = heap_caps_calloc(capacity, BLE_HS_ADV_MAX_SZ,
                                         MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    if (!esp32_mquickjs_native_pool_init(&scanner->free_slots, capacity) ||
        scanner->payloads == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail_scanner;
    }
    queue = esp32_mquickjs_event_queue_new(
        ctx, adapter->runtime, sizeof(ble_scan_event_t), capacity,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST, ble_scan_event_to_js,
        ble_scan_event_drop, NULL, scanner);
    if (JS_IsException(queue)) goto fail_scanner;
    *JS_AddGCRef(ctx, &scanner->queue_ref) = queue;
    scanner->queue_rooted = true;
    scanner->queue = esp32_mquickjs_event_queue_from_value(ctx, queue);
    if (scanner->queue == NULL) goto fail_scanner;
    state->connection_generation = scanner->generation;
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    JS_PopGCRef(ctx, &property_ref);
    return true;
fail_scanner:
    ble_release_event_queue(ctx, &scanner->queue, &scanner->queue_ref,
                            &scanner->queue_rooted);
    heap_caps_free(scanner->payloads);
    memset(scanner, 0, sizeof(*scanner));
fail:
    heap_caps_free(state);
    JS_PopGCRef(ctx, &property_ref);
    return false;
}

