99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static bool ble_scan_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    int rc;
    void *cookie;
    if (state == NULL || s_ble.lifecycle != BLE_LIFECYCLE_ACTIVE ||
        state->adapter_generation != s_ble.generation ||
        state->connection_generation != s_ble.scanner.generation) {
        ble_throw_error(ctx, "BLE_STALE_ADAPTER", BLE_HS_EINVAL, -1, -1, -1);
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    cookie = ble_scan_callback_bind();
    if (cookie == NULL) {
        state->host_code = BLE_HS_EBUSY;
        ble_throw_error(ctx, "BLE_BUSY", BLE_HS_EBUSY, -1, -1, -1);
        return false;
    }
    s_ble.scanner.active = true;
    s_ble.scanner.started_at_us = esp_timer_get_time();
    rc = ble_gap_disc(s_ble.own_addr_type, state->duration_ms,
                      &state->scan_params, ble_scan_event_callback, cookie);
    if (rc != 0) {
        s_ble.scanner.active = false;
        ble_scan_callbacks_quiesce();
        state->host_code = rc;
        s_ble.scanner.stop_reason = BLE_STOP_ERROR;
        ble_throw_error(ctx, "BLE_GAP_CONFLICT", rc, -1, -1, -1);
        return false;
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static JSValue ble_scan_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    ble_scanner_ref_t *ref;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_BLE_SCANNER);
    if (JS_IsException(*object)) goto fail;
    ref = heap_caps_calloc(1, sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    ref->adapter_generation = s_ble.generation;
    ref->generation = s_ble.scanner.generation;
    JS_SetOpaque(ctx, *object, ref);
    if (!esp32_mquickjs_set_property_ref(ctx, object, "_eventQueue",
                                         s_ble.scanner.queue_ref.val)) {
        JS_SetOpaque(ctx, *object, NULL);
        heap_caps_free(ref);
        goto fail;
    }
    state->transferred = true;
    return JS_PopGCRef(ctx, &object_ref);
fail:
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static void ble_scan_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && !state->transferred &&
        state->connection_generation == s_ble.scanner.generation) {
        if (s_ble.scanner.active) {
            int rc = ble_gap_disc_cancel();
            if (rc != 0 && rc != BLE_HS_EALREADY) {
                s_ble.scanner.stop_reason = BLE_STOP_ERROR;
                ble_request_orphan_close(state->adapter_generation);
                ble_future_state_release(state);
                return;
            }
            s_ble.scanner.active = false;
        }
        ble_scan_callbacks_quiesce();
        ble_release_event_queue(state->ctx, &s_ble.scanner.queue,
                                &s_ble.scanner.queue_ref,
                                &s_ble.scanner.queue_rooted);
        heap_caps_free(s_ble.scanner.payloads);
        memset(&s_ble.scanner, 0, sizeof(s_ble.scanner));
    }
    ble_future_state_release(state);
}

static bool ble_scanner_close_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    ble_scanner_t *scanner;
    (void)argv;
    if (out_state == NULL || argc != 0 ||
        (scanner = ble_scanner_from_value(ctx, this_ref->val, true)) == NULL)
        return false;
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_SCANNER_CLOSE;
    state->adapter_generation = s_ble.generation;
    state->connection_generation = scanner->generation;
    state->timeout_ms = 2000;
    atomic_init(&state->completed, false);
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static bool ble_scanner_close_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    int rc = 0;
    (void)ctx;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (s_ble.scanner.active) {
        rc = ble_gap_disc_cancel();
        if (rc == BLE_HS_EALREADY) rc = 0;
    }
    state->host_code = rc;
    if (rc == 0) {
        s_ble.scanner.active = false;
        s_ble.scanner.stop_reason = BLE_STOP_CLOSED;
    } else {
        s_ble.scanner.stop_reason = BLE_STOP_ERROR;
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static JSValue ble_scanner_close_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->host_code != 0)
        return ble_bool_finish(ctx, state);
    ble_release_scanner(&s_ble);
    ble_retire_handle(ctx, state->owner_ref.val, JS_CLASS_BLE_SCANNER,
                      &s_ble_closed_scanner_ref);
    return JS_TRUE;
}

static JSValue ble_bool_finish(JSContext *ctx,
                               esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->host_code != 0)
        return ble_throw_error(ctx, "BLE_GATT_ERROR",
                               state != NULL ? state->host_code : BLE_HS_EINVAL,
                               state != NULL ? state->att_code : -1,
                               state != NULL ? state->connection_index : -1,
                               state != NULL ? state->attribute_handle : -1);
    return JS_NewBool(state->result_bool || true);
}

static const esp32_mquickjs_future_driver_t s_ble_scan_driver = {
    .capture = ble_scan_capture,
    .start = ble_scan_start,
    .poll = ble_future_poll,
    .finish = ble_scan_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_scan_destroy,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gap_resource_key,
};

static const esp32_mquickjs_future_driver_t s_ble_scanner_close_driver = {
    .capture = ble_scanner_close_capture,
    .start = ble_scanner_close_start,
    .poll = ble_future_poll,
    .finish = ble_scanner_close_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gap_resource_key,
};

static ble_advertiser_t *ble_advertiser_from_value(JSContext *ctx,
                                                   JSValue value,
                                                   bool throw_if_stale)
{
    ble_advertiser_ref_t *ref;
    if (JS_GetClassID(ctx, value) != JS_CLASS_BLE_ADVERTISER ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "expected a BLEAdvertiser instance");
        return NULL;
    }
    if (ref->adapter_generation != s_ble.generation ||
        ref->generation != s_ble.advertiser.generation ||
        !s_ble.advertiser.allocated) {
        if (throw_if_stale)
            JS_ThrowReferenceError(ctx, "BLE_STALE_ADAPTER: advertiser is closed");
        return NULL;
    }
    return &s_ble.advertiser;
}

static bool ble_copy_small_byte_source(JSContext *ctx, JSValue value,
                                       const char *api_name,
                                       uint8_t output[BLE_HS_ADV_MAX_SZ],
                                       uint8_t *out_length)
{
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue error = JS_UNDEFINED;
    if (!esp32_mquickjs_get_byte_source(ctx, value, api_name, &source, &owned,
                                        &error)) return false;
    if (source.length > BLE_HS_ADV_MAX_SZ) {
        esp32_mquickjs_release_byte_source(owned);
        ble_throw_error(ctx, "BLE_PAYLOAD_TOO_LARGE", BLE_HS_EMSGSIZE,
                        -1, -1, -1);
        return false;
    }
    if (source.length > 0) memcpy(output, source.data, source.length);
    *out_length = source.length;
    esp32_mquickjs_release_byte_source(owned);
    return true;
}

