99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static bool ble_advertise_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    static const char *const allowed[] = {
        "connectable", "scannable", "intervalMinMs", "intervalMaxMs",
        "durationMs", "data", "scanResponse", "capacity",
    };
    esp32_mquickjs_future_driver_state_t *state;
    ble_adapter_t *adapter;
    ble_advertiser_t *advertiser = &s_ble.advertiser;
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool connectable = false, scannable = false;
    bool present;
    double number;
    uint32_t raw;
    uint32_t capacity = CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS;
    JSValue queue;

    if (out_state == NULL || argc != 1 ||
        (adapter = ble_adapter_from_value(ctx, this_ref->val, true)) == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    *out_state = NULL;
    if (!adapter->role_peripheral) {
        JS_PopGCRef(ctx, &property_ref);
        ble_throw_error(ctx, "BLE_NOT_SUPPORTED", BLE_HS_ENOTSUP, -1, -1, -1);
        return false;
    }
    if (advertiser->allocated || adapter->scanner.active ||
        ble_has_pending_connects()) {
        JS_PopGCRef(ctx, &property_ref);
        ble_throw_error(ctx, "BLE_GAP_CONFLICT", BLE_HS_EBUSY, -1, -1, -1);
        return false;
    }
    if (!ble_is_object(ctx, argv[0].val) ||
        !ble_validate_option_keys(ctx, argv[0].val, "BLEAdapter.advertise()",
                                  allowed, 8)) {
        JS_PopGCRef(ctx, &property_ref);
        if (!JS_HasException(ctx)) JS_ThrowTypeError(ctx, "advertising options must be an object");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_ADVERTISE;
    state->adapter_generation = adapter->generation;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    state->duration_ms = BLE_HS_FOREVER;
    atomic_init(&state->completed, false);
    if (!ble_get_bool(ctx, argv[0].val, "connectable", false, &connectable) ||
        !ble_get_bool(ctx, argv[0].val, "scannable", false, &scannable)) goto fail;
    *property = JS_GetPropertyStr(ctx, argv[0].val, "data");
    if (JS_IsException(*property) || JS_IsUndefined(*property) ||
        !ble_copy_small_byte_source(ctx, *property, "advertising data",
                                    state->adv_data, &state->adv_data_length)) goto fail;
    *property = JS_GetPropertyStr(ctx, argv[0].val, "scanResponse");
    if (JS_IsException(*property)) goto fail;
    if (!JS_IsUndefined(*property)) {
        if (!scannable) {
            JS_ThrowTypeError(ctx, "scanResponse requires scannable:true");
            goto fail;
        }
        if (!ble_copy_small_byte_source(ctx, *property, "scan response",
                                        state->scan_response,
                                        &state->scan_response_length)) goto fail;
    }
    *property = JS_GetPropertyStr(ctx, argv[0].val, "capacity");
    if (JS_IsException(*property)) goto fail;
    if (!JS_IsUndefined(*property)) {
        if (!ble_to_u32(ctx, *property, &raw) || raw == 0 ||
            raw > CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS) {
            JS_ThrowRangeError(ctx, "advertiser capacity exceeds maxConnections");
            goto fail;
        }
        capacity = raw;
    }
    if (!ble_get_number(ctx, argv[0].val, "intervalMinMs", &number, &present)) goto fail;
    if (present) {
        if (number < 20.0 || number > 10240.0) {
            JS_ThrowRangeError(ctx, "intervalMinMs must be in 20..10240");
            goto fail;
        }
        state->adv_params.itvl_min = ble_ms_to_625us(number);
    }
    if (!ble_get_number(ctx, argv[0].val, "intervalMaxMs", &number, &present)) goto fail;
    if (present) {
        if (number < 20.0 || number > 10240.0) {
            JS_ThrowRangeError(ctx, "intervalMaxMs must be in 20..10240");
            goto fail;
        }
        state->adv_params.itvl_max = ble_ms_to_625us(number);
    }
    if (state->adv_params.itvl_min != 0 && state->adv_params.itvl_max != 0 &&
        state->adv_params.itvl_min > state->adv_params.itvl_max) {
        JS_ThrowRangeError(ctx, "intervalMinMs must not exceed intervalMaxMs");
        goto fail;
    }
    *property = JS_GetPropertyStr(ctx, argv[0].val, "durationMs");
    if (JS_IsException(*property)) goto fail;
    if (!JS_IsUndefined(*property)) {
        if (!ble_to_u32(ctx, *property, &raw) || raw == 0 || raw > INT32_MAX) {
            JS_ThrowRangeError(ctx, "durationMs must be in 1..2147483647");
            goto fail;
        }
        state->duration_ms = raw;
        state->timeout_ms = raw + 1000U;
    }
    state->adv_params.conn_mode = connectable ? BLE_GAP_CONN_MODE_UND
                                               : BLE_GAP_CONN_MODE_NON;
    state->adv_params.disc_mode = BLE_GAP_DISC_MODE_GEN;
    memset(advertiser, 0, sizeof(*advertiser));
    advertiser->allocated = true;
    advertiser->open = true;
    advertiser->connectable = connectable;
    advertiser->scannable = scannable;
    advertiser->generation = ble_next_generation(&s_ble_next_advertiser_generation);
    advertiser->stop_reason = BLE_STOP_RUNNING;
    atomic_init(&advertiser->sequence, 0);
    atomic_init(&advertiser->incoming, 0);
    atomic_init(&advertiser->dropped, 0);
    queue = esp32_mquickjs_event_queue_new(
        ctx, adapter->runtime, sizeof(ble_advertiser_event_t), capacity,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST,
        ble_advertiser_event_to_js, ble_advertiser_event_drop, NULL, advertiser);
    if (JS_IsException(queue)) goto fail_advertiser;
    *JS_AddGCRef(ctx, &advertiser->queue_ref) = queue;
    advertiser->queue_rooted = true;
    advertiser->queue = esp32_mquickjs_event_queue_from_value(ctx, queue);
    if (advertiser->queue == NULL) goto fail_advertiser;
    state->connection_generation = advertiser->generation;
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    JS_PopGCRef(ctx, &property_ref);
    return true;
fail_advertiser:
    ble_release_event_queue(ctx, &advertiser->queue,
                            &advertiser->queue_ref,
                            &advertiser->queue_rooted);
    memset(advertiser, 0, sizeof(*advertiser));
fail:
    heap_caps_free(state);
    JS_PopGCRef(ctx, &property_ref);
    return false;
}

static bool ble_advertise_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    int rc;
    void *cookie;
    if (state == NULL || s_ble.lifecycle != BLE_LIFECYCLE_ACTIVE ||
        state->adapter_generation != s_ble.generation ||
        state->connection_generation != s_ble.advertiser.generation) {
        ble_throw_error(ctx, "BLE_STALE_ADAPTER", BLE_HS_EINVAL, -1, -1, -1);
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    cookie = ble_advertise_callback_bind();
    if (cookie == NULL) {
        state->host_code = BLE_HS_EBUSY;
        ble_throw_error(ctx, "BLE_BUSY", BLE_HS_EBUSY, -1, -1, -1);
        return false;
    }
    rc = ble_gap_adv_set_data(state->adv_data, state->adv_data_length);
    if (rc == 0 && state->scan_response_length > 0)
        rc = ble_gap_adv_rsp_set_data(state->scan_response,
                                      state->scan_response_length);
    if (rc == 0) {
        s_ble.advertiser.active = true;
        rc = ble_gap_adv_start(s_ble.own_addr_type, NULL, state->duration_ms,
                               &state->adv_params, ble_advertise_event_callback, cookie);
    }
    if (rc != 0) {
        s_ble.advertiser.active = false;
        ble_advertise_callbacks_quiesce();
        state->host_code = rc;
        s_ble.advertiser.stop_reason = BLE_STOP_ERROR;
        ble_throw_error(ctx, "BLE_GAP_CONFLICT", rc, -1, -1, -1);
        return false;
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

