99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static JSValue ble_advertise_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    ble_advertiser_ref_t *ref;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_BLE_ADVERTISER);
    if (JS_IsException(*object)) goto fail;
    ref = heap_caps_calloc(1, sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    ref->adapter_generation = s_ble.generation;
    ref->generation = s_ble.advertiser.generation;
    JS_SetOpaque(ctx, *object, ref);
    if (!esp32_mquickjs_set_property_ref(ctx, object, "_eventQueue",
                                         s_ble.advertiser.queue_ref.val)) {
        JS_SetOpaque(ctx, *object, NULL);
        heap_caps_free(ref);
        goto fail;
    }
    state->transferred = true;
    return JS_PopGCRef(ctx, &object_ref);
fail:
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static void ble_advertise_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && !state->transferred &&
        state->connection_generation == s_ble.advertiser.generation) {
        if (s_ble.advertiser.active) {
            int rc = ble_gap_adv_stop();
            if (rc != 0 && rc != BLE_HS_EALREADY) {
                s_ble.advertiser.stop_reason = BLE_STOP_ERROR;
                ble_request_orphan_close(state->adapter_generation);
                ble_future_state_release(state);
                return;
            }
            s_ble.advertiser.active = false;
        }
        ble_advertise_callbacks_quiesce();
        ble_discard_advertiser_connections(&s_ble.advertiser);
        ble_release_event_queue(state->ctx, &s_ble.advertiser.queue,
                                &s_ble.advertiser.queue_ref,
                                &s_ble.advertiser.queue_rooted);
        memset(&s_ble.advertiser, 0, sizeof(s_ble.advertiser));
    }
    ble_future_state_release(state);
}

static bool ble_advertiser_close_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    ble_advertiser_t *advertiser;
    (void)argv;
    if (out_state == NULL || argc != 0 ||
        (advertiser = ble_advertiser_from_value(ctx, this_ref->val, true)) == NULL)
        return false;
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_ADVERTISER_CLOSE;
    state->adapter_generation = s_ble.generation;
    state->connection_generation = advertiser->generation;
    state->timeout_ms = 2000;
    atomic_init(&state->completed, false);
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static bool ble_advertiser_close_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    int rc = 0;
    (void)ctx;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (s_ble.advertiser.active) {
        rc = ble_gap_adv_stop();
        if (rc == BLE_HS_EALREADY) rc = 0;
    }
    state->host_code = rc;
    if (rc == 0) {
        s_ble.advertiser.active = false;
        s_ble.advertiser.stop_reason = BLE_STOP_CLOSED;
    } else {
        s_ble.advertiser.stop_reason = BLE_STOP_ERROR;
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static JSValue ble_advertiser_close_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL || state->host_code != 0)
        return ble_bool_finish(ctx, state);
    ble_release_advertiser(&s_ble);
    ble_retire_handle(ctx, state->owner_ref.val, JS_CLASS_BLE_ADVERTISER,
                      &s_ble_closed_advertiser_ref);
    return JS_TRUE;
}

static const esp32_mquickjs_future_driver_t s_ble_advertise_driver = {
    .capture = ble_advertise_capture,
    .start = ble_advertise_start,
    .poll = ble_future_poll,
    .finish = ble_advertise_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_advertise_destroy,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gap_resource_key,
};

static const esp32_mquickjs_future_driver_t s_ble_advertiser_close_driver = {
    .capture = ble_advertiser_close_capture,
    .start = ble_advertiser_close_start,
    .poll = ble_future_poll,
    .finish = ble_advertiser_close_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gap_resource_key,
};

static bool ble_parse_timeout_option(JSContext *ctx, JSValue options,
                                     const char *api_name,
                                     uint32_t *timeout_ms)
{
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool result = false;
    if (JS_IsUndefined(options)) {
        result = true;
        goto done;
    }
    if (!ble_is_object(ctx, options)) {
        JS_ThrowTypeError(ctx, "%s options must be an object", api_name);
        goto done;
    }
    *property = JS_GetPropertyStr(ctx, options, "timeoutMs");
    if (JS_IsException(*property)) goto done;
    if (!JS_IsUndefined(*property)) {
        if (!esp32_mquickjs_value_to_bounded_u32(
                ctx, *property, 1U, 60000U, timeout_ms)) {
            JS_ThrowRangeError(ctx, "timeoutMs must be in 1..60000");
            goto done;
        }
    }
    result = true;
done:
    JS_PopGCRef(ctx, &property_ref);
    return result;
}

static bool ble_connect_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    static const char *const allowed[] = {"timeoutMs", "preferredMtu"};
    esp32_mquickjs_future_driver_state_t *state;
    ble_adapter_t *adapter;
    ble_connection_slot_t *slot;
    uint16_t index;
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    JSValue options = argc == 2 ? argv[1].val : JS_UNDEFINED;
    uint32_t raw;

    if (out_state == NULL || argc < 1 || argc > 2 ||
        (adapter = ble_adapter_from_value(ctx, this_ref->val, true)) == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    *out_state = NULL;
    if (!adapter->role_central || adapter->scanner.active ||
        ble_has_pending_connects() || adapter->advertiser.active) {
        JS_PopGCRef(ctx, &property_ref);
        ble_throw_error(ctx, !adapter->role_central ? "BLE_NOT_SUPPORTED"
                                                    : "BLE_GAP_CONFLICT",
                        BLE_HS_EBUSY, -1, -1, -1);
        return false;
    }
    if (!JS_IsUndefined(options) &&
        (!ble_is_object(ctx, options) ||
         !ble_validate_option_keys(ctx, options, "BLEAdapter.connect()",
                                   allowed, 2))) {
        JS_PopGCRef(ctx, &property_ref);
        if (!JS_HasException(ctx))
            JS_ThrowTypeError(ctx, "connect options must be an object");
        return false;
    }
    slot = ble_reserve_connection(true, &index);
    if (slot == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        ble_throw_error(ctx, "BLE_QUEUE_FULL", BLE_HS_ENOMEM, -1, -1, -1);
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        slot->reserved = false;
        JS_PopGCRef(ctx, &property_ref);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_CONNECT;
    state->adapter_generation = adapter->generation;
    state->connection_index = index;
    state->connection_generation = slot->generation;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    state->mtu = adapter->preferred_mtu;
    atomic_init(&state->completed, false);
    if (!ble_parse_address(ctx, argv[0].val, &state->peer)) goto fail;
    if (!JS_IsUndefined(options)) {
        if (!ble_parse_timeout_option(ctx, options, "connect", &state->timeout_ms))
            goto fail;
        *property = JS_GetPropertyStr(ctx, options, "preferredMtu");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!ble_to_u32(ctx, *property, &raw) || raw < 23 ||
                raw > CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU) {
                JS_ThrowRangeError(ctx, "preferredMtu is outside the compiled range");
                goto fail;
            }
            state->mtu = raw;
        }
    }
    taskENTER_CRITICAL(&s_ble.lock);
    slot->peer = state->peer;
    taskEXIT_CRITICAL(&s_ble.lock);
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    JS_PopGCRef(ctx, &property_ref);
    return true;
fail:
    slot->reserved = false;
    heap_caps_free(state);
    JS_PopGCRef(ctx, &property_ref);
    return false;
}

