99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static bool ble_connect_start_locked(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot =
        &s_ble.connections[state->connection_index];
    int rc;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (!esp32_mquickjs_wireless_native_operation_begin(
            &slot->connect_operation)) {
        state->host_code = BLE_HS_EBUSY;
        slot->reserved = false;
        slot->allocated = false;
        ble_throw_error(ctx, "BLE_GAP_CONFLICT", BLE_HS_EBUSY,
                        -1, state->connection_index, -1);
        return false;
    }
    ble_active_state_bind(&slot->active_gap_state, state);
    rc = ble_gap_connect(s_ble.own_addr_type, &state->peer,
                         state->timeout_ms, NULL, ble_gap_event_callback, slot);
    if (rc != 0) {
        (void)esp32_mquickjs_wireless_native_operation_complete(
            &slot->connect_operation);
        ble_active_state_bind(&slot->active_gap_state, NULL);
        state->host_code = rc;
        s_ble.connections[state->connection_index].reserved = false;
        ble_throw_error(ctx, "BLE_CONNECTION_FAILED", rc, -1, -1, -1);
        return false;
    }
    return true;
}

static bool ble_connect_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    bool result;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    result = ble_connect_start_locked(ctx, runtime, token, state);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return result;
}

static JSValue ble_connect_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot;
    JSValue connection;
    if (state == NULL || state->connection_index >= s_ble.max_connections)
        return ble_throw_error(ctx, "BLE_CONNECTION_FAILED", BLE_HS_EINVAL,
                               -1, -1, -1);
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    slot = &s_ble.connections[state->connection_index];
    if (state->host_code != 0 || !slot->open ||
        slot->generation != state->connection_generation) {
        xSemaphoreGiveRecursive(s_ble_connection_mutex);
        return ble_throw_error(ctx, "BLE_CONNECTION_FAILED", state->host_code,
                               -1, state->connection_index, -1);
    }
    (void)ble_gap_set_event_cb(slot->conn_handle, ble_gap_event_callback, NULL);
    ble_active_state_bind(&slot->active_gap_state, NULL);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    connection = ble_new_connection_handle(ctx, state->connection_index, slot);
    if (!JS_IsException(connection)) state->transferred = true;
    return connection;
}

static void ble_connect_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    if (state != NULL && !state->transferred &&
        state->connection_index < s_ble.max_connections) {
        ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
        if (slot->generation == state->connection_generation) {
            if (slot->open) {
                (void)esp32_mquickjs_wireless_native_operation_begin(
                    &slot->connect_operation);
                (void)esp32_mquickjs_wireless_native_operation_request_cancel(
                    &slot->connect_operation);
                ble_terminate_unclaimed_connection(slot, state->connection_generation);
                xSemaphoreGiveRecursive(s_ble_connection_mutex);
                ble_future_state_release(state);
                return;
            }
            if (esp32_mquickjs_wireless_native_operation_is_quiescent(
                    &slot->connect_operation)) {
                slot->reserved = false;
                slot->allocated = false;
            }
        }
    }
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    ble_future_state_release(state);
}

static esp32_mquickjs_resource_key_t ble_gap_resource_key(
    const esp32_mquickjs_future_driver_state_t *state)
{
    (void)state;
    return &s_ble_gap_lane_key;
}

static const esp32_mquickjs_future_driver_t s_ble_connect_driver = {
    .capture = ble_connect_capture,
    .start = ble_connect_start,
    .poll = ble_future_poll,
    .finish = ble_connect_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_connect_destroy,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gap_resource_key,
};

static bool ble_connection_operation_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state,
    ble_operation_t operation, uint32_t default_timeout)
{
    esp32_mquickjs_future_driver_state_t *state;
    ble_connection_ref_t *ref = NULL;
    ble_connection_slot_t *slot = ble_connection_from_value(
        ctx, this_ref->val, &ref, true);
    if (out_state == NULL || slot == NULL) return false;
    *out_state = NULL;
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = operation;
    state->adapter_generation = ref->adapter_generation;
    state->connection_index = ref->index;
    state->connection_generation = ref->generation;
    state->timeout_ms = default_timeout;
    atomic_init(&state->completed, false);
    if (argc > 1 ||
        (argc == 1 && !ble_parse_timeout_option(
                          ctx, argv[0].val, "BLE connection operation",
                          &state->timeout_ms))) {
        heap_caps_free(state);
        return false;
    }
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static bool ble_connection_close_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    (void)argv;
    if (argc != 0) {
        JS_ThrowTypeError(ctx, "BLEConnection.close() takes no arguments");
        return false;
    }
    return ble_connection_operation_capture(ctx, this_ref, 0, argv, out_state,
                                            BLE_OP_CONNECTION_CLOSE, 5000);
}

static bool ble_connection_close_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot;
    int rc;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    if (state->connection_index >= s_ble.max_connections) {
        xSemaphoreGiveRecursive(s_ble_connection_mutex);
        return false;
    }
    slot = &s_ble.connections[state->connection_index];
    state->runtime = runtime;
    state->token = token;
    if (!ble_gatt_state_bind(slot, state)) {
        xSemaphoreGiveRecursive(s_ble_connection_mutex);
        return false;
    }
    state->started = true;
    if (!slot->open || slot->generation != state->connection_generation) {
        state->host_code = 0;
        atomic_store_explicit(&state->completed, true, memory_order_release);
        (void)esp32_mquickjs_future_wake(runtime, token);
        ble_native_state_complete(state);
        xSemaphoreGiveRecursive(s_ble_connection_mutex);
        return true;
    }
    ble_active_state_bind(&slot->active_gap_state, state);
    (void)ble_gap_set_event_cb(slot->conn_handle, ble_gap_event_callback, slot);
    rc = ble_gap_terminate(slot->conn_handle, BLE_ERR_REM_USER_CONN_TERM);
    if (rc == BLE_HS_ENOTCONN) {
        slot->open = false;
        rc = 0;
        atomic_store_explicit(&state->completed, true, memory_order_release);
        (void)esp32_mquickjs_future_wake(runtime, token);
    }
    if (rc != 0) {
        ble_active_state_bind(&slot->active_gap_state, NULL);
        ble_native_state_complete(state);
        state->host_code = rc;
        ble_throw_error(ctx, "BLE_DISCONNECTED", rc, -1,
                        state->connection_index, -1);
        xSemaphoreGiveRecursive(s_ble_connection_mutex);
        return false;
    }
    if (atomic_load_explicit(&state->completed, memory_order_acquire))
        ble_native_state_complete(state);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return true;
}

static JSValue ble_connection_close_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot;
    if (state == NULL || state->host_code != 0)
        return ble_bool_finish(ctx, state);
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    slot = state->connection_index < s_ble.max_connections
               ? &s_ble.connections[state->connection_index] : NULL;
    if (slot != NULL && slot->generation == state->connection_generation) {
        /* The native connection is already gone. Its numeric handle may now
         * belong to another connection; never rebind that handle here. */
        ble_active_state_bind(&slot->active_gap_state, NULL);
        ble_native_state_complete(state);
        ble_recycle_connection(slot);
    }
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    ble_retire_handle(ctx, state->owner_ref.val, JS_CLASS_BLE_CONNECTION,
                      &s_ble_closed_connection_ref);
    return JS_TRUE;
}

static const esp32_mquickjs_future_driver_t s_ble_connection_close_driver = {
    .capture = ble_connection_close_capture,
    .start = ble_connection_close_start,
    .poll = ble_future_poll,
    .finish = ble_connection_close_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gatt_resource_key,
};

