99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static bool ble_pair_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    static const char *const allowed[] = {"timeoutMs"};
    if (argc == 1 && (!ble_is_object(ctx, argv[0].val) ||
        !ble_validate_option_keys(ctx, argv[0].val, "BLEConnection.pair()",
                                  allowed, 1))) return false;
    return ble_connection_operation_capture(ctx, this_ref, argc, argv,
                                            out_state, BLE_OP_PAIR,
                                            s_ble.pairing_timeout_ms);
}

static bool ble_pair_start_locked(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
    int rc;
    state->runtime = runtime;
    state->token = token;
    if (!ble_gatt_state_bind(slot, state)) return false;
    state->started = true;
    ble_active_state_bind(&slot->active_gap_state, state);
    (void)ble_gap_set_event_cb(slot->conn_handle, ble_gap_event_callback, slot);
    rc = ble_gap_security_initiate(slot->conn_handle);
    if (rc != 0) {
        (void)ble_gap_set_event_cb(slot->conn_handle, ble_gap_event_callback, NULL);
        ble_active_state_bind(&slot->active_gap_state, NULL);
        ble_native_state_complete(state);
        state->host_code = rc;
        ble_throw_error(ctx, "BLE_SECURITY_ERROR", rc, -1,
                        state->connection_index, -1);
        return false;
    }
    if (atomic_load_explicit(&state->completed, memory_order_acquire))
        ble_native_state_complete(state);
    return true;
}

static bool ble_pair_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    bool result;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    result = ble_pair_start_locked(ctx, runtime, token, state);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return result;
}

static JSValue ble_pair_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
    ble_connection_snapshot_t snapshot;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    if (slot->generation == state->connection_generation) {
        if (slot->open)
            (void)ble_gap_set_event_cb(slot->conn_handle, ble_gap_event_callback, NULL);
        ble_active_state_bind(&slot->active_gap_state, NULL);
    }
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    if (state->host_code != 0)
        return ble_throw_error(ctx, "BLE_SECURITY_ERROR", state->host_code,
                               -1, state->connection_index, -1);
    ble_connection_snapshot(slot, &snapshot);
    return ble_security_to_js(ctx, &snapshot.security, &snapshot.peer);
}

static esp32_mquickjs_resource_key_t ble_gatt_resource_key(
    const esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_future_driver_state_t *mutable_state =
        (esp32_mquickjs_future_driver_state_t *)state;
    if (state == NULL || state->connection_index >= s_ble.max_connections)
        return &s_ble_gap_lane_key;
    if (!mutable_state->gatt_accounted) {
        mutable_state->gatt_accounted = true;
        atomic_fetch_add_explicit(
            &s_ble.connections[state->connection_index].gatt_pending, 1,
            memory_order_relaxed);
    }
    return &s_ble.connections[state->connection_index].gatt_lane_key;
}

static const esp32_mquickjs_future_driver_t s_ble_pair_driver = {
    .capture = ble_pair_capture,
    .start = ble_pair_start,
    .poll = ble_future_poll,
    .finish = ble_pair_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gatt_resource_key,
};

static int ble_exchange_mtu_callback(uint16_t conn_handle,
                                     const struct ble_gatt_error *error,
                                     uint16_t mtu, void *arg)
{
    esp32_mquickjs_future_driver_state_t *state = ble_operation_acquire(arg);
    ble_connection_slot_t *slot = state != NULL
        ? &s_ble.connections[state->connection_index] : NULL;
    (void)conn_handle;
    if (state == NULL) return 0;
    if (state->detached || slot->generation != state->connection_generation) {
        ble_native_state_complete(state);
        ble_gatt_callback_drop(state);
        return BLE_HS_EAPP;
    }
    state->host_code = error != NULL ? error->status : BLE_HS_EUNKNOWN;
    state->mtu = mtu;
    if (slot != NULL && state->host_code == 0) slot->mtu = mtu;
    atomic_store_explicit(&state->completed, true, memory_order_release);
    ble_future_wake_state(state);
    ble_gatt_callback_drop(state);
    return 0;
}

static bool ble_exchange_mtu_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    ble_connection_ref_t *ref = NULL;
    uint32_t raw;
    if (out_state == NULL || argc > 2 ||
        ble_connection_from_value(ctx, this_ref->val, &ref, true) == NULL)
        return false;
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_EXCHANGE_MTU;
    state->adapter_generation = ref->adapter_generation;
    state->connection_index = ref->index;
    state->connection_generation = ref->generation;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    state->mtu = s_ble.preferred_mtu;
    atomic_init(&state->completed, false);
    if (argc >= 1 && !JS_IsUndefined(argv[0].val)) {
        if (!ble_to_u32(ctx, argv[0].val, &raw) || raw < 23 ||
            raw > CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU) {
            JS_ThrowRangeError(ctx, "mtu is outside the compiled range");
            goto fail;
        }
        state->mtu = raw;
    }
    if (argc == 2 && !JS_IsUndefined(argv[1].val)) {
        if (!ble_to_u32(ctx, argv[1].val, &raw) || raw == 0 || raw > 60000) {
            JS_ThrowRangeError(ctx, "timeoutMs must be in 1..60000");
            goto fail;
        }
        state->timeout_ms = raw;
    }
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
fail:
    heap_caps_free(state);
    return false;
}

static bool ble_exchange_mtu_start_locked(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
    int rc;
    state->runtime = runtime;
    state->token = token;
    if (!ble_gatt_state_bind(slot, state)) return false;
    state->started = true;
    rc = ble_att_set_preferred_mtu(state->mtu);
    if (rc == 0)
        rc = ble_gattc_exchange_mtu(slot->conn_handle,
                                    ble_exchange_mtu_callback, (void *)(uintptr_t)state->native_identity);
    if (rc != 0) {
        ble_native_state_complete(state);
        state->host_code = rc;
        ble_throw_error(ctx, "BLE_GATT_ERROR", rc, -1,
                        state->connection_index, -1);
        return false;
    }
    return true;
}

static bool ble_exchange_mtu_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    bool result;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    result = ble_exchange_mtu_start_locked(ctx, runtime, token, state);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return result;
}

static JSValue ble_exchange_mtu_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->host_code != 0)
        return ble_throw_error(ctx, "BLE_GATT_ERROR", state->host_code,
                               -1, state->connection_index, -1);
    return JS_NewUint32(ctx, state->mtu);
}

static const esp32_mquickjs_future_driver_t s_ble_exchange_mtu_driver = {
    .capture = ble_exchange_mtu_capture,
    .start = ble_exchange_mtu_start,
    .poll = ble_future_poll,
    .finish = ble_exchange_mtu_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gatt_resource_key,
};

static bool ble_read_rssi_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    ble_connection_ref_t *ref = NULL;
    uint32_t raw;
    if (out_state == NULL || argc > 1 ||
        ble_connection_from_value(ctx, this_ref->val, &ref, true) == NULL)
        return false;
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_READ_RSSI;
    state->adapter_generation = ref->adapter_generation;
    state->connection_index = ref->index;
    state->connection_generation = ref->generation;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    atomic_init(&state->completed, false);
    if (argc == 1 && !JS_IsUndefined(argv[0].val)) {
        if (!ble_to_u32(ctx, argv[0].val, &raw) || raw == 0 || raw > 60000) {
            JS_ThrowRangeError(ctx, "timeoutMs must be in 1..60000");
            heap_caps_free(state);
            return false;
        }
        state->timeout_ms = raw;
    }
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static bool ble_read_rssi_start_locked(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
    int8_t rssi = 0;
    int rc;
    state->runtime = runtime;
    state->token = token;
    if (!ble_gatt_state_bind(slot, state)) return false;
    state->started = true;
    rc = ble_gap_conn_rssi(slot->conn_handle, &rssi);
    state->host_code = rc;
    state->result_count = rssi;
    if (rc != 0) {
        ble_native_state_complete(state);
        ble_throw_error(ctx, "BLE_DISCONNECTED", rc, -1,
                        state->connection_index, -1);
        return false;
    }
    slot->rssi = rssi;
    slot->rssi_valid = true;
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(runtime, token);
    if (atomic_load_explicit(&state->completed, memory_order_acquire))
        ble_native_state_complete(state);
    return true;
}

static bool ble_read_rssi_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    bool result;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    result = ble_read_rssi_start_locked(ctx, runtime, token, state);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return result;
}

static JSValue ble_read_rssi_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->host_code != 0)
        return ble_throw_error(ctx, "BLE_DISCONNECTED", state->host_code,
                               -1, state->connection_index, -1);
    return JS_NewInt32(ctx, state->result_count);
}

static const esp32_mquickjs_future_driver_t s_ble_read_rssi_driver = {
    .capture = ble_read_rssi_capture,
    .start = ble_read_rssi_start,
    .poll = ble_future_poll,
    .finish = ble_read_rssi_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gatt_resource_key,
};

static void ble_uuid_to_text(const ble_uuid_any_t *uuid,
                             char output[BLE_UUID_TEXT_MAX])
{
    if (ble_uuid_to_str(&uuid->u, output) == NULL) output[0] = '\0';
}

static int ble_discover_descriptor_callback(
    uint16_t conn_handle, const struct ble_gatt_error *error,
    uint16_t chr_val_handle, const struct ble_gatt_dsc *descriptor, void *arg);

static int ble_discover_start_descriptors(
    esp32_mquickjs_future_driver_state_t *state,
    ble_connection_slot_t *slot)
{
    ble_remote_characteristic_t *characteristic;
    ble_remote_service_t *service = NULL;
    uint16_t end_handle;
    uint16_t next_declaration_handle = 0;
    uint16_t service_index;
    if (state->attribute_index >= slot->characteristic_count) return BLE_HS_EDONE;
    characteristic = &slot->characteristics[state->attribute_index];
    for (service_index = 0; service_index < slot->service_count;
         ++service_index) {
        ble_remote_service_t *candidate = &slot->services[service_index];
        if (state->attribute_index >= candidate->first_characteristic &&
            state->attribute_index < candidate->first_characteristic +
                                         candidate->characteristic_count) {
            service = candidate;
            break;
        }
    }
    if (service == NULL) return BLE_HS_EDONE;
    if (state->attribute_index + 1U < slot->characteristic_count) {
        next_declaration_handle =
            slot->characteristics[state->attribute_index + 1U]
                .declaration_handle;
    }
    if (!esp32_mquickjs_wireless_gatt_descriptor_end(
            state->attribute_index, service->first_characteristic,
            service->characteristic_count, service->end_handle,
            next_declaration_handle, &end_handle)) return BLE_HS_EDONE;
    characteristic->first_descriptor = slot->descriptor_count;
    characteristic->descriptor_count = 0;
    if (characteristic->value_handle >= end_handle) return BLE_HS_EDONE;
    return ble_gattc_disc_all_dscs(
        slot->conn_handle, characteristic->value_handle, end_handle,
        ble_discover_descriptor_callback, (void *)(uintptr_t)state->native_identity);
}

static void ble_discover_complete(
    esp32_mquickjs_future_driver_state_t *state, int status)
{
    state->host_code = status == BLE_HS_EDONE ? 0 : status;
    atomic_store_explicit(&state->completed, true, memory_order_release);
    ble_future_wake_state(state);
}

static int ble_discover_descriptor_callback(
    uint16_t conn_handle, const struct ble_gatt_error *error,
    uint16_t chr_val_handle, const struct ble_gatt_dsc *descriptor, void *arg)
{
    esp32_mquickjs_future_driver_state_t *state = ble_operation_acquire(arg);
    ble_connection_slot_t *slot = state != NULL
        ? &s_ble.connections[state->connection_index] : NULL;
    int result = 0;
    (void)conn_handle;
    (void)chr_val_handle;
    if (state == NULL || slot == NULL) return 0;
    if (state->detached || slot->generation != state->connection_generation) {
        ble_native_state_complete(state);
        ble_future_state_drop(state);
        return BLE_HS_EAPP;
    }
    if (error->status == 0 && descriptor != NULL) {
        if (slot->descriptor_count >= state->max_descriptors) {
            ble_discover_complete(state, BLE_HS_ENOMEM);
            result = BLE_HS_ENOMEM;
            goto done;
        }
        slot->descriptors[slot->descriptor_count].uuid = descriptor->uuid;
        slot->descriptors[slot->descriptor_count].handle = descriptor->handle;
        slot->descriptor_count++;
        slot->characteristics[state->attribute_index].descriptor_count++;
        goto done;
    }
    if (error->status == BLE_HS_EDONE) {
        int rc;
        state->attribute_index++;
        while (state->attribute_index < slot->characteristic_count) {
            rc = ble_discover_start_descriptors(state, slot);
            if (rc == 0) goto done;
            if (rc != BLE_HS_EDONE) {
                ble_discover_complete(state, rc);
                result = rc;
                goto done;
            }
            state->attribute_index++;
        }
        ble_discover_complete(state, 0);
        goto done;
    }
    ble_discover_complete(state, error->status);
done:
    ble_gatt_callback_drop(state);
    return result;
}

static int ble_discover_characteristic_callback(
    uint16_t conn_handle, const struct ble_gatt_error *error,
    const struct ble_gatt_chr *characteristic, void *arg)
{
    esp32_mquickjs_future_driver_state_t *state = ble_operation_acquire(arg);
    ble_connection_slot_t *slot = state != NULL
        ? &s_ble.connections[state->connection_index] : NULL;
    int result = 0;
    (void)conn_handle;
    if (state == NULL || slot == NULL) return 0;
    if (state->detached || slot->generation != state->connection_generation) {
        ble_native_state_complete(state);
        ble_gatt_callback_drop(state);
        return BLE_HS_EAPP;
    }
    if (error->status == 0 && characteristic != NULL) {
        ble_remote_service_t *service =
            &slot->services[state->discover_service_index];
        ble_remote_characteristic_t *target;
        if (slot->characteristic_count >= state->max_characteristics) {
            ble_discover_complete(state, BLE_HS_ENOMEM);
            result = BLE_HS_ENOMEM;
            goto done;
        }
        target = &slot->characteristics[slot->characteristic_count++];
        target->uuid = characteristic->uuid;
        target->declaration_handle = characteristic->def_handle;
        target->value_handle = characteristic->val_handle;
        target->properties = characteristic->properties;
        service->characteristic_count++;
        goto done;
    }
    if (error->status == BLE_HS_EDONE) {
        int rc;
        state->discover_service_index++;
        while (state->discover_service_index < slot->service_count) {
            ble_remote_service_t *service =
                &slot->services[state->discover_service_index];
            service->first_characteristic = slot->characteristic_count;
            rc = ble_gattc_disc_all_chrs(
                slot->conn_handle, service->start_handle, service->end_handle,
                ble_discover_characteristic_callback, (void *)(uintptr_t)state->native_identity);
            if (rc == 0) goto done;
            if (rc != BLE_HS_EDONE) {
                ble_discover_complete(state, rc);
                result = rc;
                goto done;
            }
            state->discover_service_index++;
        }
        if (!state->include_descriptors || slot->characteristic_count == 0) {
            ble_discover_complete(state, 0);
            goto done;
        }
        state->attribute_index = 0;
        rc = ble_discover_start_descriptors(state, slot);
        if (rc == BLE_HS_EDONE) {
            state->attribute_index++;
            while (state->attribute_index < slot->characteristic_count &&
                   (rc = ble_discover_start_descriptors(state, slot)) == BLE_HS_EDONE)
                state->attribute_index++;
        }
        if (rc != 0) ble_discover_complete(state, rc == BLE_HS_EDONE ? 0 : rc);
        goto done;
    }
    ble_discover_complete(state, error->status);
done:
    ble_gatt_callback_drop(state);
    return result;
}

static int ble_discover_service_callback(
    uint16_t conn_handle, const struct ble_gatt_error *error,
    const struct ble_gatt_svc *service, void *arg)
{
    esp32_mquickjs_future_driver_state_t *state = ble_operation_acquire(arg);
    ble_connection_slot_t *slot = state != NULL
        ? &s_ble.connections[state->connection_index] : NULL;
    (void)conn_handle;
    if (state == NULL || slot == NULL) return 0;
    if (state->detached || slot->generation != state->connection_generation) {
        ble_native_state_complete(state);
        ble_gatt_callback_drop(state);
        return BLE_HS_EAPP;
    }
    if (error->status == 0 && service != NULL) {
        ble_remote_service_t *target;
        if (slot->service_count >= state->max_services) {
            ble_discover_complete(state, BLE_HS_ENOMEM);
            ble_gatt_callback_drop(state);
            return BLE_HS_ENOMEM;
        }
        target = &slot->services[slot->service_count++];
        target->uuid = service->uuid;
        target->start_handle = service->start_handle;
        target->end_handle = service->end_handle;
        ble_gatt_callback_drop(state);
        return 0;
    }
    if (error->status == BLE_HS_EDONE) {
        if (slot->service_count == 0) {
            ble_discover_complete(state, 0);
            ble_gatt_callback_drop(state);
            return 0;
        }
        state->discover_service_index = 0;
        slot->services[0].first_characteristic = 0;
        state->host_code = ble_gattc_disc_all_chrs(
            slot->conn_handle, slot->services[0].start_handle,
            slot->services[0].end_handle,
            ble_discover_characteristic_callback, (void *)(uintptr_t)state->native_identity);
        if (state->host_code != 0)
            ble_discover_complete(state, state->host_code);
        ble_gatt_callback_drop(state);
        return 0;
    }
    ble_discover_complete(state, error->status);
    ble_gatt_callback_drop(state);
    return 0;
}

