99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static bool ble_discover_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    static const char *const allowed[] = {
        "includeDescriptors", "maxServices", "maxCharacteristics",
        "maxDescriptors", "timeoutMs",
    };
    esp32_mquickjs_future_driver_state_t *state;
    ble_connection_ref_t *ref = NULL;
    ble_connection_slot_t *slot;
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    JSValue options = argc == 1 ? argv[0].val : JS_UNDEFINED;
    uint32_t raw;
    if (out_state == NULL || argc > 1 ||
        (slot = ble_connection_from_value(ctx, this_ref->val, &ref, true)) == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (!JS_IsUndefined(options) &&
        (!ble_is_object(ctx, options) ||
         !ble_validate_option_keys(ctx, options, "BLEConnection.discover()",
                                   allowed, 5))) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (atomic_load(&slot->active_gatt_state) != NULL ||
        atomic_load(&slot->gatt_pending) != 0) {
        JS_PopGCRef(ctx, &property_ref);
        ble_throw_error(ctx, "BLE_BUSY", BLE_HS_EBUSY, -1, ref->index, -1);
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_DISCOVER;
    state->adapter_generation = ref->adapter_generation;
    state->connection_index = ref->index;
    state->connection_generation = ref->generation;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    state->max_services = CONFIG_ESP32_MQUICKJS_BLE_MAX_SERVICES;
    state->max_characteristics = CONFIG_ESP32_MQUICKJS_BLE_MAX_CHARACTERISTICS;
    state->max_descriptors = CONFIG_ESP32_MQUICKJS_BLE_MAX_DESCRIPTORS;
    atomic_init(&state->completed, false);
    if (!JS_IsUndefined(options)) {
        if (!ble_get_bool(ctx, options, "includeDescriptors", false,
                          &state->include_descriptors) ||
            !ble_parse_timeout_option(ctx, options, "discover",
                                      &state->timeout_ms)) goto fail;
#define BLE_PARSE_DISCOVERY_LIMIT(name, field, maximum)                         \
        *property = JS_GetPropertyStr(ctx, options, name);                      \
        if (JS_IsException(*property)) goto fail;                               \
        if (!JS_IsUndefined(*property)) {                                       \
            if (!ble_to_u32(ctx, *property, &raw) || raw == 0 ||                \
                raw > (maximum)) {                                              \
                JS_ThrowRangeError(ctx, name " exceeds the compiled limit");   \
                goto fail;                                                      \
            }                                                                   \
            state->field = raw;                                                 \
        }
        BLE_PARSE_DISCOVERY_LIMIT("maxServices", max_services,
                                  CONFIG_ESP32_MQUICKJS_BLE_MAX_SERVICES)
        BLE_PARSE_DISCOVERY_LIMIT("maxCharacteristics", max_characteristics,
                                  CONFIG_ESP32_MQUICKJS_BLE_MAX_CHARACTERISTICS)
        BLE_PARSE_DISCOVERY_LIMIT("maxDescriptors", max_descriptors,
                                  CONFIG_ESP32_MQUICKJS_BLE_MAX_DESCRIPTORS)
#undef BLE_PARSE_DISCOVERY_LIMIT
    }
    ble_clear_remote_discovery(slot);
    slot->services = heap_caps_calloc(state->max_services,
                                      sizeof(*slot->services), MALLOC_CAP_8BIT);
    slot->characteristics = heap_caps_calloc(
        state->max_characteristics, sizeof(*slot->characteristics), MALLOC_CAP_8BIT);
    if (state->include_descriptors)
        slot->descriptors = heap_caps_calloc(state->max_descriptors,
                                             sizeof(*slot->descriptors), MALLOC_CAP_8BIT);
    if (slot->services == NULL || slot->characteristics == NULL ||
        (state->include_descriptors && slot->descriptors == NULL)) {
        JS_ThrowOutOfMemory(ctx);
        ble_clear_remote_discovery(slot);
        goto fail;
    }
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    JS_PopGCRef(ctx, &property_ref);
    return true;
fail:
    heap_caps_free(state);
    JS_PopGCRef(ctx, &property_ref);
    return false;
}

static bool ble_discover_start_locked(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
    int rc;
    state->runtime = runtime;
    state->token = token;
    if (!ble_gatt_state_bind(slot, state)) return false;
    state->started = true;
    rc = ble_gattc_disc_all_svcs(slot->conn_handle,
                                 ble_discover_service_callback, (void *)(uintptr_t)state->native_identity);
    if (rc != 0) {
        ble_native_state_complete(state);
        state->host_code = rc;
        ble_throw_error(ctx, "BLE_GATT_ERROR", rc, -1,
                        state->connection_index, -1);
        return false;
    }
    return true;
}

static bool ble_discover_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    bool result;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    result = ble_discover_start_locked(ctx, runtime, token, state);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return result;
}

static int ble_service_index_for_characteristic(
    const ble_connection_slot_t *slot, uint16_t characteristic_index)
{
    uint16_t index;

    for (index = 0; index < slot->service_count; ++index) {
        const ble_remote_service_t *service = &slot->services[index];

        if (characteristic_index >= service->first_characteristic &&
            characteristic_index <
                service->first_characteristic + service->characteristic_count) {
            return index;
        }
    }
    return -1;
}

static int ble_characteristic_index_for_descriptor(
    const ble_connection_slot_t *slot, uint16_t descriptor_index)
{
    uint16_t index;

    for (index = 0; index < slot->characteristic_count; ++index) {
        const ble_remote_characteristic_t *characteristic =
            &slot->characteristics[index];

        if (descriptor_index >= characteristic->first_descriptor &&
            descriptor_index < characteristic->first_descriptor +
                                   characteristic->descriptor_count) {
            return index;
        }
    }
    return -1;
}

static JSValue ble_discovery_service_record(JSContext *ctx,
                                            ble_connection_slot_t *slot,
                                            uint16_t index)
{
    ble_remote_service_t *service = &slot->services[index];
    char uuid[BLE_UUID_TEXT_MAX];
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    *object = JS_NewObject(ctx);
    ble_uuid_to_text(&service->uuid, uuid);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "uuid",
                                         JS_NewString(ctx, uuid)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "startHandle",
            JS_NewUint32(ctx, service->start_handle)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "endHandle", JS_NewUint32(ctx, service->end_handle)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "characteristicStart",
            JS_NewUint32(ctx, service->first_characteristic)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "characteristicCount",
            JS_NewUint32(ctx, service->characteristic_count))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

static JSValue ble_discovery_characteristic_record(
    JSContext *ctx, ble_connection_slot_t *slot, uint16_t index)
{
    ble_remote_characteristic_t *characteristic =
        &slot->characteristics[index];
    char uuid[BLE_UUID_TEXT_MAX];
    int service_index = ble_service_index_for_characteristic(slot, index);
    JSGCRef object_ref, properties_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *properties = JS_PushGCRef(ctx, &properties_ref);

    *object = JS_NewObject(ctx);
    *properties = ble_properties_to_js(ctx, characteristic->properties);
    ble_uuid_to_text(&characteristic->uuid, uuid);
    if (JS_IsException(*object) || JS_IsException(*properties) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "uuid",
                                         JS_NewString(ctx, uuid)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "declarationHandle",
            JS_NewUint32(ctx, characteristic->declaration_handle)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "valueHandle",
            JS_NewUint32(ctx, characteristic->value_handle)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "properties",
                                         *properties) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "serviceIndex", JS_NewInt32(ctx, service_index)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "descriptorStart",
            JS_NewUint32(ctx, characteristic->first_descriptor)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "descriptorCount",
            JS_NewUint32(ctx, characteristic->descriptor_count))) {
        JS_PopGCRef(ctx, &properties_ref);
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    JS_PopGCRef(ctx, &properties_ref);
    return JS_PopGCRef(ctx, &object_ref);
}

static JSValue ble_discovery_descriptor_record(JSContext *ctx,
                                               ble_connection_slot_t *slot,
                                               uint16_t index)
{
    ble_remote_descriptor_t *descriptor = &slot->descriptors[index];
    char uuid[BLE_UUID_TEXT_MAX];
    int characteristic_index =
        ble_characteristic_index_for_descriptor(slot, index);
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);

    *object = JS_NewObject(ctx);
    ble_uuid_to_text(&descriptor->uuid, uuid);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "uuid",
                                         JS_NewString(ctx, uuid)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "handle", JS_NewUint32(ctx, descriptor->handle)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, object, "characteristicIndex",
            JS_NewInt32(ctx, characteristic_index))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

