99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static JSValue ble_discover_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
    JSGCRef result_ref, services_ref, characteristics_ref, descriptors_ref,
        item_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *services = JS_PushGCRef(ctx, &services_ref);
    JSValue *characteristics = JS_PushGCRef(ctx, &characteristics_ref);
    JSValue *descriptors = JS_PushGCRef(ctx, &descriptors_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    uint16_t index;
    if (state->host_code != 0) {
        JS_PopGCRef(ctx, &item_ref);
        JS_PopGCRef(ctx, &descriptors_ref);
        JS_PopGCRef(ctx, &characteristics_ref);
        JS_PopGCRef(ctx, &services_ref);
        JS_PopGCRef(ctx, &result_ref);
        return ble_throw_error(ctx,
            state->host_code == BLE_HS_ENOMEM ? "BLE_SERVER_LIMIT"
                                               : "BLE_GATT_ERROR",
            state->host_code, -1, state->connection_index, -1);
    }
    *result = JS_NewObject(ctx);
    *services = JS_NewArray(ctx, slot->service_count);
    *characteristics = JS_NewArray(ctx, slot->characteristic_count);
    *descriptors = JS_NewArray(ctx, slot->descriptor_count);
    for (index = 0; !JS_IsException(*services) &&
                    index < slot->service_count; ++index) {
        *item = ble_discovery_service_record(ctx, slot, index);
        if (JS_IsException(*item) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *services, index, *item)))
            *services = JS_EXCEPTION;
    }
    for (index = 0; !JS_IsException(*characteristics) &&
                    index < slot->characteristic_count; ++index) {
        *item = ble_discovery_characteristic_record(ctx, slot, index);
        if (JS_IsException(*item) || JS_IsException(JS_SetPropertyUint32(
                ctx, *characteristics, index, *item)))
            *characteristics = JS_EXCEPTION;
    }
    for (index = 0; !JS_IsException(*descriptors) &&
                    index < slot->descriptor_count; ++index) {
        *item = ble_discovery_descriptor_record(ctx, slot, index);
        if (JS_IsException(*item) || JS_IsException(JS_SetPropertyUint32(
                ctx, *descriptors, index, *item)))
            *descriptors = JS_EXCEPTION;
    }
    if (JS_IsException(*result) || JS_IsException(*services) ||
        JS_IsException(*characteristics) || JS_IsException(*descriptors) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "generation",
            JS_NewUint32(ctx, slot->discovery_generation)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "services", *services) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "characteristics",
                                         *characteristics) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "descriptors",
                                         *descriptors)) {
        *result = JS_EXCEPTION;
    }
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &descriptors_ref);
    JS_PopGCRef(ctx, &characteristics_ref);
    JS_PopGCRef(ctx, &services_ref);
    return JS_PopGCRef(ctx, &result_ref);
}

static const esp32_mquickjs_future_driver_t s_ble_discover_driver = {
    .capture = ble_discover_capture,
    .start = ble_discover_start,
    .poll = ble_future_poll,
    .finish = ble_discover_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gatt_resource_key,
};

static bool ble_remote_attribute_exists(const ble_connection_slot_t *slot,
                                        uint16_t handle,
                                        uint16_t *out_index)
{
    uint16_t index;

    if (handle == 0) return false;
    for (index = 0; index < slot->characteristic_count; ++index) {
        if (slot->characteristics[index].value_handle == handle) {
            if (out_index != NULL) *out_index = index;
            return true;
        }
    }
    for (index = 0; index < slot->descriptor_count; ++index) {
        if (slot->descriptors[index].handle == handle) {
            if (out_index != NULL) *out_index = index;
            return true;
        }
    }
    return false;
}

static bool ble_gatt_read_handle_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    static const char *const allowed[] = {"timeoutMs", "maxBytes"};
    esp32_mquickjs_future_driver_state_t *state;
    ble_connection_ref_t *ref = NULL;
    ble_connection_slot_t *slot;
    JSValue options = argc == 2 ? argv[1].val : JS_UNDEFINED;
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    uint32_t raw_handle = 0;
    uint32_t raw;

    if (out_state == NULL || argc < 1 || argc > 2 ||
        (slot = ble_connection_from_value(ctx, this_ref->val, &ref, true)) ==
            NULL ||
        !ble_to_u32(ctx, argv[0].val, &raw_handle) || raw_handle > UINT16_MAX ||
        !ble_remote_attribute_exists(slot, (uint16_t)raw_handle, NULL)) {
        if (!JS_HasException(ctx))
            ble_throw_error(ctx, "BLE_STALE_ATTRIBUTE", BLE_HS_EINVAL, -1,
                            ref != NULL ? ref->index : -1,
                            raw_handle <= UINT16_MAX ? (int)raw_handle : -1);
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (!JS_IsUndefined(options) &&
        (!ble_is_object(ctx, options) ||
         !ble_validate_option_keys(ctx, options,
                                   "BLEConnection.readHandle()", allowed, 2))) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_GATT_READ;
    state->adapter_generation = ref->adapter_generation;
    state->connection_index = ref->index;
    state->connection_generation = ref->generation;
    state->attribute_handle = (uint16_t)raw_handle;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    state->max_bytes = CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES;
    atomic_init(&state->completed, false);
    if (!JS_IsUndefined(options)) {
        if (!ble_parse_timeout_option(ctx, options, "GATT read",
                                      &state->timeout_ms))
            goto fail;
        *property = JS_GetPropertyStr(ctx, options, "maxBytes");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            if (!ble_to_u32(ctx, *property, &raw) || raw == 0 ||
                raw > CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES) {
                JS_ThrowRangeError(ctx, "maxBytes exceeds the compiled limit");
                goto fail;
            }
            state->max_bytes = raw;
        }
    }
    state->payload = heap_caps_malloc(state->max_bytes, MALLOC_CAP_8BIT);
    if (state->payload == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    JS_PopGCRef(ctx, &property_ref);
    return true;
fail:
    heap_caps_free(state->payload);
    heap_caps_free(state);
    JS_PopGCRef(ctx, &property_ref);
    return false;
}

static int ble_gatt_attr_callback(uint16_t conn_handle,
                                  const struct ble_gatt_error *error,
                                  struct ble_gatt_attr *attribute, void *arg)
{
    esp32_mquickjs_future_driver_state_t *state = ble_operation_acquire(arg);
    ble_connection_slot_t *slot = state != NULL
        ? &s_ble.connections[state->connection_index] : NULL;
    uint16_t length = 0;
    (void)conn_handle;
    if (state == NULL) return 0;
    if (state->detached || slot->generation != state->connection_generation) {
        ble_native_state_complete(state);
        ble_gatt_callback_drop(state);
        return BLE_HS_EAPP;
    }
    state->host_code = error != NULL ? error->status : BLE_HS_EUNKNOWN;
    state->att_code = error != NULL ? error->att_handle : 0;
    if (state->host_code == 0 && state->operation == BLE_OP_GATT_READ &&
        attribute != NULL && attribute->om != NULL) {
        length = OS_MBUF_PKTLEN(attribute->om);
        if (length > state->max_bytes) {
            state->host_code = BLE_HS_EMSGSIZE;
        } else if (os_mbuf_copydata(attribute->om, 0, length,
                                    state->payload) != 0) {
            state->host_code = BLE_HS_EUNKNOWN;
        } else {
            state->payload_length = length;
        }
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
    ble_future_wake_state(state);
    ble_gatt_callback_drop(state);
    return 0;
}

static bool ble_gatt_read_start_locked(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
    int rc;
    state->runtime = runtime;
    state->token = token;
    if (!ble_gatt_state_bind(slot, state)) return false;
    state->started = true;
    rc = ble_gattc_read(slot->conn_handle, state->attribute_handle,
                        ble_gatt_attr_callback, (void *)(uintptr_t)state->native_identity);
    if (rc != 0) {
        ble_native_state_complete(state);
        state->host_code = rc;
        ble_throw_error(ctx, "BLE_GATT_ERROR", rc, -1,
                        state->connection_index, state->attribute_handle);
        return false;
    }
    return true;
}

static bool ble_gatt_read_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    bool result;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    result = ble_gatt_read_start_locked(ctx, runtime, token, state);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return result;
}

static JSValue ble_gatt_read_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    uint8_t *payload;
    JSValue result;
    if (state->host_code != 0) {
        return ble_throw_error(ctx,
            state->host_code == BLE_HS_EMSGSIZE ? "BLE_PAYLOAD_TOO_LARGE"
                                                : "BLE_GATT_ERROR",
            state->host_code, state->att_code, state->connection_index,
            state->attribute_handle);
    }
    payload = state->payload;
    state->payload = NULL;
    result = esp32_mquickjs_new_owned_byte_view(ctx, payload,
                                                state->payload_length);
    if (JS_IsException(result)) heap_caps_free(payload);
    return result;
}

static bool ble_gatt_write_handle_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    static const char *const allowed[] = {"response", "timeoutMs"};
    esp32_mquickjs_future_driver_state_t *state;
    ble_connection_ref_t *ref = NULL;
    ble_connection_slot_t *slot;
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue error = JS_UNDEFINED;
    JSValue options = argc == 3 ? argv[2].val : JS_UNDEFINED;
    uint32_t raw_handle = 0;

