99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
    if (out_state == NULL || argc < 2 || argc > 3 ||
        (slot = ble_connection_from_value(ctx, this_ref->val, &ref, true)) ==
            NULL ||
        !ble_to_u32(ctx, argv[0].val, &raw_handle) || raw_handle > UINT16_MAX ||
        !ble_remote_attribute_exists(slot, (uint16_t)raw_handle, NULL)) {
        if (!JS_HasException(ctx))
            ble_throw_error(ctx, "BLE_STALE_ATTRIBUTE", BLE_HS_EINVAL, -1,
                            ref != NULL ? ref->index : -1,
                            raw_handle <= UINT16_MAX ? (int)raw_handle : -1);
        return false;
    }
    if (!JS_IsUndefined(options) &&
        (!ble_is_object(ctx, options) ||
         !ble_validate_option_keys(ctx, options,
                                   "BLEConnection.writeHandle()", allowed,
                                   2)))
        return false;
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_GATT_WRITE;
    state->adapter_generation = ref->adapter_generation;
    state->connection_index = ref->index;
    state->connection_generation = ref->generation;
    state->attribute_handle = (uint16_t)raw_handle;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    state->response = true;
    atomic_init(&state->completed, false);
    if (!JS_IsUndefined(options) &&
        (!ble_get_bool(ctx, options, "response", true, &state->response) ||
         !ble_parse_timeout_option(ctx, options, "GATT write",
                                   &state->timeout_ms)))
        goto fail;
    if (!esp32_mquickjs_get_byte_source(ctx, argv[1].val,
                                        "BLEConnection.writeHandle()",
                                        &source, &owned, &error))
        goto fail;
    if (source.length > CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES) {
        esp32_mquickjs_release_byte_source(owned);
        owned = NULL;
        ble_throw_error(ctx, "BLE_PAYLOAD_TOO_LARGE", BLE_HS_EMSGSIZE, -1,
                        state->connection_index, state->attribute_handle);
        goto fail;
    }
    state->payload = heap_caps_malloc(source.length > 0 ? source.length : 1,
                                      MALLOC_CAP_8BIT);
    if (state->payload == NULL) {
        esp32_mquickjs_release_byte_source(owned);
        owned = NULL;
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    state->payload_length = source.length;
    if (source.length > 0)
        memcpy(state->payload, source.data, source.length);
    esp32_mquickjs_release_byte_source(owned);
    owned = NULL;
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
fail:
    esp32_mquickjs_release_byte_source(owned);
    heap_caps_free(state->payload);
    heap_caps_free(state);
    return false;
}

static bool ble_gatt_write_start_locked(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
    int rc;
    state->runtime = runtime;
    state->token = token;
    if (!ble_gatt_state_bind(slot, state)) return false;
    state->started = true;
    if (state->response) {
        rc = ble_gattc_write_flat(slot->conn_handle, state->attribute_handle,
                                  state->payload, state->payload_length,
                                  ble_gatt_attr_callback, (void *)(uintptr_t)state->native_identity);
    } else {
        rc = ble_gattc_write_no_rsp_flat(slot->conn_handle,
                                         state->attribute_handle,
                                         state->payload,
                                         state->payload_length);
        if (rc == 0) {
            state->host_code = 0;
            atomic_store_explicit(&state->completed, true, memory_order_release);
            (void)esp32_mquickjs_future_wake(runtime, token);
        }
    }
    if (rc != 0) {
        ble_native_state_complete(state);
        ble_native_state_complete(state);
        state->host_code = rc;
        ble_throw_error(ctx, "BLE_GATT_ERROR", rc, -1,
                        state->connection_index, state->attribute_handle);
        return false;
    }
    if (atomic_load_explicit(&state->completed, memory_order_acquire))
        ble_native_state_complete(state);
    return true;
}

static bool ble_gatt_write_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    bool result;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    result = ble_gatt_write_start_locked(ctx, runtime, token, state);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return result;
}

static JSValue ble_gatt_write_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->host_code != 0)
        return ble_throw_error(ctx, "BLE_GATT_ERROR", state->host_code,
                               state->att_code, state->connection_index,
                               state->attribute_handle);
    return JS_NewInt64(ctx, state->payload_length);
}

static const esp32_mquickjs_future_driver_t s_ble_gatt_read_driver = {
    .capture = ble_gatt_read_handle_capture,
    .start = ble_gatt_read_start,
    .poll = ble_future_poll,
    .finish = ble_gatt_read_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gatt_resource_key,
};

static const esp32_mquickjs_future_driver_t s_ble_gatt_write_driver = {
    .capture = ble_gatt_write_handle_capture,
    .start = ble_gatt_write_start,
    .poll = ble_future_poll,
    .finish = ble_gatt_write_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gatt_resource_key,
};

static uint16_t ble_find_cccd(ble_connection_slot_t *slot,
                              ble_remote_characteristic_t *characteristic)
{
    uint16_t offset;
    for (offset = 0; offset < characteristic->descriptor_count; ++offset) {
        ble_remote_descriptor_t *descriptor =
            &slot->descriptors[characteristic->first_descriptor + offset];
        if (ble_uuid_u16(&descriptor->uuid.u) == BLE_GATT_DSC_CLT_CFG_UUID16)
            return descriptor->handle;
    }
    return characteristic->value_handle + 1U;
}

static bool ble_subscribe_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    static const char *const allowed[] = {"mode", "capacity", "timeoutMs"};
    esp32_mquickjs_future_driver_state_t *state;
    ble_connection_ref_t *ref = NULL;
    ble_connection_slot_t *slot;
    ble_remote_characteristic_t *characteristic;
    ble_subscription_t *subscription = NULL;
    JSValue options = argc == 3 ? argv[2].val : JS_UNDEFINED;
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    uint32_t capacity = CONFIG_ESP32_MQUICKJS_BLE_NOTIFICATION_QUEUE_LEN;
    uint32_t raw;
    uint32_t raw_value_handle = 0;
    uint32_t raw_cccd_handle = 0;
    uint16_t index;
    uint16_t characteristic_index = UINT16_MAX;
    bool indication;
    JSValue queue;

