99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
    if (out_state == NULL || argc < 2 || argc > 3 ||
        (slot = ble_connection_from_value(ctx, this_ref->val, &ref, true)) ==
            NULL ||
        !ble_to_u32(ctx, argv[0].val, &raw_value_handle) ||
        raw_value_handle == 0 || raw_value_handle > UINT16_MAX ||
        !ble_to_u32(ctx, argv[1].val, &raw_cccd_handle) ||
        raw_cccd_handle == 0 || raw_cccd_handle > UINT16_MAX) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    for (index = 0; index < slot->characteristic_count; ++index) {
        if (slot->characteristics[index].value_handle == raw_value_handle) {
            characteristic_index = index;
            break;
        }
    }
    characteristic = characteristic_index < slot->characteristic_count
                         ? &slot->characteristics[characteristic_index]
                         : NULL;
    if (characteristic == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        ble_throw_error(ctx, "BLE_STALE_ATTRIBUTE", BLE_HS_EINVAL, -1,
                        ref->index, (int)raw_value_handle);
        return false;
    }
    if ((uint16_t)raw_cccd_handle != ble_find_cccd(slot, characteristic)) {
        JS_PopGCRef(ctx, &property_ref);
        ble_throw_error(ctx, "BLE_STALE_ATTRIBUTE", BLE_HS_EINVAL, -1,
                        ref->index, (int)raw_cccd_handle);
        return false;
    }
    indication = (characteristic->properties & BLE_GATT_CHR_PROP_NOTIFY) == 0 &&
                 (characteristic->properties & BLE_GATT_CHR_PROP_INDICATE) != 0;
    if ((characteristic->properties & (BLE_GATT_CHR_PROP_NOTIFY |
                                       BLE_GATT_CHR_PROP_INDICATE)) == 0) {
        JS_PopGCRef(ctx, &property_ref);
        ble_throw_error(ctx, "BLE_NOT_SUPPORTED", BLE_HS_ENOTSUP, -1,
                        ref->index, characteristic->value_handle);
        return false;
    }
    if (!JS_IsUndefined(options)) {
        if (!ble_is_object(ctx, options) ||
            !ble_validate_option_keys(ctx, options, "subscribe", allowed, 3)) {
            JS_PopGCRef(ctx, &property_ref);
            return false;
        }
        *property = JS_GetPropertyStr(ctx, options, "mode");
        if (JS_IsException(*property)) goto fail_early;
        if (!JS_IsUndefined(*property)) {
            if (ble_string_equals(ctx, *property, "notify")) indication = false;
            else if (ble_string_equals(ctx, *property, "indicate")) indication = true;
            else if (!ble_string_equals(ctx, *property, "auto")) {
                JS_ThrowTypeError(ctx, "subscription mode must be notify, indicate, or auto");
                goto fail_early;
            }
        }
        if ((!indication && !(characteristic->properties & BLE_GATT_CHR_PROP_NOTIFY)) ||
            (indication && !(characteristic->properties & BLE_GATT_CHR_PROP_INDICATE))) {
            ble_throw_error(ctx, "BLE_NOT_SUPPORTED", BLE_HS_ENOTSUP, -1,
                            ref->index, characteristic->value_handle);
            goto fail_early;
        }
        *property = JS_GetPropertyStr(ctx, options, "capacity");
        if (JS_IsException(*property)) goto fail_early;
        if (!JS_IsUndefined(*property)) {
            if (!ble_to_u32(ctx, *property, &raw) || raw == 0 || raw > 32) {
                JS_ThrowRangeError(ctx, "subscription capacity must be in 1..32");
                goto fail_early;
            }
            capacity = raw;
        }
    }
    for (index = 0; index < BLE_MAX_SUBSCRIPTIONS; ++index) {
        if (!slot->subscriptions[index].allocated) {
            subscription = &slot->subscriptions[index];
            break;
        }
    }
    if (subscription == NULL) {
        ble_throw_error(ctx, "BLE_QUEUE_FULL", BLE_HS_ENOMEM, -1,
                        ref->index, characteristic->value_handle);
        goto fail_early;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail_early;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_SUBSCRIBE;
    state->adapter_generation = ref->adapter_generation;
    state->connection_index = ref->index;
    state->connection_generation = ref->generation;
    state->attribute_index = characteristic_index;
    state->attribute_handle = characteristic->value_handle;
    state->cccd_handle = (uint16_t)raw_cccd_handle;
    state->subscription_index = index;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    state->indication = indication;
    state->payload_length = 2;
    state->payload = heap_caps_calloc(1, 2, MALLOC_CAP_8BIT);
    atomic_init(&state->completed, false);
    if (state->payload == NULL) {
        JS_ThrowOutOfMemory(ctx);
        heap_caps_free(state);
        goto fail_early;
    }
    if (!JS_IsUndefined(options) &&
        !ble_parse_timeout_option(ctx, options, "subscribe", &state->timeout_ms))
        goto fail_state;
    state->payload[0] = indication ? 2U : 1U;
    memset(subscription, 0, sizeof(*subscription));
    subscription->allocated = true;
    subscription->generation = ble_next_generation(&s_ble_next_subscription_generation);
    subscription->value_handle = characteristic->value_handle;
    subscription->cccd_handle = state->cccd_handle;
    subscription->indication = indication;
    subscription->capacity = capacity;
    subscription->payloads = heap_caps_calloc(
        capacity, CONFIG_ESP32_MQUICKJS_BLE_MAX_ATTRIBUTE_BYTES,
        MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
    subscription->lengths = heap_caps_calloc(capacity, sizeof(uint16_t),
                                              MALLOC_CAP_8BIT);
    atomic_init(&subscription->sequence, 0);
    atomic_init(&subscription->received, 0);
    atomic_init(&subscription->dropped, 0);
    if (!esp32_mquickjs_native_pool_init(&subscription->free_slots,
                                            capacity) ||
        subscription->payloads == NULL ||
        subscription->lengths == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail_subscription;
    }
    queue = esp32_mquickjs_event_queue_new(
        ctx, s_ble.runtime, sizeof(ble_notification_event_t), capacity,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST,
        ble_notification_event_to_js, ble_notification_event_drop,
        NULL, subscription);
    if (JS_IsException(queue)) goto fail_subscription;
    *JS_AddGCRef(ctx, &subscription->queue_ref) = queue;
    subscription->queue_rooted = true;
    subscription->queue = esp32_mquickjs_event_queue_from_value(ctx, queue);
    if (subscription->queue == NULL) goto fail_subscription;
    state->subscription_generation = subscription->generation;
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    JS_PopGCRef(ctx, &property_ref);
    return true;
fail_subscription:
    ble_release_event_queue(ctx, &subscription->queue,
                            &subscription->queue_ref,
                            &subscription->queue_rooted);
    heap_caps_free(subscription->payloads);
    heap_caps_free(subscription->lengths);
    memset(subscription, 0, sizeof(*subscription));
fail_state:
    heap_caps_free(state->payload);
    heap_caps_free(state);
fail_early:
    JS_PopGCRef(ctx, &property_ref);
    return false;
}

