99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static bool ble_subscribe_start_locked(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
    int rc;
    state->runtime = runtime;
    state->token = token;
    if (!ble_gatt_state_bind(slot, state)) return false;
    state->started = true;
    rc = ble_gattc_write_flat(slot->conn_handle, state->cccd_handle,
                              state->payload, state->payload_length,
                              ble_gatt_attr_callback, (void *)(uintptr_t)state->native_identity);
    if (rc != 0) {
        ble_native_state_complete(state);
        state->host_code = rc;
        ble_throw_error(ctx, "BLE_GATT_ERROR", rc, -1,
                        state->connection_index, state->cccd_handle);
        return false;
    }
    return true;
}

static bool ble_subscribe_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    bool result;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    result = ble_subscribe_start_locked(ctx, runtime, token, state);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return result;
}

static JSValue ble_subscribe_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    ble_connection_slot_t *slot = &s_ble.connections[state->connection_index];
    ble_subscription_t *subscription =
        &slot->subscriptions[state->subscription_index];
    ble_subscription_ref_t *ref;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    if (state->host_code != 0) {
        JS_PopGCRef(ctx, &object_ref);
        return ble_throw_error(ctx, "BLE_GATT_ERROR", state->host_code,
                               state->att_code, state->connection_index,
                               state->cccd_handle);
    }
    subscription->open = true;
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_BLE_NOTIFICATION_STREAM);
    if (JS_IsException(*object)) goto fail;
    ref = heap_caps_calloc(1, sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    ref->adapter_generation = s_ble.generation;
    ref->connection_index = state->connection_index;
    ref->connection_generation = state->connection_generation;
    ref->subscription_index = state->subscription_index;
    ref->subscription_generation = subscription->generation;
    JS_SetOpaque(ctx, *object, ref);
    if (!esp32_mquickjs_set_property_ref(ctx, object, "_eventQueue",
                                         subscription->queue_ref.val)) {
        JS_SetOpaque(ctx, *object, NULL);
        heap_caps_free(ref);
        goto fail;
    }
    state->transferred = true;
    return JS_PopGCRef(ctx, &object_ref);
fail:
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static void ble_subscribe_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL && !state->transferred &&
        state->connection_index < s_ble.max_connections &&
        state->subscription_index < BLE_MAX_SUBSCRIPTIONS) {
        ble_subscription_t *subscription =
            &s_ble.connections[state->connection_index]
                 .subscriptions[state->subscription_index];
        if (subscription->generation == state->subscription_generation)
            ble_close_subscription(subscription);
    }
    ble_future_state_release(state);
}

static ble_subscription_t *ble_subscription_from_value(
    JSContext *ctx, JSValue value, ble_subscription_ref_t **out_ref,
    bool throw_if_stale)
{
    ble_subscription_ref_t *ref;
    ble_subscription_t *subscription = NULL;
    if (JS_GetClassID(ctx, value) != JS_CLASS_BLE_NOTIFICATION_STREAM ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "expected a BLENotificationStream instance");
        return NULL;
    }
    if (ref->adapter_generation == s_ble.generation &&
        ref->connection_index < s_ble.max_connections &&
        ref->subscription_index < BLE_MAX_SUBSCRIPTIONS) {
        ble_connection_slot_t *slot = &s_ble.connections[ref->connection_index];
        if (slot->generation == ref->connection_generation) {
            subscription = &slot->subscriptions[ref->subscription_index];
            if (!subscription->allocated ||
                subscription->generation != ref->subscription_generation)
                subscription = NULL;
        }
    }
    if (subscription == NULL && throw_if_stale)
        JS_ThrowReferenceError(ctx,
            "BLE_STALE_SUBSCRIPTION: subscription is closed");
    if (out_ref != NULL) *out_ref = ref;
    return subscription;
}

static bool ble_subscription_close_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    ble_subscription_ref_t *ref = NULL;
    ble_subscription_t *subscription;
    (void)argv;
    if (out_state == NULL || argc != 0 ||
        (subscription = ble_subscription_from_value(
             ctx, this_ref->val, &ref, true)) == NULL) return false;
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_SUBSCRIPTION_CLOSE;
    state->adapter_generation = ref->adapter_generation;
    state->connection_index = ref->connection_index;
    state->connection_generation = ref->connection_generation;
    state->subscription_index = ref->subscription_index;
    state->subscription_generation = ref->subscription_generation;
    state->attribute_handle = subscription->value_handle;
    state->cccd_handle = subscription->cccd_handle;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    state->payload_length = 2;
    state->payload = heap_caps_calloc(1, 2, MALLOC_CAP_8BIT);
    atomic_init(&state->completed, false);
    if (state->payload == NULL) {
        heap_caps_free(state);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

