99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static JSValue ble_subscription_close_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->host_code != 0)
        return ble_throw_error(ctx, "BLE_GATT_ERROR", state->host_code,
                               state->att_code, state->connection_index,
                               state->cccd_handle);
    if (state->connection_index < s_ble.max_connections &&
        state->subscription_index < BLE_MAX_SUBSCRIPTIONS) {
        ble_subscription_t *subscription =
            &s_ble.connections[state->connection_index]
                 .subscriptions[state->subscription_index];
        if (subscription->generation == state->subscription_generation)
            ble_close_subscription(subscription);
    }
    ble_retire_handle(ctx, state->owner_ref.val,
                      JS_CLASS_BLE_NOTIFICATION_STREAM,
                      &s_ble_closed_subscription_ref);
    return JS_TRUE;
}

static const esp32_mquickjs_future_driver_t s_ble_subscribe_driver = {
    .capture = ble_subscribe_capture,
    .start = ble_subscribe_start,
    .poll = ble_future_poll,
    .finish = ble_subscribe_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_subscribe_destroy,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gatt_resource_key,
};

static const esp32_mquickjs_future_driver_t s_ble_subscription_close_driver = {
    .capture = ble_subscription_close_capture,
    .start = ble_subscribe_start,
    .poll = ble_future_poll,
    .finish = ble_subscription_close_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_gatt_resource_key,
};

static bool ble_bond_operation_capture_common(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state,
    ble_operation_t operation)
{
    esp32_mquickjs_future_driver_state_t *state;
    if (out_state == NULL || ble_adapter_from_value(ctx, this_ref->val, true) == NULL)
        return false;
    if ((operation == BLE_OP_REMOVE_BOND && argc != 1) ||
        (operation == BLE_OP_CLEAR_BONDS && argc != 0)) {
        JS_ThrowTypeError(ctx, "invalid BLE bond operation arguments");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = operation;
    state->adapter_generation = s_ble.generation;
    state->timeout_ms = 5000;
    atomic_init(&state->completed, false);
    if (operation == BLE_OP_REMOVE_BOND &&
        !ble_parse_address(ctx, argv[0].val, &state->peer)) {
        heap_caps_free(state);
        return false;
    }
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static bool ble_remove_bond_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    return ble_bond_operation_capture_common(ctx, this_ref, argc, argv,
                                             out_state, BLE_OP_REMOVE_BOND);
}

static bool ble_clear_bonds_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    return ble_bond_operation_capture_common(ctx, this_ref, argc, argv,
                                             out_state, BLE_OP_CLEAR_BONDS);
}

static bool ble_bond_operation_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    int count = 0;
    int rc;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (state->operation == BLE_OP_REMOVE_BOND) {
        rc = ble_store_util_delete_peer(&state->peer);
        state->result_bool = rc == 0;
        if (rc == BLE_HS_ENOENT) rc = 0;
    } else {
        rc = ble_store_util_count(BLE_STORE_OBJ_TYPE_PEER_SEC, &count);
        if (rc == 0) rc = ble_store_clear();
        state->result_count = rc == 0 ? count : 0;
    }
    state->host_code = rc;
    if (rc != 0) {
        ble_throw_error(ctx, "BLE_SECURITY_ERROR", rc, -1, -1, -1);
        return false;
    }
    atomic_store_explicit(&state->completed, true, memory_order_release);
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static JSValue ble_bond_operation_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->host_code != 0)
        return ble_throw_error(ctx, "BLE_SECURITY_ERROR", state->host_code,
                               -1, -1, -1);
    return state->operation == BLE_OP_REMOVE_BOND
               ? JS_NewBool(state->result_bool)
               : JS_NewInt32(ctx, state->result_count);
}

static const esp32_mquickjs_future_driver_t s_ble_remove_bond_driver = {
    .capture = ble_remove_bond_capture,
    .start = ble_bond_operation_start,
    .poll = ble_future_poll,
    .finish = ble_bond_operation_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_adapter_resource_key,
};

static const esp32_mquickjs_future_driver_t s_ble_clear_bonds_driver = {
    .capture = ble_clear_bonds_capture,
    .start = ble_bond_operation_start,
    .poll = ble_future_poll,
    .finish = ble_bond_operation_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_adapter_resource_key,
};

static void ble_reset_orphan_close(void)
{
    atomic_store_explicit(&s_ble_orphan_close.requested, false,
                          memory_order_release);
    atomic_store_explicit(&s_ble_orphan_close.worker_submitted, false,
                          memory_order_release);
    atomic_store_explicit(&s_ble_orphan_close.worker_completed, false,
                          memory_order_release);
    atomic_store_explicit(&s_ble_orphan_close.worker_result, 0,
                          memory_order_release);
    s_ble_orphan_close.generation = 0;
    s_ble_orphan_close.retry_not_before_us = 0;
}

static void ble_request_orphan_close(uint32_t generation)
{
    ble_lifecycle_t lifecycle = atomic_load_explicit(
        &s_ble.lifecycle, memory_order_acquire);

    if (generation == 0U || generation != s_ble.generation ||
        (lifecycle != BLE_LIFECYCLE_ACTIVE &&
         lifecycle != BLE_LIFECYCLE_FAILED)) {
        return;
    }
    s_ble_orphan_close.generation = generation;
    atomic_store_explicit(&s_ble_orphan_close.requested, true,
                          memory_order_release);
    if (s_ble.runtime != NULL) {
        esp32_mquickjs_notify_activity(s_ble.runtime);
    }
}

static void ble_begin_orphan_close(void)
{
    uint16_t index;

