99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
    s_ble.lifecycle = BLE_LIFECYCLE_CLOSING;
    if (s_ble.scanner.active) {
        (void)ble_gap_disc_cancel();
    }
    if (s_ble.advertiser.active) {
        (void)ble_gap_adv_stop();
    }
    for (index = 0; index < s_ble.max_connections; ++index) {
        if (s_ble.connections[index].open) {
            if (s_ble.connections[index].release_on_disconnect)
                ble_terminate_unclaimed_connection(&s_ble.connections[index],
                                                     s_ble.connections[index].generation);
            else
                (void)ble_gap_terminate(s_ble.connections[index].conn_handle,
                                        BLE_ERR_REM_USER_CONN_TERM);
        }
    }
}

static void ble_orphan_close_worker(void *opaque)
{
    ble_adapter_t *adapter = opaque;
    int result = ble_wait_for_pending_connects(
                     BLE_CONNECT_CANCEL_QUIESCE_MS)
                     ? 0
                     : BLE_HS_ETIMEOUT;

    if (result == 0) {
        result = ble_cleanup_native(adapter);
    }
    atomic_store_explicit(&s_ble_orphan_close.worker_result, result,
                          memory_order_release);
    atomic_store_explicit(&s_ble_orphan_close.worker_completed, true,
                          memory_order_release);
    if (adapter != NULL && adapter->runtime != NULL) {
        esp32_mquickjs_notify_activity(adapter->runtime);
    }
}

static bool ble_orphan_close_poller(JSContext *ctx,
                                    esp32_mquickjs_runtime_t *runtime,
                                    void *opaque)
{
    int result;

    (void)ctx;
    (void)runtime;
    (void)opaque;
    if (!atomic_load_explicit(&s_ble_orphan_close.requested,
                              memory_order_acquire)) {
        return false;
    }
    if (s_ble_orphan_close.generation != s_ble.generation ||
        s_ble.lifecycle == BLE_LIFECYCLE_CLOSED) {
        ble_reset_orphan_close();
        return true;
    }
    if (atomic_load_explicit(&s_ble_orphan_close.worker_submitted,
                             memory_order_acquire)) {
        if (!atomic_load_explicit(&s_ble_orphan_close.worker_completed,
                                  memory_order_acquire)) {
            return false;
        }
        result = atomic_load_explicit(&s_ble_orphan_close.worker_result,
                                      memory_order_acquire);
        atomic_store_explicit(&s_ble_orphan_close.worker_submitted, false,
                              memory_order_release);
        atomic_store_explicit(&s_ble_orphan_close.worker_completed, false,
                              memory_order_release);
        if (result == 0) {
            ble_free_pools(&s_ble);
            s_ble.lifecycle = BLE_LIFECYCLE_CLOSED;
            s_ble.runtime = NULL;
            ble_reset_orphan_close();
        } else {
            s_ble.lifecycle = BLE_LIFECYCLE_FAILED;
            s_ble_orphan_close.retry_not_before_us =
                esp_timer_get_time() + 50000;
        }
        return true;
    }
    if (s_ble.lifecycle == BLE_LIFECYCLE_CLOSING ||
        esp_timer_get_time() < s_ble_orphan_close.retry_not_before_us) {
        return false;
    }
    ble_begin_orphan_close();
    atomic_store_explicit(&s_ble_orphan_close.worker_completed, false,
                          memory_order_release);
    if (!esp32_mquickjs_submit_background_worker(
            ble_orphan_close_worker, &s_ble)) {
        s_ble.lifecycle = BLE_LIFECYCLE_FAILED;
        s_ble_orphan_close.retry_not_before_us =
            esp_timer_get_time() + 50000;
        return false;
    }
    atomic_store_explicit(&s_ble_orphan_close.worker_submitted, true,
                          memory_order_release);
    return true;
}

static void ble_close_worker(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    int rc = ble_wait_for_pending_connects(
                 BLE_CONNECT_CANCEL_QUIESCE_MS)
                 ? 0 : BLE_HS_ETIMEOUT;
    if (rc == 0) {
        rc = ble_cleanup_native(&s_ble);
    }
    state->host_code = rc;
    atomic_store_explicit(&state->completed, true, memory_order_release);
    /* The generic Future worker owns the sole runtime wake after return. */
    ble_future_state_drop(state);
}

static bool ble_adapter_close_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    ble_adapter_ref_t *ref;
    (void)argv;
    if (out_state == NULL || argc != 0 ||
        JS_GetClassID(ctx, this_ref->val) != JS_CLASS_BLE_ADAPTER ||
        (ref = JS_GetOpaque(ctx, this_ref->val)) == NULL) {
        JS_ThrowTypeError(ctx, "expected a BLEAdapter instance");
        return false;
    }
    if (ref->generation != s_ble.generation ||
        (s_ble.lifecycle != BLE_LIFECYCLE_ACTIVE &&
         s_ble.lifecycle != BLE_LIFECYCLE_FAILED)) {
        JS_ThrowReferenceError(ctx,
            "BLE_STALE_ADAPTER: BLE adapter is closed");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_ADAPTER_CLOSE;
    state->adapter_generation = s_ble.generation;
    state->timeout_ms = 10000;
    atomic_init(&state->completed, false);
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    return true;
}

static bool ble_adapter_close_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    uint16_t index;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    s_ble.lifecycle = BLE_LIFECYCLE_CLOSING;
    if (s_ble.scanner.active) (void)ble_gap_disc_cancel();
    if (s_ble.advertiser.active) (void)ble_gap_adv_stop();
    for (index = 0; index < s_ble.max_connections; ++index) {
        if (s_ble.connections[index].open) {
            if (s_ble.connections[index].release_on_disconnect)
                ble_terminate_unclaimed_connection(&s_ble.connections[index],
                                                     s_ble.connections[index].generation);
            else
                (void)ble_gap_terminate(s_ble.connections[index].conn_handle,
                                        BLE_ERR_REM_USER_CONN_TERM);
        }
    }
    ble_future_state_hold(state);
    if (!esp32_mquickjs_future_submit_worker(runtime, token,
                                              ble_close_worker, state)) {
        ble_future_state_drop(state);
        s_ble.lifecycle = BLE_LIFECYCLE_FAILED;
        ble_throw_error(ctx, "BLE_CLOSING", BLE_HS_ENOMEM, -1, -1, -1);
        return false;
    }
    return true;
}

