99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static JSValue ble_adapter_close_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    int host_code = state != NULL ? state->host_code : BLE_HS_EUNKNOWN;
    if (host_code != 0) {
        s_ble.lifecycle = BLE_LIFECYCLE_FAILED;
        return ble_throw_error(ctx, "BLE_CLOSING", host_code, -1, -1, -1);
    }
    ble_free_pools(&s_ble);
    s_ble.lifecycle = BLE_LIFECYCLE_CLOSED;
    s_ble.runtime = NULL;
    ble_reset_orphan_close();
    ble_retire_handle(ctx, state->owner_ref.val, JS_CLASS_BLE_ADAPTER,
                      &s_ble_closed_adapter_ref);
    return JS_TRUE;
}

static esp32_mquickjs_resource_key_t ble_adapter_resource_key(
    const esp32_mquickjs_future_driver_state_t *state)
{
    (void)state;
    return &s_ble_adapter_lane_key;
}

static const esp32_mquickjs_future_driver_t s_ble_adapter_close_driver = {
    .capture = ble_adapter_close_capture,
    .start = ble_adapter_close_start,
    .poll = ble_future_poll,
    .finish = ble_adapter_close_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_future_state_release,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_adapter_resource_key,
};

static ble_local_characteristic_t *ble_local_characteristic_from_value(
    JSContext *ctx, JSValue value, ble_local_characteristic_ref_t **out_ref,
    bool throw_if_stale)
{
    ble_local_characteristic_ref_t *ref;
    ble_local_characteristic_t *local = NULL;
    if (JS_GetClassID(ctx, value) != JS_CLASS_BLE_LOCAL_CHARACTERISTIC ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "expected a BLELocalCharacteristic instance");
        return NULL;
    }
    if (ref->adapter_generation == s_ble.generation &&
        s_ble.server.open && ref->index < s_ble.server.characteristic_count)
        local = &s_ble.server.characteristics[ref->index];
    if (local == NULL && throw_if_stale)
        JS_ThrowReferenceError(ctx, "BLE_STALE_ATTRIBUTE: local characteristic is stale");
    if (out_ref != NULL) *out_ref = ref;
    return local;
}

static bool ble_server_notify_capture(
    JSContext *ctx, JSGCRef *this_ref, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    static const char *const allowed[] = {"connection", "indication", "timeoutMs"};
    esp32_mquickjs_future_driver_state_t *state;
    ble_local_characteristic_ref_t *ref = NULL;
    ble_local_characteristic_t *local;
    JSValue data = argc >= 1 ? argv[0].val : JS_UNDEFINED;
    JSValue options = argc == 2 ? argv[1].val : JS_UNDEFINED;
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue error = JS_UNDEFINED;
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    bool indication = false;
    size_t length;
    if (out_state == NULL || argc > 2 ||
        (local = ble_local_characteristic_from_value(
             ctx, this_ref->val, &ref, true)) == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    if (!JS_IsUndefined(options) &&
        (!ble_is_object(ctx, options) ||
         !ble_validate_option_keys(ctx, options,
                                   "BLELocalCharacteristic.notify()",
                                   allowed, 3))) {
        JS_PopGCRef(ctx, &property_ref);
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_PopGCRef(ctx, &property_ref);
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->operation = BLE_OP_SERVER_NOTIFY;
    state->adapter_generation = ref->adapter_generation;
    state->attribute_index = ref->index;
    state->attribute_handle = local->value_handle;
    state->connection_index = UINT16_MAX;
    state->timeout_ms = BLE_DEFAULT_TIMEOUT_MS;
    atomic_init(&state->completed, false);
    atomic_init(&state->pending_confirmations, 0);
    if (!JS_IsUndefined(options)) {
        if (!ble_get_bool(ctx, options, "indication", false, &indication) ||
            !ble_parse_timeout_option(ctx, options, "server notify",
                                      &state->timeout_ms)) goto fail;
        *property = JS_GetPropertyStr(ctx, options, "connection");
        if (JS_IsException(*property)) goto fail;
        if (!JS_IsUndefined(*property)) {
            ble_connection_ref_t *connection_ref = NULL;
            if (ble_connection_from_value(ctx, *property, &connection_ref, true) == NULL)
                goto fail;
            state->connection_index = connection_ref->index;
            state->connection_generation = connection_ref->generation;
        }
    }
    state->indication = indication;
    if ((!indication && !(local->properties & BLE_GATT_CHR_F_NOTIFY)) ||
        (indication && !(local->properties & BLE_GATT_CHR_F_INDICATE))) {
        ble_throw_error(ctx, "BLE_NOT_SUPPORTED", BLE_HS_ENOTSUP, -1,
                        -1, local->value_handle);
        goto fail;
    }
    if (JS_IsUndefined(data)) {
        taskENTER_CRITICAL(&local->lock);
        length = local->length;
        state->payload = heap_caps_malloc(length > 0 ? length : 1,
                                           MALLOC_CAP_8BIT);
        if (state->payload != NULL && length > 0)
            memcpy(state->payload, local->value, length);
        taskEXIT_CRITICAL(&local->lock);
        if (state->payload == NULL) {
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }
        state->payload_length = length;
    } else {
        if (!esp32_mquickjs_get_byte_source(ctx, data, "server notify data",
                                            &source, &owned, &error)) goto fail;
        if (source.length > local->max_length) {
            esp32_mquickjs_release_byte_source(owned);
            owned = NULL;
            ble_throw_error(ctx, "BLE_PAYLOAD_TOO_LARGE", BLE_HS_EMSGSIZE,
                            -1, -1, local->value_handle);
            goto fail;
        }
        state->payload = heap_caps_malloc(source.length > 0 ? source.length : 1,
                                           MALLOC_CAP_8BIT);
        if (state->payload == NULL) {
            esp32_mquickjs_release_byte_source(owned);
            owned = NULL;
            JS_ThrowOutOfMemory(ctx);
            goto fail;
        }
        state->payload_length = source.length;
        if (source.length > 0) memcpy(state->payload, source.data, source.length);
        esp32_mquickjs_release_byte_source(owned);
        owned = NULL;
    }
    ble_retain_owner(ctx, this_ref->val, state);
    *out_state = state;
    JS_PopGCRef(ctx, &property_ref);
    return true;
fail:
    esp32_mquickjs_release_byte_source(owned);
    heap_caps_free(state->payload);
    heap_caps_free(state);
    JS_PopGCRef(ctx, &property_ref);
    return false;
}

static bool ble_server_notify_start_locked(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    uint16_t index;
    state->runtime = runtime;
    state->token = token;
    state->started = true;
    if (state->indication) {
        taskENTER_CRITICAL(&s_ble.lock);
        if (atomic_load(&s_ble_server_notify_state) != NULL) {
            taskEXIT_CRITICAL(&s_ble.lock);
            ble_throw_error(ctx, "BLE_BUSY", BLE_HS_EBUSY, -1, -1, -1);
            return false;
        }
        state->native_identity = esp32_mquickjs_wireless_operation_register(
            &s_ble_operations, state);
        if (state->native_identity == 0U) {
            taskEXIT_CRITICAL(&s_ble.lock);
            ble_throw_error(ctx, "BLE_BUSY", BLE_HS_ENOMEM, -1, -1, -1);
            return false;
        }
        state->callback_refs++;
        state->notify_submitting = true;
        atomic_store(&s_ble_server_notify_state, state);
        taskEXIT_CRITICAL(&s_ble.lock);
    }
    for (index = 0; index < s_ble.max_connections; ++index) {
        ble_connection_slot_t *slot = &s_ble.connections[index];
        struct os_mbuf *mbuf;
        int rc;
        if (!slot->open ||
            (state->connection_index != UINT16_MAX &&
             (index != state->connection_index ||
              slot->generation != state->connection_generation))) continue;
        state->attempted_connections++;
        mbuf = ble_hs_mbuf_from_flat(state->payload, state->payload_length);
        if (mbuf == NULL) {
            taskENTER_CRITICAL(&s_ble.lock);
            if (state->host_code == 0) state->host_code = BLE_HS_ENOMEM;
            taskEXIT_CRITICAL(&s_ble.lock);
            continue;
        }
        if (state->indication) {
            taskENTER_CRITICAL(&s_ble.lock);
            state->notify_handles[index] = slot->conn_handle;
            state->notify_pending[index] = true;
            atomic_fetch_add_explicit(&state->pending_confirmations, 1,
                                      memory_order_relaxed);
            taskEXIT_CRITICAL(&s_ble.lock);
            rc = ble_gatts_indicate_custom(slot->conn_handle,
                                            state->attribute_handle, mbuf);
            taskENTER_CRITICAL(&s_ble.lock);
            if (rc != 0 && state->notify_pending[index]) {
                state->notify_pending[index] = false;
                atomic_fetch_sub_explicit(&state->pending_confirmations, 1,
                                          memory_order_relaxed);
            }
            taskEXIT_CRITICAL(&s_ble.lock);
        } else {
            rc = ble_gatts_notify_custom(slot->conn_handle,
                                          state->attribute_handle, mbuf);
        }
        taskENTER_CRITICAL(&s_ble.lock);
        if (rc == 0) state->submitted_connections++;
        else if (state->host_code == 0) state->host_code = rc;
        taskEXIT_CRITICAL(&s_ble.lock);
    }
    if (state->indication)
        atomic_fetch_add_explicit(&s_ble.server.indications,
                                  state->submitted_connections,
                                  memory_order_relaxed);
    else
        atomic_fetch_add_explicit(&s_ble.server.notifications,
                                  state->submitted_connections,
                                  memory_order_relaxed);
    taskENTER_CRITICAL(&s_ble.lock);
    state->notify_submitting = false;
    bool notify_complete = !state->indication ||
        atomic_load_explicit(&state->pending_confirmations, memory_order_acquire) == 0;
    taskEXIT_CRITICAL(&s_ble.lock);
    if (notify_complete) {
        ble_native_state_complete(state);
        atomic_store_explicit(&state->completed, true, memory_order_release);
        (void)esp32_mquickjs_future_wake(runtime, token);
    }
    if (state->attempted_connections == 0 && state->connection_index != UINT16_MAX) {
        state->host_code = BLE_HS_ENOTCONN;
    }
    (void)ctx;
    return true;
}

static bool ble_server_notify_start(
    JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    bool result;
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    result = ble_server_notify_start_locked(ctx, runtime, token, state);
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    return result;
}

static JSValue ble_server_notify_finish(
    JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "attemptedConnections",
            JS_NewUint32(ctx, state->attempted_connections)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "submittedConnections",
            JS_NewUint32(ctx, state->submitted_connections)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "bytes",
            JS_NewInt64(ctx, state->payload_length)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "indication",
            JS_NewBool(state->indication))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

static void ble_server_notify_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    ble_future_state_release(state);
}

static esp32_mquickjs_resource_key_t ble_server_notify_resource_key(
    const esp32_mquickjs_future_driver_state_t *state)
{
    (void)state;
    return &s_ble_server_lane_key;
}

static const esp32_mquickjs_future_driver_t s_ble_server_notify_driver = {
    .capture = ble_server_notify_capture,
    .start = ble_server_notify_start,
    .poll = ble_future_poll,
    .finish = ble_server_notify_finish,
    .cancel = ble_future_cancel,
    .destroy = ble_server_notify_destroy,
    .timeout_ms = ble_future_timeout_ms,
    .on_timeout = ble_future_on_timeout,
    .resource_key = ble_server_notify_resource_key,
};

