99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
static const char *ble_stop_reason_name(ble_stop_reason_t reason)
{
    switch (reason) {
    case BLE_STOP_RUNNING: return "running";
    case BLE_STOP_COMPLETED: return "completed";
    case BLE_STOP_CONNECTED: return "connected";
    case BLE_STOP_CLOSED: return "closed";
    default: return "error";
    }
}

static JSValue ble_properties_to_js(JSContext *ctx, uint32_t properties)
{
    static const struct {
        uint32_t flag;
        const char *name;
    } names[] = {
        {BLE_GATT_CHR_PROP_BROADCAST, "broadcast"},
        {BLE_GATT_CHR_PROP_READ, "read"},
        {BLE_GATT_CHR_PROP_WRITE, "write"},
        {BLE_GATT_CHR_PROP_WRITE_NO_RSP, "write-without-response"},
        {BLE_GATT_CHR_PROP_NOTIFY, "notify"},
        {BLE_GATT_CHR_PROP_INDICATE, "indicate"},
        {BLE_GATT_CHR_PROP_AUTH_SIGN_WRITE, "authenticated-signed-write"},
    };
    JSGCRef array_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    uint32_t input;
    uint32_t output = 0;
    *array = JS_NewArray(ctx, 0);
    for (input = 0; !JS_IsException(*array) &&
                    input < sizeof(names) / sizeof(names[0]); ++input) {
        if ((properties & names[input].flag) != 0) {
            JSValue name = JS_NewString(ctx, names[input].name);
            if (JS_IsException(name) || JS_IsException(JS_SetPropertyUint32(
                    ctx, *array, output++, name))) {
                *array = JS_EXCEPTION;
            }
        }
    }
    return JS_PopGCRef(ctx, &array_ref);
}

static JSValue ble_adapter_status_to_js(JSContext *ctx)
{
    JSGCRef object_ref, roles_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *roles = JS_PushGCRef(ctx, &roles_ref);
    char address[18];
    int bonds = 0;
    uint16_t index;
    uint32_t connections = 0;
    uint32_t role_index = 0;
    JSValue role;
    ble_format_address(s_ble.address, address);
    (void)ble_store_util_count(BLE_STORE_OBJ_TYPE_PEER_SEC, &bonds);
    for (index = 0; index < s_ble.max_connections; ++index)
        if (s_ble.connections[index].open) connections++;
    *roles = JS_NewArray(ctx, 0);
    if (JS_IsException(*roles)) goto fail;
    if (s_ble.role_central) {
        role = JS_NewString(ctx, "central");
        if (JS_IsException(role) || JS_IsException(
                JS_SetPropertyUint32(ctx, *roles, role_index++, role))) goto fail;
    }
    if (s_ble.role_peripheral) {
        role = JS_NewString(ctx, "peripheral");
        if (JS_IsException(role) || JS_IsException(
                JS_SetPropertyUint32(ctx, *roles, role_index++, role))) goto fail;
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) || JS_IsException(*roles) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "open",
            JS_NewBool(s_ble.lifecycle == BLE_LIFECYCLE_ACTIVE)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "synchronized",
            JS_NewBool(s_ble.synchronized)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "address",
            JS_NewString(ctx, address)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "addressType",
            JS_NewString(ctx, ble_address_type_name(s_ble.own_addr_type))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "deviceName",
            JS_NewString(ctx, s_ble.device_name)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "roles", *roles) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "connections",
            JS_NewUint32(ctx, connections)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "maxConnections",
            JS_NewUint32(ctx, s_ble.max_connections)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "scanning",
            JS_NewBool(s_ble.scanner.active)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "advertising",
            JS_NewBool(s_ble.advertiser.active)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "bondedDevices",
            JS_NewInt32(ctx, bonds)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "resetCount",
            JS_NewUint32(ctx, atomic_load_explicit(&s_ble.reset_count,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "droppedScanReports",
            JS_NewUint32(ctx, atomic_load_explicit(&s_ble.scanner.dropped,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "droppedConnectionEvents",
            JS_NewUint32(ctx, atomic_load_explicit(
                &s_ble.dropped_connection_events, memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "rejectedConnectionError",
            JS_NewInt32(ctx, atomic_load_explicit(
                &s_ble.rejected_connection_error, memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "droppedServerEvents",
            JS_NewUint32(ctx, atomic_load_explicit(&s_ble.server.dropped,
                                                   memory_order_relaxed)))) {
        goto fail;
    }
    JS_PopGCRef(ctx, &roles_ref);
    return JS_PopGCRef(ctx, &object_ref);
fail:
    JS_PopGCRef(ctx, &roles_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static JSValue ble_connection_status_to_js(JSContext *ctx,
                                           ble_connection_slot_t *slot,
                                           uint16_t connection_index)
{
    ble_connection_snapshot_t snapshot;
    JSGCRef object_ref, peer_ref, security_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *peer = JS_PushGCRef(ctx, &peer_ref);
    JSValue *security = JS_PushGCRef(ctx, &security_ref);
    ble_connection_snapshot(slot, &snapshot);
    *object = JS_NewObject(ctx);
    *peer = ble_address_to_js(ctx, &snapshot.peer);
    *security = ble_security_to_js(ctx, &snapshot.security, &snapshot.peer);
    if (JS_IsException(*object) || JS_IsException(*peer) ||
        JS_IsException(*security) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "open",
                                         JS_NewBool(snapshot.open)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "connectionId",
                                         JS_NewUint32(ctx, connection_index)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "peer", *peer) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "role",
            JS_NewString(ctx, snapshot.central ? "central" : "peripheral")) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "mtu",
                                         JS_NewUint32(ctx, snapshot.mtu)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "rssi",
            snapshot.rssi_valid ? JS_NewInt32(ctx, snapshot.rssi) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "security", *security) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "gattQueued",
            JS_NewUint32(ctx, atomic_load_explicit(&slot->gatt_pending,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "gattActive",
            JS_NewBool(atomic_load_explicit(&slot->active_gatt_state,
                                            memory_order_acquire) != NULL))) {
        JS_PopGCRef(ctx, &security_ref);
        JS_PopGCRef(ctx, &peer_ref);
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    JS_PopGCRef(ctx, &security_ref);
    JS_PopGCRef(ctx, &peer_ref);
    return JS_PopGCRef(ctx, &object_ref);
}

static JSValue ble_throw_constructor(JSContext *ctx, const char *name)
{
    return JS_ThrowTypeError(ctx, "%s cannot be constructed directly", name);
}

JSValue js_ble_adapter_constructor(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return ble_throw_constructor(ctx, "BLEAdapter");
}

void js_ble_adapter_finalizer(JSContext *ctx, void *opaque)
{
    ble_adapter_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && ref != &s_ble_closed_adapter_ref) {
        ble_request_orphan_close(ref->generation);
        heap_caps_free(ref);
    }
}

