99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
JSValue js_ble_adapter_status(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    (void)argv;
    if (this_val == NULL || argc != 0 ||
        ble_adapter_from_value(ctx, *this_val, true) == NULL) return JS_EXCEPTION;
    return ble_adapter_status_to_js(ctx);
}

#define BLE_FUTURE_WRAPPER(function_name, method_name)                         \
    JSValue function_name(JSContext *ctx, JSValue *this_val,                  \
                          int argc, JSValue *argv)                             \
    {                                                                          \
        if (this_val == NULL)                                                   \
            return JS_ThrowTypeError(ctx, method_name " has no receiver");    \
        return ble_future_call_and_wait(ctx, *this_val, method_name, argc,     \
                                        argv);                                  \
    }

BLE_FUTURE_WRAPPER(js_ble_adapter_scan, "scan")
BLE_FUTURE_WRAPPER(js_ble_adapter_connect, "connect")
BLE_FUTURE_WRAPPER(js_ble_adapter_advertise, "advertise")
BLE_FUTURE_WRAPPER(js_ble_adapter_remove_bond, "removeBond")
BLE_FUTURE_WRAPPER(js_ble_adapter_clear_bonds, "clearBonds")
BLE_FUTURE_WRAPPER(js_ble_adapter_close, "close")

JSValue js_ble_adapter_server(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    ble_server_ref_t *ref;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    (void)argv;
    if (this_val == NULL || argc != 0 ||
        ble_adapter_from_value(ctx, *this_val, true) == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    if (!s_ble.server.open) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_NULL;
    }
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_BLE_GATT_SERVER);
    if (JS_IsException(*object)) goto fail;
    ref = heap_caps_calloc(1, sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    ref->adapter_generation = s_ble.generation;
    JS_SetOpaque(ctx, *object, ref);
    if (!esp32_mquickjs_set_property_ref(ctx, object, "_eventQueue",
                                         s_ble.server.event_queue_ref.val)) {
        JS_SetOpaque(ctx, *object, NULL);
        heap_caps_free(ref);
        goto fail;
    }
    return JS_PopGCRef(ctx, &object_ref);
fail:
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

JSValue js_ble_adapter_bonds(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    ble_addr_t peers[CONFIG_BT_NIMBLE_MAX_BONDS];
    int count = 0;
    int index;
    JSGCRef array_ref, item_ref, peer_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    JSValue *item = JS_PushGCRef(ctx, &item_ref);
    JSValue *peer = JS_PushGCRef(ctx, &peer_ref);
    (void)argv;
    if (this_val == NULL || argc != 0 ||
        ble_adapter_from_value(ctx, *this_val, true) == NULL) goto fail;
    if (ble_store_util_bonded_peers(peers, &count,
                                    CONFIG_BT_NIMBLE_MAX_BONDS) != 0) {
        ble_throw_error(ctx, "BLE_SECURITY_ERROR", BLE_HS_ESTORE_FAIL,
                        -1, -1, -1);
        goto fail;
    }
    *array = JS_NewArray(ctx, count);
    for (index = 0; !JS_IsException(*array) && index < count; ++index) {
        struct ble_store_key_sec key = {.peer_addr = peers[index]};
        struct ble_store_value_sec value = {0};
        bool authenticated = false, secure_connections = false;
        if (ble_store_read_peer_sec(&key, &value) == 0) {
            authenticated = value.authenticated;
            secure_connections = value.sc;
        }
        esp32_mquickjs_wireless_secure_zero(&value, sizeof(value));
        *peer = ble_address_to_js(ctx, &peers[index]);
        *item = JS_NewObject(ctx);
        if (JS_IsException(*peer) || JS_IsException(*item) ||
            !esp32_mquickjs_set_property_ref(ctx, item, "peer", *peer) ||
            !esp32_mquickjs_set_property_ref(ctx, item, "authenticated",
                                             JS_NewBool(authenticated)) ||
            !esp32_mquickjs_set_property_ref(ctx, item, "secureConnections",
                                             JS_NewBool(secure_connections)) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *array, index, *item)))
            goto fail;
    }
    JS_PopGCRef(ctx, &peer_ref);
    JS_PopGCRef(ctx, &item_ref);
    return JS_PopGCRef(ctx, &array_ref);
fail:
    JS_PopGCRef(ctx, &peer_ref);
    JS_PopGCRef(ctx, &item_ref);
    JS_PopGCRef(ctx, &array_ref);
    return JS_EXCEPTION;
}

JSValue js_ble_scanner_constructor(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return ble_throw_constructor(ctx, "BLEScanner");
}

void js_ble_scanner_finalizer(JSContext *ctx, void *opaque)
{
    ble_scanner_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && ref != &s_ble_closed_scanner_ref) {
        if (ref->adapter_generation == s_ble.generation &&
            ref->generation == s_ble.scanner.generation &&
            s_ble.scanner.open) {
            ble_request_orphan_close(ref->adapter_generation);
        }
        heap_caps_free(ref);
    }
}

JSValue js_ble_scanner_receive(JSContext *ctx, JSValue *this_val,
                               int argc, JSValue *argv)
{
    if (this_val == NULL ||
        ble_scanner_from_value(ctx, *this_val, true) == NULL) return JS_EXCEPTION;
    return ble_future_call_and_wait(ctx, *this_val, "receive", argc, argv);
}

JSValue js_ble_scanner_stats(JSContext *ctx, JSValue *this_val,
                             int argc, JSValue *argv)
{
    if (this_val == NULL ||
        ble_scanner_from_value(ctx, *this_val, true) == NULL) return JS_EXCEPTION;
    return js_event_queue_stats(ctx, this_val, argc, argv);
}

JSValue js_ble_scanner_status(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    ble_scanner_t *scanner;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    (void)argv;
    if (this_val == NULL || argc != 0 ||
        (scanner = ble_scanner_from_value(ctx, *this_val, true)) == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "open",
                                         JS_NewBool(scanner->open)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "active",
                                         JS_NewBool(scanner->active)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "startedAtUs",
                                         JS_NewInt64(ctx, scanner->started_at_us)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "reports",
            JS_NewUint32(ctx, atomic_load_explicit(&scanner->reports,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "dropped",
            JS_NewUint32(ctx, atomic_load_explicit(&scanner->dropped,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "malformed",
            JS_NewUint32(ctx, atomic_load_explicit(&scanner->malformed,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "stopReason",
            JS_NewString(ctx, ble_stop_reason_name(scanner->stop_reason)))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

BLE_FUTURE_WRAPPER(js_ble_scanner_close, "close")

JSValue js_ble_advertiser_constructor(JSContext *ctx, JSValue *this_val,
                                      int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return ble_throw_constructor(ctx, "BLEAdvertiser");
}

void js_ble_advertiser_finalizer(JSContext *ctx, void *opaque)
{
    ble_advertiser_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && ref != &s_ble_closed_advertiser_ref) {
        if (ref->adapter_generation == s_ble.generation &&
            ref->generation == s_ble.advertiser.generation &&
            s_ble.advertiser.open) {
            ble_request_orphan_close(ref->adapter_generation);
        }
        heap_caps_free(ref);
    }
}

JSValue js_ble_advertiser_receive(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    if (this_val == NULL ||
        ble_advertiser_from_value(ctx, *this_val, true) == NULL) return JS_EXCEPTION;
    return ble_future_call_and_wait(ctx, *this_val, "receive", argc, argv);
}

