99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
JSValue js_ble_advertiser_stats(JSContext *ctx, JSValue *this_val,
                                int argc, JSValue *argv)
{
    if (this_val == NULL ||
        ble_advertiser_from_value(ctx, *this_val, true) == NULL) return JS_EXCEPTION;
    return js_event_queue_stats(ctx, this_val, argc, argv);
}

JSValue js_ble_advertiser_status(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
    ble_advertiser_t *advertiser;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    (void)argv;
    if (this_val == NULL || argc != 0 ||
        (advertiser = ble_advertiser_from_value(ctx, *this_val, true)) == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "open",
                                         JS_NewBool(advertiser->open)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "active",
                                         JS_NewBool(advertiser->active)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "connectable",
                                         JS_NewBool(advertiser->connectable)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "scannable",
                                         JS_NewBool(advertiser->scannable)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "incomingConnections",
            JS_NewUint32(ctx, atomic_load_explicit(&advertiser->incoming,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "dropped",
            JS_NewUint32(ctx, atomic_load_explicit(&advertiser->dropped,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "stopReason",
            JS_NewString(ctx, ble_stop_reason_name(advertiser->stop_reason)))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

BLE_FUTURE_WRAPPER(js_ble_advertiser_close, "close")

JSValue js_ble_connection_constructor(JSContext *ctx, JSValue *this_val,
                                      int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return ble_throw_constructor(ctx, "BLEConnection");
}

void js_ble_connection_finalizer(JSContext *ctx, void *opaque)
{
    ble_connection_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && ref != &s_ble_closed_connection_ref) {
        if (ref->adapter_generation == s_ble.generation &&
            ref->index < s_ble.max_connections &&
            ref->generation == s_ble.connections[ref->index].generation &&
            s_ble.connections[ref->index].open) {
            ble_request_orphan_close(ref->adapter_generation);
        }
        heap_caps_free(ref);
    }
}

JSValue js_ble_connection_receive(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    if (this_val == NULL ||
        ble_connection_from_value(ctx, *this_val, NULL, true) == NULL)
        return JS_EXCEPTION;
    return ble_future_call_and_wait(ctx, *this_val, "receive", argc, argv);
}

JSValue js_ble_connection_stats(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
    if (this_val == NULL ||
        ble_connection_from_value(ctx, *this_val, NULL, true) == NULL)
        return JS_EXCEPTION;
    return js_event_queue_stats(ctx, this_val, argc, argv);
}

JSValue js_ble_connection_status(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    ble_connection_ref_t *ref = NULL;
    ble_connection_slot_t *slot;
    (void)argv;
    if (this_val == NULL || argc != 0 ||
        (slot = ble_connection_from_value(ctx, *this_val, &ref, true)) == NULL)
        return JS_EXCEPTION;
    return ble_connection_status_to_js(ctx, slot, ref->index);
}

BLE_FUTURE_WRAPPER(js_ble_connection_pair, "pair")
BLE_FUTURE_WRAPPER(js_ble_connection_exchange_mtu, "exchangeMtu")
BLE_FUTURE_WRAPPER(js_ble_connection_read_rssi, "readRssi")
BLE_FUTURE_WRAPPER(js_ble_connection_discover, "discover")
BLE_FUTURE_WRAPPER(js_ble_connection_read_handle, "readHandle")
BLE_FUTURE_WRAPPER(js_ble_connection_write_handle, "writeHandle")
BLE_FUTURE_WRAPPER(js_ble_connection_subscribe_handle, "subscribeHandle")
BLE_FUTURE_WRAPPER(js_ble_connection_close, "close")

JSValue js_ble_connection_respond_pairing(JSContext *ctx, JSValue *this_val,
                                          int argc, JSValue *argv)
{
    ble_connection_slot_t *slot;
    uint32_t request_id, generation;
    struct ble_sm_io response = {0};
    if (this_val == NULL || argc != 2 ||
        (slot = ble_connection_from_value(ctx, *this_val, NULL, true)) == NULL ||
        !ble_to_u32(ctx, argv[0], &request_id)) {
        if (!JS_HasException(ctx))
            JS_ThrowTypeError(ctx,
                "respondPairing(requestId, response) expects two arguments");
        return JS_EXCEPTION;
    }
    generation = slot->generation;
    if (request_id == 0 || request_id != slot->pairing_request_id ||
        esp_timer_get_time() > slot->pairing_expires_at_us) {
        return ble_throw_error(ctx, "BLE_PAIRING_EXPIRED", BLE_HS_ETIMEOUT,
                               -1, -1, -1);
    }
    response.action = slot->pairing_action;
    if (response.action == BLE_SM_IOACT_NUMCMP) {
        if (!JS_IsBool(argv[1]))
            return JS_ThrowTypeError(ctx,
                                     "numeric comparison response must be boolean");
        response.numcmp_accept = JS_VALUE_GET_SPECIAL_VALUE(argv[1]) != 0;
    } else if (response.action == BLE_SM_IOACT_INPUT) {
        uint32_t passkey;
        if (!ble_to_u32(ctx, argv[1], &passkey) || passkey > 999999)
            return JS_ThrowRangeError(ctx, "pairing passkey must be 0..999999");
        response.passkey = passkey;
    } else {
        if (!JS_IsBool(argv[1]))
            return JS_ThrowTypeError(ctx, "pairing response must be boolean");
        if (JS_VALUE_GET_SPECIAL_VALUE(argv[1]) == 0) return JS_FALSE;
        response.passkey = slot->pairing_passkey;
    }
    xSemaphoreTakeRecursive(s_ble_connection_mutex, portMAX_DELAY);
    if (!slot->open || slot->generation != generation ||
        slot->pairing_request_id != request_id ||
        slot->pairing_action != response.action ||
        esp_timer_get_time() > slot->pairing_expires_at_us) {
        xSemaphoreGiveRecursive(s_ble_connection_mutex);
        esp32_mquickjs_wireless_secure_zero(&response, sizeof(response));
        return ble_throw_error(ctx, "BLE_PAIRING_EXPIRED", BLE_HS_ETIMEOUT,
                               -1, -1, -1);
    }
    int response_result = ble_sm_inject_io(slot->conn_handle, &response);
    if (response_result == 0) slot->pairing_request_id = 0;
    xSemaphoreGiveRecursive(s_ble_connection_mutex);
    esp32_mquickjs_wireless_secure_zero(&response, sizeof(response));
    if (response_result != 0)
        return ble_throw_error(ctx, "BLE_SECURITY_ERROR", BLE_HS_EINVAL,
                               -1, -1, -1);
    return JS_TRUE;
}

JSValue js_ble_notification_constructor(JSContext *ctx, JSValue *this_val,
                                        int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return ble_throw_constructor(ctx, "BLENotificationStream");
}

void js_ble_notification_finalizer(JSContext *ctx, void *opaque)
{
    ble_subscription_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && ref != &s_ble_closed_subscription_ref) {
        if (ref->adapter_generation == s_ble.generation &&
            ref->connection_index < s_ble.max_connections &&
            ref->subscription_index < BLE_MAX_SUBSCRIPTIONS) {
            ble_connection_slot_t *slot =
                &s_ble.connections[ref->connection_index];
            ble_subscription_t *subscription =
                &slot->subscriptions[ref->subscription_index];

