99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
            if (slot->generation == ref->connection_generation &&
                subscription->generation ==
                    ref->subscription_generation &&
                subscription->open) {
                ble_request_orphan_close(ref->adapter_generation);
            }
        }
        heap_caps_free(ref);
    }
}

JSValue js_ble_notification_receive(JSContext *ctx, JSValue *this_val,
                                     int argc, JSValue *argv)
{
    if (this_val == NULL ||
        ble_subscription_from_value(ctx, *this_val, NULL, true) == NULL)
        return JS_EXCEPTION;
    return ble_future_call_and_wait(ctx, *this_val, "receive", argc, argv);
}

JSValue js_ble_notification_stats(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    if (this_val == NULL ||
        ble_subscription_from_value(ctx, *this_val, NULL, true) == NULL)
        return JS_EXCEPTION;
    return js_event_queue_stats(ctx, this_val, argc, argv);
}

JSValue js_ble_notification_status(JSContext *ctx, JSValue *this_val,
                                    int argc, JSValue *argv)
{
    ble_subscription_t *subscription;
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    (void)argv;
    if (this_val == NULL || argc != 0 ||
        (subscription = ble_subscription_from_value(
             ctx, *this_val, NULL, true)) == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "open",
                                         JS_NewBool(subscription->open)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "mode",
            JS_NewString(ctx, subscription->indication ? "indicate" : "notify")) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "received",
            JS_NewUint32(ctx, atomic_load_explicit(&subscription->received,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "dropped",
            JS_NewUint32(ctx, atomic_load_explicit(&subscription->dropped,
                                                   memory_order_relaxed)))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

BLE_FUTURE_WRAPPER(js_ble_notification_close, "close")

JSValue js_ble_gatt_server_constructor(JSContext *ctx, JSValue *this_val,
                                       int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return ble_throw_constructor(ctx, "BLEGattServer");
}

void js_ble_gatt_server_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    heap_caps_free(opaque);
}

static bool ble_server_from_value(JSContext *ctx, JSValue value)
{
    ble_server_ref_t *ref;
    if (JS_GetClassID(ctx, value) != JS_CLASS_BLE_GATT_SERVER ||
        (ref = JS_GetOpaque(ctx, value)) == NULL) {
        JS_ThrowTypeError(ctx, "expected a BLEGattServer instance");
        return false;
    }
    if (ref->adapter_generation != s_ble.generation || !s_ble.server.open) {
        JS_ThrowReferenceError(ctx, "BLE_STALE_ADAPTER: GATT server is closed");
        return false;
    }
    return true;
}

JSValue js_ble_gatt_server_status(JSContext *ctx, JSValue *this_val,
                                  int argc, JSValue *argv)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    uint16_t index;
    uint32_t active = 0;
    (void)argv;
    if (this_val == NULL || argc != 0 ||
        !ble_server_from_value(ctx, *this_val)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    for (index = 0; index < s_ble.max_connections; ++index)
        if (s_ble.connections[index].open) active++;
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "open", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "services",
            JS_NewUint32(ctx, s_ble.server.service_count)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "characteristics",
            JS_NewUint32(ctx, s_ble.server.characteristic_count)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "activeConnections",
            JS_NewUint32(ctx, active)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "writes",
            JS_NewUint32(ctx, atomic_load_explicit(&s_ble.server.writes,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "notifications",
            JS_NewUint32(ctx, atomic_load_explicit(&s_ble.server.notifications,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "indications",
            JS_NewUint32(ctx, atomic_load_explicit(&s_ble.server.indications,
                                                   memory_order_relaxed))) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "droppedEvents",
            JS_NewUint32(ctx, atomic_load_explicit(&s_ble.server.dropped,
                                                   memory_order_relaxed)))) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_ble_gatt_server_watch(JSContext *ctx, JSValue *this_val,
                                 int argc, JSValue *argv)
{
    static const char *const allowed[] = {"capacity"};
    JSGCRef property_ref;
    JSValue *property = JS_PushGCRef(ctx, &property_ref);
    uint32_t capacity;
    (void)argv;
    if (this_val == NULL || argc > 1 ||
        !ble_server_from_value(ctx, *this_val)) {
        JS_PopGCRef(ctx, &property_ref);
        return JS_EXCEPTION;
    }
    if (argc == 1 && !JS_IsUndefined(argv[0])) {
        if (!ble_is_object(ctx, argv[0]) ||
            !ble_validate_option_keys(ctx, argv[0], "BLEGattServer.watch()",
                                      allowed, 1)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        *property = JS_GetPropertyStr(ctx, argv[0], "capacity");
        if (JS_IsException(*property)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(*property) &&
            (!ble_to_u32(ctx, *property, &capacity) ||
             capacity != s_ble.server.event_capacity)) {
            JS_PopGCRef(ctx, &property_ref);
            return JS_ThrowRangeError(
                ctx, "watch capacity is fixed when ble.open() captures the server");
        }
    }
    JS_PopGCRef(ctx, &property_ref);
    return JS_GetPropertyStr(ctx, *this_val, "_eventQueue");
}

JSValue js_ble_gatt_server_characteristic(JSContext *ctx, JSValue *this_val,
                                           int argc, JSValue *argv)
{
    JSCStringBuf buffer;
    const char *id;
    uint16_t index;
    ble_local_characteristic_ref_t *ref;
    JSGCRef object_ref, properties_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    JSValue *properties = JS_PushGCRef(ctx, &properties_ref);
    char uuid[BLE_UUID_TEXT_MAX];
    if (this_val == NULL || argc != 1 ||
        !ble_server_from_value(ctx, *this_val) ||
        !JS_IsString(ctx, argv[0]) ||
        (id = JS_ToCString(ctx, argv[0], &buffer)) == NULL) goto fail;
    for (index = 0; index < s_ble.server.characteristic_count; ++index)
        if (strcmp(id, s_ble.server.characteristics[index].id) == 0) break;
    if (index == s_ble.server.characteristic_count) {
        JS_ThrowReferenceError(ctx, "BLE_STALE_ATTRIBUTE: unknown characteristic id");
        goto fail;
    }
    *object = JS_NewObjectClassUser(ctx, JS_CLASS_BLE_LOCAL_CHARACTERISTIC);
    *properties = ble_properties_to_js(
        ctx, s_ble.server.characteristics[index].properties);
    if (JS_IsException(*object) || JS_IsException(*properties)) goto fail;
    ref = heap_caps_calloc(1, sizeof(*ref), MALLOC_CAP_8BIT);
    if (ref == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto fail;
    }
    ref->adapter_generation = s_ble.generation;
    ref->index = index;
    JS_SetOpaque(ctx, *object, ref);
    ble_uuid_to_text(&s_ble.server.characteristics[index].uuid, uuid);
    if (!esp32_mquickjs_set_property_ref(ctx, object, "id",
            JS_NewString(ctx, s_ble.server.characteristics[index].id)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "uuid",
            JS_NewString(ctx, uuid)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "maxLength",
            JS_NewUint32(ctx, s_ble.server.characteristics[index].max_length)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "properties", *properties)) {
        JS_SetOpaque(ctx, *object, NULL);
        heap_caps_free(ref);
        goto fail;
    }
    JS_PopGCRef(ctx, &properties_ref);
    return JS_PopGCRef(ctx, &object_ref);
fail:
    JS_PopGCRef(ctx, &properties_ref);
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

JSValue js_ble_local_characteristic_constructor(JSContext *ctx,
                                                JSValue *this_val,
                                                int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return ble_throw_constructor(ctx, "BLELocalCharacteristic");
}

