99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/ble/esp32_mquickjs_ble.c
void js_ble_local_characteristic_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    heap_caps_free(opaque);
}

JSValue js_ble_local_characteristic_value(JSContext *ctx, JSValue *this_val,
                                          int argc, JSValue *argv)
{
    ble_local_characteristic_t *local;
    uint8_t *payload;
    uint16_t length;
    (void)argv;
    if (this_val == NULL || argc != 0 ||
        (local = ble_local_characteristic_from_value(
             ctx, *this_val, NULL, true)) == NULL) return JS_EXCEPTION;
    taskENTER_CRITICAL(&local->lock);
    length = local->length;
    payload = heap_caps_malloc(length > 0 ? length : 1, MALLOC_CAP_8BIT);
    if (payload != NULL && length > 0) memcpy(payload, local->value, length);
    taskEXIT_CRITICAL(&local->lock);
    if (payload == NULL) return JS_ThrowOutOfMemory(ctx);
    return esp32_mquickjs_new_owned_byte_view(ctx, payload, length);
}

JSValue js_ble_local_characteristic_set_value(JSContext *ctx,
                                              JSValue *this_val,
                                              int argc, JSValue *argv)
{
    ble_local_characteristic_t *local;
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue error = JS_UNDEFINED;
    if (this_val == NULL || argc != 1 ||
        (local = ble_local_characteristic_from_value(
             ctx, *this_val, NULL, true)) == NULL) return JS_EXCEPTION;
    if (!esp32_mquickjs_get_byte_source(ctx, argv[0], "setValue",
                                        &source, &owned, &error)) return JS_EXCEPTION;
    if (source.length > local->max_length) {
        esp32_mquickjs_release_byte_source(owned);
        return ble_throw_error(ctx, "BLE_PAYLOAD_TOO_LARGE", BLE_HS_EMSGSIZE,
                               -1, -1, local->value_handle);
    }
    taskENTER_CRITICAL(&local->lock);
    if (source.length > 0) memcpy(local->value, source.data, source.length);
    local->length = source.length;
    taskEXIT_CRITICAL(&local->lock);
    esp32_mquickjs_release_byte_source(owned);
    return JS_NewInt64(ctx, source.length);
}

BLE_FUTURE_WRAPPER(js_ble_local_characteristic_notify, "notify")

#undef BLE_FUTURE_WRAPPER

JSValue js_ble_capabilities(JSContext *ctx, JSValue *this_val,
                            int argc, JSValue *argv)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    (void)this_val; (void)argc; (void)argv;
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "apiVersion",
                                         JS_NewString(ctx, "v1")) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "target",
                                         JS_NewString(ctx, CONFIG_IDF_TARGET)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "idfVersion",
                                         JS_NewString(ctx, IDF_VER)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "supported", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "classic", JS_FALSE) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "central", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "peripheral", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "observer", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "broadcaster", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "legacyAdvertising", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "extendedAdvertising", JS_FALSE) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "maxConnections",
            JS_NewUint32(ctx, CONFIG_ESP32_MQUICKJS_BLE_MAX_CONNECTIONS)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "maxMtu",
            JS_NewUint32(ctx, CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "bonding",
            JS_NewBool(CONFIG_ESP32_MQUICKJS_BLE_BONDING)) ||
        !esp32_mquickjs_set_property_ref(ctx, object, "privacy", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(ctx, object,
                                         "concurrentScanAdvertising", JS_FALSE)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &object_ref);
}

JSValue js_ble_open(JSContext *ctx, JSValue *this_val,
                    int argc, JSValue *argv)
{
    if (this_val == NULL)
        return JS_ThrowTypeError(ctx, "ble.open() has no receiver");
    return ble_future_call_and_wait(ctx, *this_val, "open", argc, argv);
}

static bool ble_register_future_drivers(JSContext *ctx,
                                        esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref, module_ref, adapter_ref, scanner_ref, advertiser_ref,
        connection_ref, notification_ref, local_ref, method_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref);
    JSValue *module = JS_PushGCRef(ctx, &module_ref);
    JSValue *adapter = JS_PushGCRef(ctx, &adapter_ref);
    JSValue *scanner = JS_PushGCRef(ctx, &scanner_ref);
    JSValue *advertiser = JS_PushGCRef(ctx, &advertiser_ref);
    JSValue *connection = JS_PushGCRef(ctx, &connection_ref);
    JSValue *notification = JS_PushGCRef(ctx, &notification_ref);
    JSValue *local = JS_PushGCRef(ctx, &local_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    bool result;

#define BLE_REGISTER_DRIVER(object_value, method_name, driver_value)          \
    do {                                                                       \
        *method = result                                                       \
                      ? JS_GetPropertyStr(ctx, (object_value), (method_name))   \
                      : JS_EXCEPTION;                                          \
        result = result && !JS_IsException(*method) &&                         \
                 esp32_mquickjs_future_register_driver(                        \
                     ctx, runtime, *method, (driver_value));                   \
    } while (0)

#define BLE_REGISTER_RECEIVE(object_value)                                    \
    do {                                                                       \
        *method = result                                                       \
                      ? JS_GetPropertyStr(ctx, (object_value), "receive")      \
                      : JS_EXCEPTION;                                          \
        result = result && !JS_IsException(*method) &&                         \
                 esp32_mquickjs_event_queue_register_receive_alias(            \
                     ctx, runtime, *method);                                   \
    } while (0)

    *global = JS_GetGlobalObject(ctx);
    *module = JS_IsException(*global) ? JS_EXCEPTION
                                     : JS_GetPropertyStr(ctx, *global, "ble");
    result = !JS_IsException(*module);
    BLE_REGISTER_DRIVER(*module, "open", &s_ble_open_driver);
    *adapter = result ? JS_NewObjectClassUser(ctx, JS_CLASS_BLE_ADAPTER)
                      : JS_EXCEPTION;
    result = result && !JS_IsException(*adapter);
    BLE_REGISTER_DRIVER(*adapter, "scan", &s_ble_scan_driver);
    BLE_REGISTER_DRIVER(*adapter, "connect", &s_ble_connect_driver);
    BLE_REGISTER_DRIVER(*adapter, "advertise", &s_ble_advertise_driver);
    BLE_REGISTER_DRIVER(*adapter, "removeBond", &s_ble_remove_bond_driver);
    BLE_REGISTER_DRIVER(*adapter, "clearBonds", &s_ble_clear_bonds_driver);
    BLE_REGISTER_DRIVER(*adapter, "close", &s_ble_adapter_close_driver);
    *scanner = result ? JS_NewObjectClassUser(ctx, JS_CLASS_BLE_SCANNER)
                      : JS_EXCEPTION;
    result = result && !JS_IsException(*scanner);
    BLE_REGISTER_RECEIVE(*scanner);
    BLE_REGISTER_DRIVER(*scanner, "close", &s_ble_scanner_close_driver);
    *advertiser = result ? JS_NewObjectClassUser(ctx, JS_CLASS_BLE_ADVERTISER)
                         : JS_EXCEPTION;
    result = result && !JS_IsException(*advertiser);
    BLE_REGISTER_RECEIVE(*advertiser);
    BLE_REGISTER_DRIVER(*advertiser, "close", &s_ble_advertiser_close_driver);
    *connection = result ? JS_NewObjectClassUser(ctx, JS_CLASS_BLE_CONNECTION)
                         : JS_EXCEPTION;
    result = result && !JS_IsException(*connection);
    BLE_REGISTER_RECEIVE(*connection);
    BLE_REGISTER_DRIVER(*connection, "pair", &s_ble_pair_driver);
    BLE_REGISTER_DRIVER(*connection, "exchangeMtu", &s_ble_exchange_mtu_driver);
    BLE_REGISTER_DRIVER(*connection, "readRssi", &s_ble_read_rssi_driver);
    BLE_REGISTER_DRIVER(*connection, "discover", &s_ble_discover_driver);
    BLE_REGISTER_DRIVER(*connection, "readHandle", &s_ble_gatt_read_driver);
    BLE_REGISTER_DRIVER(*connection, "writeHandle", &s_ble_gatt_write_driver);
    BLE_REGISTER_DRIVER(*connection, "subscribeHandle",
                        &s_ble_subscribe_driver);
    BLE_REGISTER_DRIVER(*connection, "close", &s_ble_connection_close_driver);
    *notification = result
                        ? JS_NewObjectClassUser(ctx,
                              JS_CLASS_BLE_NOTIFICATION_STREAM)
                        : JS_EXCEPTION;
    result = result && !JS_IsException(*notification);
    BLE_REGISTER_RECEIVE(*notification);
    BLE_REGISTER_DRIVER(*notification, "close", &s_ble_subscription_close_driver);
    *local = result
                 ? JS_NewObjectClassUser(ctx, JS_CLASS_BLE_LOCAL_CHARACTERISTIC)
                 : JS_EXCEPTION;
    result = result && !JS_IsException(*local);
    BLE_REGISTER_DRIVER(*local, "notify", &s_ble_server_notify_driver);
    if (!result && !JS_HasException(ctx))
        JS_ThrowInternalError(ctx, "failed to register BLE Future drivers");
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &local_ref);
    JS_PopGCRef(ctx, &notification_ref);
    JS_PopGCRef(ctx, &connection_ref);
    JS_PopGCRef(ctx, &advertiser_ref);
    JS_PopGCRef(ctx, &scanner_ref);
    JS_PopGCRef(ctx, &adapter_ref);
    JS_PopGCRef(ctx, &module_ref);
    JS_PopGCRef(ctx, &global_ref);
#undef BLE_REGISTER_RECEIVE
#undef BLE_REGISTER_DRIVER
    return result;
}

bool esp32_mquickjs_init_ble_runtime(JSContext *ctx,
                                     esp32_mquickjs_runtime_t *runtime)
{
    bool registered;

    if (ctx == NULL || runtime == NULL ||
        s_ble.lifecycle != BLE_LIFECYCLE_CLOSED) return false;
    if (s_ble_connection_mutex == NULL)
        s_ble_connection_mutex = xSemaphoreCreateRecursiveMutexStatic(
            &s_ble_connection_mutex_storage);
    if (s_ble_connection_mutex == NULL) return false;
    s_ble.ctx = ctx;
    s_ble.runtime = runtime;
    atomic_init(&s_ble_open_state, NULL);
    atomic_init(&s_ble_server_notify_state, NULL);
    ble_reset_orphan_close();
    registered = ble_register_future_drivers(ctx, runtime);
    if (registered && !esp32_mquickjs_register_async_poller(
                          runtime, ble_orphan_close_poller, NULL)) {
        JS_ThrowInternalError(ctx,
                              "failed to register BLE orphan close poller");
        registered = false;
    }
    return registered;
}

bool esp32_mquickjs_deinit_ble_runtime(JSContext *ctx)
{
    int cleanup_result;

    (void)ctx;
    if (atomic_load_explicit(&s_ble_orphan_close.worker_submitted,
                             memory_order_acquire)) {
        while (!atomic_load_explicit(&s_ble_orphan_close.worker_completed,
                                     memory_order_acquire)) {
            vTaskDelay(1);
        }
        atomic_store_explicit(&s_ble_orphan_close.worker_submitted, false,
                              memory_order_release);
        atomic_store_explicit(&s_ble_orphan_close.worker_completed, false,
                              memory_order_release);
    }
    if (s_ble.lifecycle != BLE_LIFECYCLE_CLOSED) {
        if (s_ble.scanner.active) (void)ble_gap_disc_cancel();
        if (s_ble.advertiser.active) (void)ble_gap_adv_stop();
        for (uint16_t index = 0; index < s_ble.max_connections; ++index) {
            ble_connection_slot_t *slot = &s_ble.connections[index];
            if (slot->open && slot->release_on_disconnect)
                ble_terminate_unclaimed_connection(slot, slot->generation);
        }
        if (!ble_wait_for_pending_connects(BLE_CONNECT_CANCEL_QUIESCE_MS)) {
            ESP_LOGE(TAG, "BLE runtime cleanup retained: pending connect callbacks");
            s_ble.lifecycle = BLE_LIFECYCLE_FAILED;
            return false;
        }
        cleanup_result = ble_cleanup_native(&s_ble);
        if (cleanup_result != 0) {
            ESP_LOGE(TAG, "BLE runtime cleanup retained: %d", cleanup_result);
            s_ble.lifecycle = BLE_LIFECYCLE_FAILED;
            return false;
        }
        ble_free_pools(&s_ble);
        s_ble.lifecycle = BLE_LIFECYCLE_CLOSED;
        s_ble.runtime = NULL;
    }
    ble_reset_orphan_close();
    return true;
}

#endif
